[Killed] BlockStatement
src/hazard/classify.ts:31:55
  * report transition effects as INTERVAL_DRIFT rather than as a run of
  * skipped or doubled firings.
  */
-export function isIntervalLike(ast: CronAst): boolean {
-  return ast.minute.startsWithAsterisk && ast.minute.values.length > 1;
-}
+export function isIntervalLike(ast: CronAst): boolean {}
 
 function sortHazards(hazards: Hazard[]): Hazard[] {
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [ { …(10) }, { …(10) }, …(2) ] to have a length of +0 but got 4

[Killed] ConditionalExpression
src/hazard/classify.ts:32:10
  * skipped or doubled firings.
  */
 export function isIntervalLike(ast: CronAst): boolean {
-  return ast.minute.startsWithAsterisk && ast.minute.values.length > 1;
+  return false;
 }
 
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [ { …(10) }, { …(10) }, …(2) ] to have a length of +0 but got 4

[Killed] ConditionalExpression
src/hazard/classify.ts:32:10
  * skipped or doubled firings.
  */
 export function isIntervalLike(ast: CronAst): boolean {
-  return ast.minute.startsWithAsterisk && ast.minute.values.length > 1;
+  return true;
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hazard/classify.ts:35:51
   return ast.minute.startsWithAsterisk && ast.minute.values.length > 1;
 }
 
-function sortHazards(hazards: Hazard[]): Hazard[] {
-  return [...hazards].sort((a, b) => {
-    const bySeverity = severityRank(b.severity) - severityRank(a.severity);
-    if (bySeverity !== 0) {
-      return bySeverity;
-    }
-    return wallMillisFromFields(a.intendedLocal) - wallMillisFromFields(b.intendedLocal);
-  });
-}
+function sortHazards(hazards: Hazard[]): Hazard[] {}
 
 /**
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: */15 * * * * in UTC: expected undefined to deeply equal []

[Survived] MethodExpression
src/hazard/classify.ts:36:10
 }
 
 function sortHazards(hazards: Hazard[]): Hazard[] {
-  return [...hazards].sort((a, b) => {
-    const bySeverity = severityRank(b.severity) - severityRank(a.severity);
-    if (bySeverity !== 0) {
-      return bySeverity;
-    }
-    return wallMillisFromFields(a.intendedLocal) - wallMillisFromFields(b.intendedLocal);
-  });
+  return [...hazards];
 }
 

[Survived] BlockStatement
src/hazard/classify.ts:36:38
 }
 
 function sortHazards(hazards: Hazard[]): Hazard[] {
-  return [...hazards].sort((a, b) => {
-    const bySeverity = severityRank(b.severity) - severityRank(a.severity);
-    if (bySeverity !== 0) {
-      return bySeverity;
-    }
-    return wallMillisFromFields(a.intendedLocal) - wallMillisFromFields(b.intendedLocal);
-  });
+  return [...hazards].sort((a, b) => {});
 }
 

[Survived] ArithmeticOperator
src/hazard/classify.ts:37:24
 
 function sortHazards(hazards: Hazard[]): Hazard[] {
   return [...hazards].sort((a, b) => {
-    const bySeverity = severityRank(b.severity) - severityRank(a.severity);
+    const bySeverity = severityRank(b.severity) + severityRank(a.severity);
     if (bySeverity !== 0) {
       return bySeverity;

[Survived] ConditionalExpression
src/hazard/classify.ts:38:9
 function sortHazards(hazards: Hazard[]): Hazard[] {
   return [...hazards].sort((a, b) => {
     const bySeverity = severityRank(b.severity) - severityRank(a.severity);
-    if (bySeverity !== 0) {
+    if (true) {
       return bySeverity;
     }

[NoCoverage] BlockStatement
src/hazard/classify.ts:38:27
 function sortHazards(hazards: Hazard[]): Hazard[] {
   return [...hazards].sort((a, b) => {
     const bySeverity = severityRank(b.severity) - severityRank(a.severity);
-    if (bySeverity !== 0) {
-      return bySeverity;
-    }
+    if (bySeverity !== 0) {}
     return wallMillisFromFields(a.intendedLocal) - wallMillisFromFields(b.intendedLocal);
   });

[Survived] ArithmeticOperator
src/hazard/classify.ts:41:12
     if (bySeverity !== 0) {
       return bySeverity;
     }
-    return wallMillisFromFields(a.intendedLocal) - wallMillisFromFields(b.intendedLocal);
+    return wallMillisFromFields(a.intendedLocal) + wallMillisFromFields(b.intendedLocal);
   });
 }

[Killed] LogicalOperator
src/hazard/classify.ts:50:22
  * the window. The ast must already be parsed under the given dialect.
  */
 export function classifyHazards(ast: CronAst, backend: TzBackend, input: ClassifyInput): Hazard[] {
-  const idempotent = input.idempotent ?? false;
+  const idempotent = input.idempotent && false;
   const firings = enumerateFirings(ast, input.zone, input.from, input.to);
   const hazards: Hazard[] = [];
killedBy: severity model the idempotence flag flips a real doubled hazard from critical to low without changing anything else
statusReason: expected 'critical' to be 'low' // Object.is equality

[Survived] BooleanLiteral
src/hazard/classify.ts:50:42
  * the window. The ast must already be parsed under the given dialect.
  */
 export function classifyHazards(ast: CronAst, backend: TzBackend, input: ClassifyInput): Hazard[] {
-  const idempotent = input.idempotent ?? false;
+  const idempotent = input.idempotent ?? true;
   const firings = enumerateFirings(ast, input.zone, input.from, input.to);
   const hazards: Hazard[] = [];

[Killed] ConditionalExpression
src/hazard/classify.ts:54:7
   const firings = enumerateFirings(ast, input.zone, input.from, input.to);
   const hazards: Hazard[] = [];
 
-  if (isIntervalLike(ast)) {
+  if (true) {
     hazards.push(
       ...intervalDriftHazards(
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/classify.ts:54:7
   const firings = enumerateFirings(ast, input.zone, input.from, input.to);
   const hazards: Hazard[] = [];
 
-  if (isIntervalLike(ast)) {
+  if (false) {
     hazards.push(
       ...intervalDriftHazards(
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [ { …(10) }, { …(10) }, …(2) ] to have a length of +0 but got 4

[Killed] BlockStatement
src/hazard/classify.ts:67:10
         idempotent,
       ),
     );
-  } else {
-    const resolved = resolveFirings(firings, input.zone, backend);
-    hazards.push(
-      ...perFiringHazards(resolved, input.expression, input.dialect, input.zone, backend, idempotent),
-    );
-    hazards.push(
-      ...countAnomalyHazards(resolved, input.expression, input.dialect, input.zone, backend, idempotent),
-    );
-  }
+  } else {}
 
   hazards.push(
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[NoCoverage] BlockStatement
src/hazard/classify.ts:88:88
  * in one call. Throws when the expression does not parse under the
  * dialect, with the first located error.
  */
-export function classifyExpression(input: ClassifyInput, backend: TzBackend): Hazard[] {
-  const parsed = parse(input.expression, input.dialect);
-  if (!parsed.ok) {
-    const first = parsed.errors[0];
-    throw new Error(
-      `cannot classify: "${input.expression}" is invalid ${input.dialect}` +
-        (first === undefined ? '' : ` at offset ${first.offset}: ${first.reason}`),
-    );
-  }
-  return classifyHazards(parsed.ast, backend, input);
-}
+export function classifyExpression(input: ClassifyInput, backend: TzBackend): Hazard[] {}
 

[NoCoverage] ConditionalExpression
src/hazard/classify.ts:90:7
  */
 export function classifyExpression(input: ClassifyInput, backend: TzBackend): Hazard[] {
   const parsed = parse(input.expression, input.dialect);
-  if (!parsed.ok) {
+  if (true) {
     const first = parsed.errors[0];
     throw new Error(

[NoCoverage] BlockStatement
src/hazard/classify.ts:90:19
  */
 export function classifyExpression(input: ClassifyInput, backend: TzBackend): Hazard[] {
   const parsed = parse(input.expression, input.dialect);
-  if (!parsed.ok) {
-    const first = parsed.errors[0];
-    throw new Error(
-      `cannot classify: "${input.expression}" is invalid ${input.dialect}` +
-        (first === undefined ? '' : ` at offset ${first.offset}: ${first.reason}`),
-    );
-  }
+  if (!parsed.ok) {}
   return classifyHazards(parsed.ast, backend, input);
 }

[NoCoverage] ConditionalExpression
src/hazard/classify.ts:94:10
     const first = parsed.errors[0];
     throw new Error(
       `cannot classify: "${input.expression}" is invalid ${input.dialect}` +
-        (first === undefined ? '' : ` at offset ${first.offset}: ${first.reason}`),
+        (true ? '' : ` at offset ${first.offset}: ${first.reason}`),
     );
   }

[NoCoverage] ConditionalExpression
src/hazard/classify.ts:94:10
     const first = parsed.errors[0];
     throw new Error(
       `cannot classify: "${input.expression}" is invalid ${input.dialect}` +
-        (first === undefined ? '' : ` at offset ${first.offset}: ${first.reason}`),
+        (false ? '' : ` at offset ${first.offset}: ${first.reason}`),
     );
   }
