[Killed] BlockStatement
src/hazard/count-anomaly.ts:21:45
   firingCount: number;
 }
 
-function dayKey(local: LocalFiring): string {
-  return `${local.year}-${local.month}-${local.day}`;
-}
+function dayKey(local: LocalFiring): string {}
 
 function modalCount(groups: DayGroup[]): number {
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hazard/count-anomaly.ts:25:49
   return `${local.year}-${local.month}-${local.day}`;
 }
 
-function modalCount(groups: DayGroup[]): number {
-  const counts = new Map<number, number>();
-  for (const group of groups) {
-    counts.set(group.firingCount, (counts.get(group.firingCount) ?? 0) + 1);
-  }
-  let best = 0;
-  let bestFreq = -1;
-  for (const [count, freq] of counts) {
-    if (freq > bestFreq) {
-      best = count;
-      bestFreq = freq;
-    }
-  }
-  return best;
-}
+function modalCount(groups: DayGroup[]): number {}
 
 function structuralReason(
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/hazard/count-anomaly.ts:27:31
 
 function modalCount(groups: DayGroup[]): number {
   const counts = new Map<number, number>();
-  for (const group of groups) {
-    counts.set(group.firingCount, (counts.get(group.firingCount) ?? 0) + 1);
-  }
+  for (const group of groups) {}
   let best = 0;
   let bestFreq = -1;
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/hazard/count-anomaly.ts:28:36
 function modalCount(groups: DayGroup[]): number {
   const counts = new Map<number, number>();
   for (const group of groups) {
-    counts.set(group.firingCount, (counts.get(group.firingCount) ?? 0) + 1);
+    counts.set(group.firingCount, (counts.get(group.firingCount) && 0) + 1);
   }
   let best = 0;
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/hazard/count-anomaly.ts:28:35
 function modalCount(groups: DayGroup[]): number {
   const counts = new Map<number, number>();
   for (const group of groups) {
-    counts.set(group.firingCount, (counts.get(group.firingCount) ?? 0) + 1);
+    counts.set(group.firingCount, (counts.get(group.firingCount) ?? 0) - 1);
   }
   let best = 0;
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Survived] UnaryOperator
src/hazard/count-anomaly.ts:31:18
     counts.set(group.firingCount, (counts.get(group.firingCount) ?? 0) + 1);
   }
   let best = 0;
-  let bestFreq = -1;
+  let bestFreq = +1;
   for (const [count, freq] of counts) {
     if (freq > bestFreq) {

[Killed] BlockStatement
src/hazard/count-anomaly.ts:32:39
   }
   let best = 0;
   let bestFreq = -1;
-  for (const [count, freq] of counts) {
-    if (freq > bestFreq) {
-      best = count;
-      bestFreq = freq;
-    }
-  }
+  for (const [count, freq] of counts) {}
   return best;
 }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/count-anomaly.ts:33:9
   let best = 0;
   let bestFreq = -1;
   for (const [count, freq] of counts) {
-    if (freq > bestFreq) {
+    if (true) {
       best = count;
       bestFreq = freq;
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/count-anomaly.ts:33:9
   let best = 0;
   let bestFreq = -1;
   for (const [count, freq] of counts) {
-    if (freq > bestFreq) {
+    if (false) {
       best = count;
       bestFreq = freq;
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hazard/count-anomaly.ts:45:40
   local: LocalFiring,
   zone: string,
   backend: TzBackend,
-): CountAnomalyDetail['reason'] | null {
-  const noon = { year: local.year, month: local.month, day: local.day, hour: 12, minute: 0, second: 0 };
-  const resolution = resolveWallClock(noon, zone, backend);
-  if (resolution.kind === 'nonexistent') {
-    return 'phantom-day';
-  }
-  if (resolution.kind === 'ambiguous') {
-    return 'duplicated-day';
-  }
-  return null;
-}
+): CountAnomalyDetail['reason'] | null {}
 
 /** Emits COUNT_ANOMALY for structurally anomalous calendar days. */
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected undefined to be 'phantom-day' // Object.is equality

[Killed] BlockStatement
src/hazard/count-anomaly.ts:48:42
 ): CountAnomalyDetail['reason'] | null {
   const noon = { year: local.year, month: local.month, day: local.day, hour: 12, minute: 0, second: 0 };
   const resolution = resolveWallClock(noon, zone, backend);
-  if (resolution.kind === 'nonexistent') {
-    return 'phantom-day';
-  }
+  if (resolution.kind === 'nonexistent') {}
   if (resolution.kind === 'ambiguous') {
     return 'duplicated-day';
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/count-anomaly.ts:48:7
 ): CountAnomalyDetail['reason'] | null {
   const noon = { year: local.year, month: local.month, day: local.day, hour: 12, minute: 0, second: 0 };
   const resolution = resolveWallClock(noon, zone, backend);
-  if (resolution.kind === 'nonexistent') {
+  if (false) {
     return 'phantom-day';
   }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Survived] EqualityOperator
src/hazard/count-anomaly.ts:51:7
   if (resolution.kind === 'nonexistent') {
     return 'phantom-day';
   }
-  if (resolution.kind === 'ambiguous') {
+  if (resolution.kind !== 'ambiguous') {
     return 'duplicated-day';
   }

[Survived] ConditionalExpression
src/hazard/count-anomaly.ts:51:7
   if (resolution.kind === 'nonexistent') {
     return 'phantom-day';
   }
-  if (resolution.kind === 'ambiguous') {
+  if (true) {
     return 'duplicated-day';
   }

[NoCoverage] StringLiteral
src/hazard/count-anomaly.ts:52:12
     return 'phantom-day';
   }
   if (resolution.kind === 'ambiguous') {
-    return 'duplicated-day';
+    return "";
   }
   return null;

[Killed] BlockStatement
src/hazard/count-anomaly.ts:67:34
   idempotent: boolean,
 ): Hazard[] {
   const groups = new Map<string, DayGroup>();
-  for (const firing of resolved) {
-    const key = dayKey(firing.local);
-    const midnight = {
-      year: firing.local.year,
-      month: firing.local.month,
-      day: firing.local.day,
-      hour: 0,
-      minute: 0,
-      second: 0,
-    };
-    const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
-    if (firing.resolution.kind !== 'nonexistent') {
-      group.firingCount += 1;
-    }
-    groups.set(key, group);
-  }
+  for (const firing of resolved) {}
 
   const list = [...groups.values()];
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/hazard/count-anomaly.ts:69:22
   const groups = new Map<string, DayGroup>();
   for (const firing of resolved) {
     const key = dayKey(firing.local);
-    const midnight = {
-      year: firing.local.year,
-      month: firing.local.month,
-      day: firing.local.day,
-      hour: 0,
-      minute: 0,
-      second: 0,
-    };
+    const midnight = {};
     const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
     if (firing.resolution.kind !== 'nonexistent') {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: month out of range: undefined

[Killed] LogicalOperator
src/hazard/count-anomaly.ts:77:19
       minute: 0,
       second: 0,
     };
-    const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
+    const group = groups.get(key) && {
+  local: midnight,
+  firingCount: 0
+};
     if (firing.resolution.kind !== 'nonexistent') {
       group.firingCount += 1;
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of undefined (reading 'firingCount')

[Killed] ObjectLiteral
src/hazard/count-anomaly.ts:77:38
       minute: 0,
       second: 0,
     };
-    const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
+    const group = groups.get(key) ?? {};
     if (firing.resolution.kind !== 'nonexistent') {
       group.firingCount += 1;
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of undefined (reading 'year')

[Killed] ConditionalExpression
src/hazard/count-anomaly.ts:78:9
       second: 0,
     };
     const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
-    if (firing.resolution.kind !== 'nonexistent') {
+    if (true) {
       group.firingCount += 1;
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/count-anomaly.ts:78:9
       second: 0,
     };
     const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
-    if (firing.resolution.kind !== 'nonexistent') {
+    if (firing.resolution.kind === 'nonexistent') {
       group.firingCount += 1;
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected 1 to be +0 // Object.is equality

[Killed] AssignmentOperator
src/hazard/count-anomaly.ts:79:7
     };
     const group = groups.get(key) ?? { local: midnight, firingCount: 0 };
     if (firing.resolution.kind !== 'nonexistent') {
-      group.firingCount += 1;
+      group.firingCount -= 1;
     }
     groups.set(key, group);
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/hazard/count-anomaly.ts:87:29
   const list = [...groups.values()];
   const modal = modalCount(list);
   const hazards: Hazard[] = [];
-  for (const group of list) {
-    if (group.firingCount === modal) {
-      continue;
-    }
-    const reason = structuralReason(group.local, zone, backend);
-    if (reason === null) {
-      continue;
-    }
-    hazards.push(
-      makeHazard({
-        kind: 'COUNT_ANOMALY',
-        expression,
-        dialect,
-        zone,
-        intendedLocal: group.local,
-        instants: [],
-        causingTransition: null,
-        idempotent,
-        detail: {
-          kind: 'COUNT_ANOMALY',
-          count: { dayFiringCount: group.firingCount, modalCount: modal, reason },
-        },
-      }),
-    );
-  }
+  for (const group of list) {}
   return hazards;
 }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/count-anomaly.ts:88:9
   const modal = modalCount(list);
   const hazards: Hazard[] = [];
   for (const group of list) {
-    if (group.firingCount === modal) {
+    if (group.firingCount !== modal) {
       continue;
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/count-anomaly.ts:88:9
   const modal = modalCount(list);
   const hazards: Hazard[] = [];
   for (const group of list) {
-    if (group.firingCount === modal) {
+    if (true) {
       continue;
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/count-anomaly.ts:92:9
       continue;
     }
     const reason = structuralReason(group.local, zone, backend);
-    if (reason === null) {
+    if (true) {
       continue;
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/count-anomaly.ts:92:9
       continue;
     }
     const reason = structuralReason(group.local, zone, backend);
-    if (reason === null) {
+    if (reason !== null) {
       continue;
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/hazard/count-anomaly.ts:97:15
     }
     hazards.push(
       makeHazard({
-        kind: 'COUNT_ANOMALY',
+        kind: "",
         expression,
         dialect,
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0
