[Killed] ArithmeticOperator
src/hazard/interval-drift.ts:22:28
 import { windowTransitions } from './transitions';
 import type { Hazard } from './types';
 
-const THREE_HOURS_MILLIS = 3 * 3_600_000;
+const THREE_HOURS_MILLIS = 3 / 3_600_000;
 
 /** Modal positive spacing between consecutive firings, or null. */
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hazard/interval-drift.ts:25:62
 const THREE_HOURS_MILLIS = 3 * 3_600_000;
 
 /** Modal positive spacing between consecutive firings, or null. */
-function nominalCadence(wallMillis: number[]): number | null {
-  if (wallMillis.length < 2) {
-    return null;
-  }
-  const counts = new Map<number, number>();
-  for (let i = 1; i < wallMillis.length; i += 1) {
-    const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
-    if (diff > 0) {
-      counts.set(diff, (counts.get(diff) ?? 0) + 1);
-    }
-  }
-  let best: number | null = null;
-  let bestCount = 0;
-  for (const [diff, count] of counts) {
-    if (count > bestCount || (count === bestCount && best !== null && diff < best)) {
-      best = diff;
-      bestCount = count;
-    }
-  }
-  return best;
-}
+function nominalCadence(wallMillis: number[]): number | null {}
 
 interface Bracket {
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected undefined to be 900000 // Object.is equality

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:26:7
 
 /** Modal positive spacing between consecutive firings, or null. */
 function nominalCadence(wallMillis: number[]): number | null {
-  if (wallMillis.length < 2) {
+  if (true) {
     return null;
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:26:7
 
 /** Modal positive spacing between consecutive firings, or null. */
 function nominalCadence(wallMillis: number[]): number | null {
-  if (wallMillis.length < 2) {
+  if (wallMillis.length >= 2) {
     return null;
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hazard/interval-drift.ts:30:50
     return null;
   }
   const counts = new Map<number, number>();
-  for (let i = 1; i < wallMillis.length; i += 1) {
-    const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
-    if (diff > 0) {
-      counts.set(diff, (counts.get(diff) ?? 0) + 1);
-    }
-  }
+  for (let i = 1; i < wallMillis.length; i += 1) {}
   let best: number | null = null;
   let bestCount = 0;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:30:19
     return null;
   }
   const counts = new Map<number, number>();
-  for (let i = 1; i < wallMillis.length; i += 1) {
+  for (let i = 1; i >= wallMillis.length; i += 1) {
     const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
     if (diff > 0) {
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/hazard/interval-drift.ts:31:19
   }
   const counts = new Map<number, number>();
   for (let i = 1; i < wallMillis.length; i += 1) {
-    const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
+    const diff = (wallMillis[i] && 0) - (wallMillis[i - 1] ?? 0);
     if (diff > 0) {
       counts.set(diff, (counts.get(diff) ?? 0) + 1);
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArithmeticOperator
src/hazard/interval-drift.ts:31:53
   }
   const counts = new Map<number, number>();
   for (let i = 1; i < wallMillis.length; i += 1) {
-    const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
+    const diff = (wallMillis[i] ?? 0) - (wallMillis[i + 1] ?? 0);
     if (diff > 0) {
       counts.set(diff, (counts.get(diff) ?? 0) + 1);
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected 1735688700000 to be 900000 // Object.is equality

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:32:9
   const counts = new Map<number, number>();
   for (let i = 1; i < wallMillis.length; i += 1) {
     const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
-    if (diff > 0) {
+    if (false) {
       counts.set(diff, (counts.get(diff) ?? 0) + 1);
     }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:32:9
   const counts = new Map<number, number>();
   for (let i = 1; i < wallMillis.length; i += 1) {
     const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
-    if (diff > 0) {
+    if (diff <= 0) {
       counts.set(diff, (counts.get(diff) ?? 0) + 1);
     }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArithmeticOperator
src/hazard/interval-drift.ts:33:24
   for (let i = 1; i < wallMillis.length; i += 1) {
     const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
     if (diff > 0) {
-      counts.set(diff, (counts.get(diff) ?? 0) + 1);
+      counts.set(diff, (counts.get(diff) ?? 0) - 1);
     }
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/hazard/interval-drift.ts:33:25
   for (let i = 1; i < wallMillis.length; i += 1) {
     const diff = (wallMillis[i] ?? 0) - (wallMillis[i - 1] ?? 0);
     if (diff > 0) {
-      counts.set(diff, (counts.get(diff) ?? 0) + 1);
+      counts.set(diff, (counts.get(diff) && 0) + 1);
     }
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hazard/interval-drift.ts:38:39
   }
   let best: number | null = null;
   let bestCount = 0;
-  for (const [diff, count] of counts) {
-    if (count > bestCount || (count === bestCount && best !== null && diff < best)) {
-      best = diff;
-      bestCount = count;
-    }
-  }
+  for (const [diff, count] of counts) {}
   return best;
 }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hazard/interval-drift.ts:39:85
   let best: number | null = null;
   let bestCount = 0;
   for (const [diff, count] of counts) {
-    if (count > bestCount || (count === bestCount && best !== null && diff < best)) {
-      best = diff;
-      bestCount = count;
-    }
+    if (count > bestCount || (count === bestCount && best !== null && diff < best)) {}
   }
   return best;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:39:9
   let best: number | null = null;
   let bestCount = 0;
   for (const [diff, count] of counts) {
-    if (count > bestCount || (count === bestCount && best !== null && diff < best)) {
+    if (false) {
       best = diff;
       bestCount = count;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] UnaryOperator
src/hazard/interval-drift.ts:67:20
   hiWall: number,
 ): Bracket | null {
   let before: LocalFiring | null = null;
-  let beforeWall = -Infinity;
+  let beforeWall = +Infinity;
   let after: LocalFiring | null = null;
   let afterWall = Infinity;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:70:19
   let beforeWall = -Infinity;
   let after: LocalFiring | null = null;
   let afterWall = Infinity;
-  for (let i = 0; i < firings.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const wall = wallMillis[i] ?? 0;
     const firing = firings[i];
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hazard/interval-drift.ts:70:47
   let beforeWall = -Infinity;
   let after: LocalFiring | null = null;
   let afterWall = Infinity;
-  for (let i = 0; i < firings.length; i += 1) {
-    const wall = wallMillis[i] ?? 0;
-    const firing = firings[i];
-    if (firing === undefined) {
-      continue;
-    }
-    if (wall < loWall && wall > beforeWall) {
-      before = firing;
-      beforeWall = wall;
-    }
-    if (wall >= hiWall && wall < afterWall) {
-      after = firing;
-      afterWall = wall;
-    }
-  }
+  for (let i = 0; i < firings.length; i += 1) {}
   if (before === null || after === null) {
     return null;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/hazard/interval-drift.ts:71:18
   let after: LocalFiring | null = null;
   let afterWall = Infinity;
   for (let i = 0; i < firings.length; i += 1) {
-    const wall = wallMillis[i] ?? 0;
+    const wall = wallMillis[i] && 0;
     const firing = firings[i];
     if (firing === undefined) {
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:73:9
   for (let i = 0; i < firings.length; i += 1) {
     const wall = wallMillis[i] ?? 0;
     const firing = firings[i];
-    if (firing === undefined) {
+    if (true) {
       continue;
     }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:73:9
   for (let i = 0; i < firings.length; i += 1) {
     const wall = wallMillis[i] ?? 0;
     const firing = firings[i];
-    if (firing === undefined) {
+    if (firing !== undefined) {
       continue;
     }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hazard/interval-drift.ts:76:45
     if (firing === undefined) {
       continue;
     }
-    if (wall < loWall && wall > beforeWall) {
-      before = firing;
-      beforeWall = wall;
-    }
+    if (wall < loWall && wall > beforeWall) {}
     if (wall >= hiWall && wall < afterWall) {
       after = firing;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:76:26
     if (firing === undefined) {
       continue;
     }
-    if (wall < loWall && wall > beforeWall) {
+    if (wall < loWall && wall <= beforeWall) {
       before = firing;
       beforeWall = wall;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:80:9
       before = firing;
       beforeWall = wall;
     }
-    if (wall >= hiWall && wall < afterWall) {
+    if (false) {
       after = firing;
       afterWall = wall;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:80:9
       before = firing;
       beforeWall = wall;
     }
-    if (wall >= hiWall && wall < afterWall) {
+    if (true) {
       after = firing;
       afterWall = wall;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:85:26
       afterWall = wall;
     }
   }
-  if (before === null || after === null) {
+  if (before === null || after !== null) {
     return null;
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:85:7
       afterWall = wall;
     }
   }
-  if (before === null || after === null) {
+  if (true) {
     return null;
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:88:7
   if (before === null || after === null) {
     return null;
   }
-  if (loWall - beforeWall > THREE_HOURS_MILLIS || afterWall - hiWall > THREE_HOURS_MILLIS) {
+  if (loWall - beforeWall <= THREE_HOURS_MILLIS || afterWall - hiWall > THREE_HOURS_MILLIS) {
     return null;
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArithmeticOperator
src/hazard/interval-drift.ts:88:7
   if (before === null || after === null) {
     return null;
   }
-  if (loWall - beforeWall > THREE_HOURS_MILLIS || afterWall - hiWall > THREE_HOURS_MILLIS) {
+  if (loWall + beforeWall > THREE_HOURS_MILLIS || afterWall - hiWall > THREE_HOURS_MILLIS) {
     return null;
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ObjectLiteral
src/hazard/interval-drift.ts:91:10
   if (loWall - beforeWall > THREE_HOURS_MILLIS || afterWall - hiWall > THREE_HOURS_MILLIS) {
     return null;
   }
-  return { before, after };
+  return {};
 }
 
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: Cannot read properties of undefined (reading 'year')

[Killed] ArrowFunction
src/hazard/interval-drift.ts:105:34
   backend: TzBackend,
   idempotent: boolean,
 ): Hazard[] {
-  const wallMillis = firings.map((firing) => wallMillisFromFields(firing));
+  const wallMillis = firings.map(() => undefined);
   const cadence = nominalCadence(wallMillis);
   if (cadence === null) {
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/hazard/interval-drift.ts:107:7
 ): Hazard[] {
   const wallMillis = firings.map((firing) => wallMillisFromFields(firing));
   const cadence = nominalCadence(wallMillis);
-  if (cadence === null) {
+  if (cadence !== null) {
     return [];
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:107:7
 ): Hazard[] {
   const wallMillis = firings.map((firing) => wallMillisFromFields(firing));
   const cadence = nominalCadence(wallMillis);
-  if (cadence === null) {
+  if (true) {
     return [];
   }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[NoCoverage] ArrayDeclaration
src/hazard/interval-drift.ts:108:12
   const wallMillis = firings.map((firing) => wallMillisFromFields(firing));
   const cadence = nominalCadence(wallMillis);
   if (cadence === null) {
-    return [];
+    return ["Stryker was here"];
   }
   const hazards: Hazard[] = [];

[Survived] ArithmeticOperator
src/hazard/interval-drift.ts:112:23
   }
   const hazards: Hazard[] = [];
   for (const transition of windowTransitions(backend, zone, from, to)) {
-    const boundaryA = transition.instant + transition.offsetBeforeSeconds * 1000;
+    const boundaryA = transition.instant - transition.offsetBeforeSeconds * 1000;
     const boundaryB = transition.instant + transition.offsetAfterSeconds * 1000;
     const loWall = Math.min(boundaryA, boundaryB);

[Survived] ArithmeticOperator
src/hazard/interval-drift.ts:112:44
   }
   const hazards: Hazard[] = [];
   for (const transition of windowTransitions(backend, zone, from, to)) {
-    const boundaryA = transition.instant + transition.offsetBeforeSeconds * 1000;
+    const boundaryA = transition.instant + transition.offsetBeforeSeconds / 1000;
     const boundaryB = transition.instant + transition.offsetAfterSeconds * 1000;
     const loWall = Math.min(boundaryA, boundaryB);

[Survived] ArithmeticOperator
src/hazard/interval-drift.ts:113:23
   const hazards: Hazard[] = [];
   for (const transition of windowTransitions(backend, zone, from, to)) {
     const boundaryA = transition.instant + transition.offsetBeforeSeconds * 1000;
-    const boundaryB = transition.instant + transition.offsetAfterSeconds * 1000;
+    const boundaryB = transition.instant - transition.offsetAfterSeconds * 1000;
     const loWall = Math.min(boundaryA, boundaryB);
     const hiWall = Math.max(boundaryA, boundaryB);

[Survived] ArithmeticOperator
src/hazard/interval-drift.ts:113:44
   const hazards: Hazard[] = [];
   for (const transition of windowTransitions(backend, zone, from, to)) {
     const boundaryA = transition.instant + transition.offsetBeforeSeconds * 1000;
-    const boundaryB = transition.instant + transition.offsetAfterSeconds * 1000;
+    const boundaryB = transition.instant + transition.offsetAfterSeconds / 1000;
     const loWall = Math.min(boundaryA, boundaryB);
     const hiWall = Math.max(boundaryA, boundaryB);

[Survived] MethodExpression
src/hazard/interval-drift.ts:114:20
   for (const transition of windowTransitions(backend, zone, from, to)) {
     const boundaryA = transition.instant + transition.offsetBeforeSeconds * 1000;
     const boundaryB = transition.instant + transition.offsetAfterSeconds * 1000;
-    const loWall = Math.min(boundaryA, boundaryB);
+    const loWall = Math.max(boundaryA, boundaryB);
     const hiWall = Math.max(boundaryA, boundaryB);
     const bracket = bracketFirings(firings, wallMillis, loWall, hiWall);

[Survived] MethodExpression
src/hazard/interval-drift.ts:115:20
     const boundaryA = transition.instant + transition.offsetBeforeSeconds * 1000;
     const boundaryB = transition.instant + transition.offsetAfterSeconds * 1000;
     const loWall = Math.min(boundaryA, boundaryB);
-    const hiWall = Math.max(boundaryA, boundaryB);
+    const hiWall = Math.min(boundaryA, boundaryB);
     const bracket = bracketFirings(firings, wallMillis, loWall, hiWall);
     if (bracket === null) {

[Killed] EqualityOperator
src/hazard/interval-drift.ts:117:9
     const loWall = Math.min(boundaryA, boundaryB);
     const hiWall = Math.max(boundaryA, boundaryB);
     const bracket = bracketFirings(firings, wallMillis, loWall, hiWall);
-    if (bracket === null) {
+    if (bracket !== null) {
       continue;
     }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/hazard/interval-drift.ts:117:9
     const loWall = Math.min(boundaryA, boundaryB);
     const hiWall = Math.max(boundaryA, boundaryB);
     const bracket = bracketFirings(firings, wallMillis, loWall, hiWall);
-    if (bracket === null) {
+    if (true) {
       continue;
     }
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [] to have a length of 2 but got +0

[Killed] ObjectLiteral
src/hazard/interval-drift.ts:137:18
         idempotent,
         detail: {
           kind: 'INTERVAL_DRIFT',
-          drift: {
-            expectedIntervalMillis: cadence,
-            actualIntervalMillis: cadence + Math.abs(transition.deltaSeconds) * 1000,
-            before: bracket.before,
-            after: bracket.after,
-          },
+          drift: {},
         },
       }),
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected undefined to be 900000 // Object.is equality

[Killed] ArithmeticOperator
src/hazard/interval-drift.ts:139:35
           kind: 'INTERVAL_DRIFT',
           drift: {
             expectedIntervalMillis: cadence,
-            actualIntervalMillis: cadence + Math.abs(transition.deltaSeconds) * 1000,
+            actualIntervalMillis: cadence - Math.abs(transition.deltaSeconds) * 1000,
             before: bracket.before,
             after: bracket.after,
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected -2700000 to be 4500000 // Object.is equality

[Killed] ArithmeticOperator
src/hazard/interval-drift.ts:139:45
           kind: 'INTERVAL_DRIFT',
           drift: {
             expectedIntervalMillis: cadence,
-            actualIntervalMillis: cadence + Math.abs(transition.deltaSeconds) * 1000,
+            actualIntervalMillis: cadence + Math.abs(transition.deltaSeconds) / 1000,
             before: bracket.before,
             after: bracket.after,
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected 900003.6 to be 4500000 // Object.is equality
