[Killed] BlockStatement
src/hazard/zone-unstable.ts:30:84
   footerHasDst: boolean;
 }
 
-function footerBoundary(zoneinfoRoot: string, zone: string): FooterBoundary | null {
-  let data;
-  try {
-    data = parseTzif(readZoneFile(zoneinfoRoot, zone));
-  } catch {
-    return null;
-  }
-  if (data.transitionMillis.length === 0) {
-    return null;
-  }
-  const last = data.transitionMillis[data.transitionMillis.length - 1] ?? null;
-  if (last === null) {
-    return null;
-  }
-  const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
-  return { lastTableTransition: last, footerHasDst: posix !== null && posix.dstStart !== null };
-}
+function footerBoundary(zoneinfoRoot: string, zone: string): FooterBoundary | null {}
 
 /**
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of undefined (reading 'footerHasDst')

[Killed] BlockStatement
src/hazard/zone-unstable.ts:32:7
 
 function footerBoundary(zoneinfoRoot: string, zone: string): FooterBoundary | null {
   let data;
-  try {
-    data = parseTzif(readZoneFile(zoneinfoRoot, zone));
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of undefined (reading 'transitionMillis')

[NoCoverage] BlockStatement
src/hazard/zone-unstable.ts:34:11
   let data;
   try {
     data = parseTzif(readZoneFile(zoneinfoRoot, zone));
-  } catch {
-    return null;
-  }
+  } catch {}
   if (data.transitionMillis.length === 0) {
     return null;

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:37:7
   } catch {
     return null;
   }
-  if (data.transitionMillis.length === 0) {
+  if (true) {
     return null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/zone-unstable.ts:37:7
   } catch {
     return null;
   }
-  if (data.transitionMillis.length === 0) {
+  if (data.transitionMillis.length !== 0) {
     return null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/hazard/zone-unstable.ts:40:38
   if (data.transitionMillis.length === 0) {
     return null;
   }
-  const last = data.transitionMillis[data.transitionMillis.length - 1] ?? null;
+  const last = data.transitionMillis[data.transitionMillis.length + 1] ?? null;
   if (last === null) {
     return null;
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/hazard/zone-unstable.ts:40:16
   if (data.transitionMillis.length === 0) {
     return null;
   }
-  const last = data.transitionMillis[data.transitionMillis.length - 1] ?? null;
+  const last = data.transitionMillis[data.transitionMillis.length - 1] && null;
   if (last === null) {
     return null;
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:41:7
     return null;
   }
   const last = data.transitionMillis[data.transitionMillis.length - 1] ?? null;
-  if (last === null) {
+  if (true) {
     return null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/zone-unstable.ts:41:7
     return null;
   }
   const last = data.transitionMillis[data.transitionMillis.length - 1] ?? null;
-  if (last === null) {
+  if (last !== null) {
     return null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/zone-unstable.ts:44:17
   if (last === null) {
     return null;
   }
-  const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
+  const posix = data.posixTzString !== null ? null : parsePosixTz(data.posixTzString);
   return { lastTableTransition: last, footerHasDst: posix !== null && posix.dstStart !== null };
 }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:44:17
   if (last === null) {
     return null;
   }
-  const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
+  const posix = true ? null : parsePosixTz(data.posixTzString);
   return { lastTableTransition: last, footerHasDst: posix !== null && posix.dstStart !== null };
 }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/hazard/zone-unstable.ts:45:53
     return null;
   }
   const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
-  return { lastTableTransition: last, footerHasDst: posix !== null && posix.dstStart !== null };
+  return { lastTableTransition: last, footerHasDst: posix !== null || posix.dstStart !== null };
 }
 
killedBy: Asia/Kolkata: a half-hour offset, no DST, its last transition deep in the past the offset is a constant +5:30 with zero transitions in the modern era, so the POSIX footer governs every current firing
statusReason: expected [ { id: 'hz_fbefbc953d7da672', …(9) } ] to deeply equal []

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:45:53
     return null;
   }
   const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
-  return { lastTableTransition: last, footerHasDst: posix !== null && posix.dstStart !== null };
+  return { lastTableTransition: last, footerHasDst: true };
 }
 
killedBy: Asia/Kolkata: a half-hour offset, no DST, its last transition deep in the past the offset is a constant +5:30 with zero transitions in the modern era, so the POSIX footer governs every current firing
statusReason: expected [ { id: 'hz_fbefbc953d7da672', …(9) } ] to deeply equal []

[Killed] EqualityOperator
src/hazard/zone-unstable.ts:63:7
   zoneinfoRoot: string | undefined,
   idempotent: boolean,
 ): Hazard[] {
-  if (zoneinfoRoot === undefined) {
+  if (zoneinfoRoot !== undefined) {
     return [];
   }
killedBy: a DST footer governs firings past the last recorded transition (America/New_York) a 2039 window, beyond the 2037 table end, is labelled ZONE_UNSTABLE with the last table transition as its boundary
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:63:7
   zoneinfoRoot: string | undefined,
   idempotent: boolean,
 ): Hazard[] {
-  if (zoneinfoRoot === undefined) {
+  if (true) {
     return [];
   }
killedBy: a DST footer governs firings past the last recorded transition (America/New_York) a 2039 window, beyond the 2037 table end, is labelled ZONE_UNSTABLE with the last table transition as its boundary
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:67:7
     return [];
   }
   const boundary = footerBoundary(zoneinfoRoot, zone);
-  if (boundary === null || !boundary.footerHasDst) {
+  if (false) {
     return [];
   }
killedBy: Asia/Kolkata: a half-hour offset, no DST, its last transition deep in the past the offset is a constant +5:30 with zero transitions in the modern era, so the POSIX footer governs every current firing
statusReason: expected [ { id: 'hz_fbefbc953d7da672', …(9) } ] to deeply equal []

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:67:7
     return [];
   }
   const boundary = footerBoundary(zoneinfoRoot, zone);
-  if (boundary === null || !boundary.footerHasDst) {
+  if (false || !boundary.footerHasDst) {
     return [];
   }
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of null (reading 'footerHasDst')

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:71:17
     return [];
   }
   const firstBeyond = firings.find(
-    (firing) => wallMillisFromFields(firing) >= boundary.lastTableTransition,
+    (firing) => false,
   );
   if (firstBeyond === undefined) {
killedBy: a DST footer governs firings past the last recorded transition (America/New_York) a 2039 window, beyond the 2037 table end, is labelled ZONE_UNSTABLE with the last table transition as its boundary
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/hazard/zone-unstable.ts:71:17
     return [];
   }
   const firstBeyond = firings.find(
-    (firing) => wallMillisFromFields(firing) >= boundary.lastTableTransition,
+    (firing) => wallMillisFromFields(firing) < boundary.lastTableTransition,
   );
   if (firstBeyond === undefined) {
killedBy: a DST footer governs firings past the last recorded transition (America/New_York) a 2039 window, beyond the 2037 table end, is labelled ZONE_UNSTABLE with the last table transition as its boundary
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hazard/zone-unstable.ts:73:7
   const firstBeyond = firings.find(
     (firing) => wallMillisFromFields(firing) >= boundary.lastTableTransition,
   );
-  if (firstBeyond === undefined) {
+  if (true) {
     return [];
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hazard/zone-unstable.ts:73:34
   const firstBeyond = firings.find(
     (firing) => wallMillisFromFields(firing) >= boundary.lastTableTransition,
   );
-  if (firstBeyond === undefined) {
-    return [];
-  }
+  if (firstBeyond === undefined) {}
   return [
     makeHazard({
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: Cannot read properties of undefined (reading 'year')

[Survived] ArrayDeclaration
src/hazard/zone-unstable.ts:83:17
       dialect,
       zone,
       intendedLocal: firstBeyond,
-      instants: [],
+      instants: ["Stryker was here"],
       causingTransition: null,
       idempotent,
