[Killed] BlockStatement
src/tz/civil-date.ts:17:51
 export const DAY_MILLIS = 86_400_000;
 
 /** Returns true when the year is a Gregorian leap year. */
-export function isLeapYear(year: number): boolean {
-  return year % 4 === 0 && (year % 100 !== 0 || year % 400 === 0);
-}
+export function isLeapYear(year: number): boolean {}
 
 /** Days in the given month (1 through 12) of the given year. */
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: day out of range: 29

[Killed] ArithmeticOperator
src/tz/civil-date.ts:18:10
 
 /** Returns true when the year is a Gregorian leap year. */
 export function isLeapYear(year: number): boolean {
-  return year % 4 === 0 && (year % 100 !== 0 || year % 400 === 0);
+  return year * 4 === 0 && (year % 100 !== 0 || year % 400 === 0);
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: day out of range: 29

[Killed] LogicalOperator
src/tz/civil-date.ts:18:29
 
 /** Returns true when the year is a Gregorian leap year. */
 export function isLeapYear(year: number): boolean {
-  return year % 4 === 0 && (year % 100 !== 0 || year % 400 === 0);
+  return year % 4 === 0 && (year % 100 !== 0 && year % 400 === 0);
 }
 
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: day out of range: 29

[Killed] BlockStatement
src/tz/civil-date.ts:22:66
 }
 
 /** Days in the given month (1 through 12) of the given year. */
-export function daysInMonth(year: number, month: number): number {
-  if (month === 2) {
-    return isLeapYear(year) ? 29 : 28;
-  }
-  return [31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month - 1] ?? 30;
-}
+export function daysInMonth(year: number, month: number): number {}
 
 /** Days since 1970-01-01 for a civil date; negative before 1970. */
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(9) ] to deeply equal []

[Killed] BlockStatement
src/tz/civil-date.ts:23:20
 
 /** Days in the given month (1 through 12) of the given year. */
 export function daysInMonth(year: number, month: number): number {
-  if (month === 2) {
-    return isLeapYear(year) ? 29 : 28;
-  }
+  if (month === 2) {}
   return [31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month - 1] ?? 30;
 }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: day out of range: 1

[Killed] ConditionalExpression
src/tz/civil-date.ts:23:7
 
 /** Days in the given month (1 through 12) of the given year. */
 export function daysInMonth(year: number, month: number): number {
-  if (month === 2) {
+  if (false) {
     return isLeapYear(year) ? 29 : 28;
   }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: day out of range: 1

[Killed] ArithmeticOperator
src/tz/civil-date.ts:26:58
   if (month === 2) {
     return isLeapYear(year) ? 29 : 28;
   }
-  return [31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month - 1] ?? 30;
+  return [31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month + 1] ?? 30;
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: day out of range: 31

[Killed] LogicalOperator
src/tz/civil-date.ts:26:10
   if (month === 2) {
     return isLeapYear(year) ? 29 : 28;
   }
-  return [31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month - 1] ?? 30;
+  return [31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month - 1] && 30;
 }
 
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: day out of range: 31

[Killed] BlockStatement
src/tz/civil-date.ts:30:81
 }
 
 /** Days since 1970-01-01 for a civil date; negative before 1970. */
-export function daysFromCivil(year: number, month: number, day: number): number {
-  const y = month <= 2 ? year - 1 : year;
-  const era = Math.floor(y / 400);
-  const yoe = y - era * 400;
-  const mp = (month + 9) % 12;
-  const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
-  const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
-  return era * 146097 + doe - 719468;
-}
+export function daysFromCivil(year: number, month: number, day: number): number {}
 
 /** Civil date for a count of days since 1970-01-01. */
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: no candidate instant and no covering gap for UTC; backend transitions inconsistent

[Killed] ConditionalExpression
src/tz/civil-date.ts:31:13
 
 /** Days since 1970-01-01 for a civil date; negative before 1970. */
 export function daysFromCivil(year: number, month: number, day: number): number {
-  const y = month <= 2 ? year - 1 : year;
+  const y = true ? year - 1 : year;
   const era = Math.floor(y / 400);
   const yoe = y - era * 400;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected { year: 2024, month: 3, day: 12, …(3) } to deeply equal { year: 2024, month: 3, day: 10, …(3) }

[Killed] EqualityOperator
src/tz/civil-date.ts:31:13
 
 /** Days since 1970-01-01 for a civil date; negative before 1970. */
 export function daysFromCivil(year: number, month: number, day: number): number {
-  const y = month <= 2 ? year - 1 : year;
+  const y = month < 2 ? year - 1 : year;
   const era = Math.floor(y / 400);
   const yoe = y - era * 400;
killedBy: civil date math matches Date.UTC across ordinary, leap, and century boundaries
statusReason: expected 99792000000 to be 68169600000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:32:26
 /** Days since 1970-01-01 for a civil date; negative before 1970. */
 export function daysFromCivil(year: number, month: number, day: number): number {
   const y = month <= 2 ? year - 1 : year;
-  const era = Math.floor(y / 400);
+  const era = Math.floor(y * 400);
   const yoe = y - era * 400;
   const mp = (month + 9) % 12;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:33:15
 export function daysFromCivil(year: number, month: number, day: number): number {
   const y = month <= 2 ? year - 1 : year;
   const era = Math.floor(y / 400);
-  const yoe = y - era * 400;
+  const yoe = y + era * 400;
   const mp = (month + 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:33:19
 export function daysFromCivil(year: number, month: number, day: number): number {
   const y = month <= 2 ? year - 1 : year;
   const era = Math.floor(y / 400);
-  const yoe = y - era * 400;
+  const yoe = y - era / 400;
   const mp = (month + 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:34:15
   const y = month <= 2 ? year - 1 : year;
   const era = Math.floor(y / 400);
   const yoe = y - era * 400;
-  const mp = (month + 9) % 12;
+  const mp = (month - 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
   const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected { year: 2024, month: 9, day: 10, …(3) } to deeply equal { year: 2024, month: 3, day: 10, …(3) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:34:14
   const y = month <= 2 ? year - 1 : year;
   const era = Math.floor(y / 400);
   const yoe = y - era * 400;
-  const mp = (month + 9) % 12;
+  const mp = (month + 9) * 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
   const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:35:26
   const era = Math.floor(y / 400);
   const yoe = y - era * 400;
   const mp = (month + 9) % 12;
-  const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
+  const doy = Math.floor((153 * mp + 2) * 5) + day - 1;
   const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
   return era * 146097 + doe - 719468;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:35:15
   const era = Math.floor(y / 400);
   const yoe = y - era * 400;
   const mp = (month + 9) % 12;
-  const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
+  const doy = Math.floor((153 * mp + 2) / 5) - day - 1;
   const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
   return era * 146097 + doe - 719468;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected { year: 2024, month: 4, day: 21, …(3) } to deeply equal { year: 2024, month: 3, day: 10, …(3) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:36:15
   const yoe = y - era * 400;
   const mp = (month + 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
-  const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
+  const doe = yoe * 365 + Math.floor(yoe / 4) + Math.floor(yoe / 100) + doy;
   return era * 146097 + doe - 719468;
 }
killedBy: Pacific/Kiritimati: the 1994 date-line move from UTC-10 to UTC+14 a single 24-hour forward transition on 1994-12-31 erases that calendar day
statusReason: expected 'unique' to be 'nonexistent' // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:36:15
   const yoe = y - era * 400;
   const mp = (month + 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
-  const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
+  const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) - doy;
   return era * 146097 + doe - 719468;
 }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected { year: 2024, month: 2, day: 17, …(3) } to deeply equal { year: 2024, month: 3, day: 10, …(3) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:37:10
   const mp = (month + 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
   const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
-  return era * 146097 + doe - 719468;
+  return era * 146097 + doe + 719468;
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:37:10
   const mp = (month + 9) % 12;
   const doy = Math.floor((153 * mp + 2) / 5) + day - 1;
   const doe = yoe * 365 + Math.floor(yoe / 4) - Math.floor(yoe / 100) + doy;
-  return era * 146097 + doe - 719468;
+  return era / 146097 + doe - 719468;
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tz/civil-date.ts:45:3
   year: number;
   month: number;
   day: number;
-} {
-  const z = days + 719468;
-  const era = Math.floor(z / 146097);
-  const doe = z - era * 146097;
-  const yoe = Math.floor(
-    (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
-  );
-  const y = yoe + era * 400;
-  const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
-  const mp = Math.floor((5 * doy + 2) / 153);
-  const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
-  const month = mp < 10 ? mp + 3 : mp - 9;
-  return { year: month <= 2 ? y + 1 : y, month, day };
-}
+} {}
 
 /** Day of week for a day count since 1970-01-01; 0 is Sunday. */
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'year')

[Killed] ArithmeticOperator
src/tz/civil-date.ts:46:13
   month: number;
   day: number;
 } {
-  const z = days + 719468;
+  const z = days - 719468;
   const era = Math.floor(z / 146097);
   const doe = z - era * 146097;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/civil-date.ts:47:26
   day: number;
 } {
   const z = days + 719468;
-  const era = Math.floor(z / 146097);
+  const era = Math.floor(z * 146097);
   const doe = z - era * 146097;
   const yoe = Math.floor(
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/civil-date.ts:48:19
 } {
   const z = days + 719468;
   const era = Math.floor(z / 146097);
-  const doe = z - era * 146097;
+  const doe = z - era / 146097;
   const yoe = Math.floor(
     (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected 583391.999972621 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:48:15
 } {
   const z = days + 719468;
   const era = Math.floor(z / 146097);
-  const doe = z - era * 146097;
+  const doe = z + era * 146097;
   const yoe = Math.floor(
     (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/civil-date.ts:50:23
   const era = Math.floor(z / 146097);
   const doe = z - era * 146097;
   const yoe = Math.floor(
-    (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
+    (doe - Math.floor(doe * 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
   );
   const y = yoe + era * 400;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/civil-date.ts:50:48
   const era = Math.floor(z / 146097);
   const doe = z - era * 146097;
   const yoe = Math.floor(
-    (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
+    (doe - Math.floor(doe / 1460) + Math.floor(doe * 36524) - Math.floor(doe / 146096)) / 365,
   );
   const y = yoe + era * 400;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/civil-date.ts:52:19
   const yoe = Math.floor(
     (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
   );
-  const y = yoe + era * 400;
+  const y = yoe + era / 400;
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -585384.35 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:52:13
   const yoe = Math.floor(
     (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
   );
-  const y = yoe + era * 400;
+  const y = yoe - era * 400;
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -1169776 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:53:22
     (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
   );
   const y = yoe + era * 400;
-  const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
+  const doy = doe - (365 * yoe - Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -818 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:53:45
     (doe - Math.floor(doe / 1460) + Math.floor(doe / 36524) - Math.floor(doe / 146096)) / 365,
   );
   const y = yoe + era * 400;
-  const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
+  const doy = doe - (365 * yoe + Math.floor(yoe * 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -1276 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:54:25
   );
   const y = yoe + era * 400;
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
-  const mp = Math.floor((5 * doy + 2) / 153);
+  const mp = Math.floor((5 * doy + 2) * 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
   const month = mp < 10 ? mp + 3 : mp - 9;
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -876405 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:54:26
   );
   const y = yoe + era * 400;
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
-  const mp = Math.floor((5 * doy + 2) / 153);
+  const mp = Math.floor((5 / doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
   const month = mp < 10 ? mp + 3 : mp - 9;
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected NaN to be 59 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:55:15
   const y = yoe + era * 400;
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
-  const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
+  const day = doy + Math.floor((153 * mp + 2) / 5) + 1;
   const month = mp < 10 ? mp + 3 : mp - 9;
   return { year: month <= 2 ? y + 1 : y, month, day };
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -938 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:55:33
   const y = yoe + era * 400;
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
-  const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
+  const day = doy - Math.floor((153 * mp - 2) / 5) + 1;
   const month = mp < 10 ? mp + 3 : mp - 9;
   return { year: month <= 2 ? y + 1 : y, month, day };
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -999 to be -1000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:56:36
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
-  const month = mp < 10 ? mp + 3 : mp - 9;
+  const month = mp < 10 ? mp + 3 : mp + 9;
   return { year: month <= 2 ? y + 1 : y, month, day };
 }
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -184 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:56:27
   const doy = doe - (365 * yoe + Math.floor(yoe / 4) - Math.floor(yoe / 100));
   const mp = Math.floor((5 * doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
-  const month = mp < 10 ? mp + 3 : mp - 9;
+  const month = mp < 10 ? mp - 3 : mp - 9;
   return { year: month <= 2 ? y + 1 : y, month, day };
 }
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -817 to be -1000 // Object.is equality

[Killed] ConditionalExpression
src/tz/civil-date.ts:57:18
   const mp = Math.floor((5 * doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
   const month = mp < 10 ? mp + 3 : mp - 9;
-  return { year: month <= 2 ? y + 1 : y, month, day };
+  return { year: false ? y + 1 : y, month, day };
 }
 
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -365 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:57:31
   const mp = Math.floor((5 * doy + 2) / 153);
   const day = doy - Math.floor((153 * mp + 2) / 5) + 1;
   const month = mp < 10 ? mp + 3 : mp - 9;
-  return { year: month <= 2 ? y + 1 : y, month, day };
+  return { year: month <= 2 ? y - 1 : y, month, day };
 }
 
killedBy: civil date math day counts round-trip through civil dates
statusReason: expected -731 to be +0 // Object.is equality

[Killed] BlockStatement
src/tz/civil-date.ts:61:55
 }
 
 /** Day of week for a day count since 1970-01-01; 0 is Sunday. */
-export function weekdayFromDays(days: number): number {
-  const wd = (days + 4) % 7;
-  return wd < 0 ? wd + 7 : wd;
-}
+export function weekdayFromDays(days: number): number {}
 
 /**
killedBy: civil date math weekday matches the known epoch anchor and a known Sunday
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:62:15
 
 /** Day of week for a day count since 1970-01-01; 0 is Sunday. */
 export function weekdayFromDays(days: number): number {
-  const wd = (days + 4) % 7;
+  const wd = (days - 4) % 7;
   return wd < 0 ? wd + 7 : wd;
 }
killedBy: civil date math weekday matches the known epoch anchor and a known Sunday
statusReason: expected 3 to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/tz/civil-date.ts:62:14
 
 /** Day of week for a day count since 1970-01-01; 0 is Sunday. */
 export function weekdayFromDays(days: number): number {
-  const wd = (days + 4) % 7;
+  const wd = (days + 4) * 7;
   return wd < 0 ? wd + 7 : wd;
 }
killedBy: civil date math weekday matches the known epoch anchor and a known Sunday
statusReason: expected 28 to be 4 // Object.is equality

[Killed] EqualityOperator
src/tz/civil-date.ts:63:10
 /** Day of week for a day count since 1970-01-01; 0 is Sunday. */
 export function weekdayFromDays(days: number): number {
   const wd = (days + 4) % 7;
-  return wd < 0 ? wd + 7 : wd;
+  return wd >= 0 ? wd + 7 : wd;
 }
 
killedBy: civil date math weekday matches the known epoch anchor and a known Sunday
statusReason: expected 11 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/tz/civil-date.ts:63:10
 /** Day of week for a day count since 1970-01-01; 0 is Sunday. */
 export function weekdayFromDays(days: number): number {
   const wd = (days + 4) % 7;
-  return wd < 0 ? wd + 7 : wd;
+  return true ? wd + 7 : wd;
 }
 
killedBy: civil date math weekday matches the known epoch anchor and a known Sunday
statusReason: expected 11 to be 4 // Object.is equality

[Killed] BlockStatement
src/tz/civil-date.ts:70:71
  * Encodes local wall-clock fields as wall milliseconds: the value a
  * UTC clock would read at the same year, month, day, and time.
  */
-export function wallMillisFromFields(fields: LocalWallFields): number {
-  const days = daysFromCivil(fields.year, fields.month, fields.day);
-  return (
-    days * DAY_MILLIS +
-    fields.hour * 3_600_000 +
-    fields.minute * 60_000 +
-    (fields.second ?? 0) * 1000 +
-    (fields.millisecond ?? 0)
-  );
-}
+export function wallMillisFromFields(fields: LocalWallFields): number {}
 
 /** Decodes wall milliseconds back into local wall-clock fields. */
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: NaN, month: NaN, …(5) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:73:5
 export function wallMillisFromFields(fields: LocalWallFields): number {
   const days = daysFromCivil(fields.year, fields.month, fields.day);
   return (
-    days * DAY_MILLIS +
-    fields.hour * 3_600_000 +
-    fields.minute * 60_000 +
-    (fields.second ?? 0) * 1000 +
+    days * DAY_MILLIS + fields.hour * 3_600_000 + fields.minute * 60_000 - (fields.second ?? 0) * 1000 +
     (fields.millisecond ?? 0)
   );
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:73:5
 export function wallMillisFromFields(fields: LocalWallFields): number {
   const days = daysFromCivil(fields.year, fields.month, fields.day);
   return (
-    days * DAY_MILLIS +
-    fields.hour * 3_600_000 +
-    fields.minute * 60_000 +
+    days * DAY_MILLIS + fields.hour * 3_600_000 - fields.minute * 60_000 +
     (fields.second ?? 0) * 1000 +
     (fields.millisecond ?? 0)
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:74:5
   const days = daysFromCivil(fields.year, fields.month, fields.day);
   return (
     days * DAY_MILLIS +
-    fields.hour * 3_600_000 +
+    fields.hour / 3_600_000 +
     fields.minute * 60_000 +
     (fields.second ?? 0) * 1000 +
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/civil-date.ts:75:5
   return (
     days * DAY_MILLIS +
     fields.hour * 3_600_000 +
-    fields.minute * 60_000 +
+    fields.minute / 60_000 +
     (fields.second ?? 0) * 1000 +
     (fields.millisecond ?? 0)
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] LogicalOperator
src/tz/civil-date.ts:76:6
     days * DAY_MILLIS +
     fields.hour * 3_600_000 +
     fields.minute * 60_000 +
-    (fields.second ?? 0) * 1000 +
+    (fields.second && 0) * 1000 +
     (fields.millisecond ?? 0)
   );
killedBy: resolveWallClock input handling an ordinary local time resolves to a unique instant with its offset
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/civil-date.ts:76:5
     days * DAY_MILLIS +
     fields.hour * 3_600_000 +
     fields.minute * 60_000 +
-    (fields.second ?? 0) * 1000 +
+    (fields.second ?? 0) / 1000 +
     (fields.millisecond ?? 0)
   );
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] LogicalOperator
src/tz/civil-date.ts:77:6
     fields.hour * 3_600_000 +
     fields.minute * 60_000 +
     (fields.second ?? 0) * 1000 +
-    (fields.millisecond ?? 0)
+    (fields.millisecond && 0)
   );
 }
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] BlockStatement
src/tz/civil-date.ts:82:85
 }
 
 /** Decodes wall milliseconds back into local wall-clock fields. */
-export function fieldsFromWallMillis(wallMillis: number): Required<LocalWallFields> {
-  const days = Math.floor(wallMillis / DAY_MILLIS);
-  let rest = wallMillis - days * DAY_MILLIS;
-  const { year, month, day } = civilFromDays(days);
-  const hour = Math.floor(rest / 3_600_000);
-  rest -= hour * 3_600_000;
-  const minute = Math.floor(rest / 60_000);
-  rest -= minute * 60_000;
-  const second = Math.floor(rest / 1000);
-  return { year, month, day, hour, minute, second, millisecond: rest - second * 1000 };
-}
+export function fieldsFromWallMillis(wallMillis: number): Required<LocalWallFields> {}
 
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected undefined to deeply equal { year: 2024, month: 11, day: 3, …(4) }
