[Killed] ArithmeticOperator
src/tz/civil-date.ts:83:27
 
 /** Decodes wall milliseconds back into local wall-clock fields. */
 export function fieldsFromWallMillis(wallMillis: number): Required<LocalWallFields> {
-  const days = Math.floor(wallMillis / DAY_MILLIS);
+  const days = Math.floor(wallMillis * DAY_MILLIS);
   let rest = wallMillis - days * DAY_MILLIS;
   const { year, month, day } = civilFromDays(days);
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 409381768220294000, …(6) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:84:14
 /** Decodes wall milliseconds back into local wall-clock fields. */
 export function fieldsFromWallMillis(wallMillis: number): Required<LocalWallFields> {
   const days = Math.floor(wallMillis / DAY_MILLIS);
-  let rest = wallMillis - days * DAY_MILLIS;
+  let rest = wallMillis + days * DAY_MILLIS;
   const { year, month, day } = civilFromDays(days);
   const hour = Math.floor(rest / 3_600_000);
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:84:27
 /** Decodes wall milliseconds back into local wall-clock fields. */
 export function fieldsFromWallMillis(wallMillis: number): Required<LocalWallFields> {
   const days = Math.floor(wallMillis / DAY_MILLIS);
-  let rest = wallMillis - days * DAY_MILLIS;
+  let rest = wallMillis - days / DAY_MILLIS;
   const { year, month, day } = civilFromDays(days);
   const hour = Math.floor(rest / 3_600_000);
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:86:27
   const days = Math.floor(wallMillis / DAY_MILLIS);
   let rest = wallMillis - days * DAY_MILLIS;
   const { year, month, day } = civilFromDays(days);
-  const hour = Math.floor(rest / 3_600_000);
+  const hour = Math.floor(rest * 3_600_000);
   rest -= hour * 3_600_000;
   const minute = Math.floor(rest / 60_000);
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:87:11
   let rest = wallMillis - days * DAY_MILLIS;
   const { year, month, day } = civilFromDays(days);
   const hour = Math.floor(rest / 3_600_000);
-  rest -= hour * 3_600_000;
+  rest -= hour / 3_600_000;
   const minute = Math.floor(rest / 60_000);
   rest -= minute * 60_000;
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] AssignmentOperator
src/tz/civil-date.ts:87:3
   let rest = wallMillis - days * DAY_MILLIS;
   const { year, month, day } = civilFromDays(days);
   const hour = Math.floor(rest / 3_600_000);
-  rest -= hour * 3_600_000;
+  rest += hour * 3_600_000;
   const minute = Math.floor(rest / 60_000);
   rest -= minute * 60_000;
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:88:29
   const { year, month, day } = civilFromDays(days);
   const hour = Math.floor(rest / 3_600_000);
   rest -= hour * 3_600_000;
-  const minute = Math.floor(rest / 60_000);
+  const minute = Math.floor(rest * 60_000);
   rest -= minute * 60_000;
   const second = Math.floor(rest / 1000);
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] AssignmentOperator
src/tz/civil-date.ts:89:3
   const hour = Math.floor(rest / 3_600_000);
   rest -= hour * 3_600_000;
   const minute = Math.floor(rest / 60_000);
-  rest -= minute * 60_000;
+  rest += minute * 60_000;
   const second = Math.floor(rest / 1000);
   return { year, month, day, hour, minute, second, millisecond: rest - second * 1000 };
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:89:11
   const hour = Math.floor(rest / 3_600_000);
   rest -= hour * 3_600_000;
   const minute = Math.floor(rest / 60_000);
-  rest -= minute * 60_000;
+  rest -= minute / 60_000;
   const second = Math.floor(rest / 1000);
   return { year, month, day, hour, minute, second, millisecond: rest - second * 1000 };
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:90:29
   rest -= hour * 3_600_000;
   const minute = Math.floor(rest / 60_000);
   rest -= minute * 60_000;
-  const second = Math.floor(rest / 1000);
+  const second = Math.floor(rest * 1000);
   return { year, month, day, hour, minute, second, millisecond: rest - second * 1000 };
 }
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:91:65
   const minute = Math.floor(rest / 60_000);
   rest -= minute * 60_000;
   const second = Math.floor(rest / 1000);
-  return { year, month, day, hour, minute, second, millisecond: rest - second * 1000 };
+  return { year, month, day, hour, minute, second, millisecond: rest + second * 1000 };
 }
 
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }

[Killed] ArithmeticOperator
src/tz/civil-date.ts:91:72
   const minute = Math.floor(rest / 60_000);
   rest -= minute * 60_000;
   const second = Math.floor(rest / 1000);
-  return { year, month, day, hour, minute, second, millisecond: rest - second * 1000 };
+  return { year, month, day, hour, minute, second, millisecond: rest - second / 1000 };
 }
 
killedBy: civil date math wall fields round-trip through wall milliseconds
statusReason: expected { year: 2024, month: 11, day: 3, …(4) } to deeply equal { year: 2024, month: 11, day: 3, …(4) }
