[Survived] BlockStatement
src/tz/cross-check.ts:59:38
   disagreements: CrossCheckDisagreement[];
 }
 
-function iso(millis: number): string {
-  return new Date(millis).toISOString();
-}
+function iso(millis: number): string {}
 
 /** Cross-checks a single zone over [startUtcMillis, endUtcMillis). */

[Killed] BlockStatement
src/tz/cross-check.ts:76:26
   const disagreements: CrossCheckDisagreement[] = [];
 
   const byInstantB = new Map<number, ZoneTransition>();
-  for (const b of listB) {
-    byInstantB.set(b.instant, b);
-  }
+  for (const b of listB) {}
 
   for (const b of listB) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(567) ] to deeply equal []

[Survived] BlockStatement
src/tz/cross-check.ts:80:26
     byInstantB.set(b.instant, b);
   }
 
-  for (const b of listB) {
-    const beforeA = backendA.offsetAt(b.instant - 1000, zone).offsetSeconds;
-    const afterA = backendA.offsetAt(b.instant, zone).offsetSeconds;
-    if (beforeA !== b.offsetBeforeSeconds) {
-      disagreements.push({
-        zone,
-        instant: b.instant,
-        detail:
-          `at ${iso(b.instant)}: offset before transition differs, ` +
-          `A=${beforeA}s B=${b.offsetBeforeSeconds}s`,
-      });
-    }
-    if (afterA !== b.offsetAfterSeconds) {
-      disagreements.push({
-        zone,
-        instant: b.instant,
-        detail:
-          `at ${iso(b.instant)}: offset after transition differs, ` +
-          `A=${afterA}s B=${b.offsetAfterSeconds}s`,
-      });
-    }
-  }
+  for (const b of listB) {}
 
   for (const a of listA) {

[Killed] ArithmeticOperator
src/tz/cross-check.ts:81:39
   }
 
   for (const b of listB) {
-    const beforeA = backendA.offsetAt(b.instant - 1000, zone).offsetSeconds;
+    const beforeA = backendA.offsetAt(b.instant + 1000, zone).offsetSeconds;
     const afterA = backendA.offsetAt(b.instant, zone).offsetSeconds;
     if (beforeA !== b.offsetBeforeSeconds) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Killed] EqualityOperator
src/tz/cross-check.ts:83:9
   for (const b of listB) {
     const beforeA = backendA.offsetAt(b.instant - 1000, zone).offsetSeconds;
     const afterA = backendA.offsetAt(b.instant, zone).offsetSeconds;
-    if (beforeA !== b.offsetBeforeSeconds) {
+    if (beforeA === b.offsetBeforeSeconds) {
       disagreements.push({
         zone,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/cross-check.ts:83:9
   for (const b of listB) {
     const beforeA = backendA.offsetAt(b.instant - 1000, zone).offsetSeconds;
     const afterA = backendA.offsetAt(b.instant, zone).offsetSeconds;
-    if (beforeA !== b.offsetBeforeSeconds) {
+    if (true) {
       disagreements.push({
         zone,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/cross-check.ts:92:9
           `A=${beforeA}s B=${b.offsetBeforeSeconds}s`,
       });
     }
-    if (afterA !== b.offsetAfterSeconds) {
+    if (true) {
       disagreements.push({
         zone,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Killed] EqualityOperator
src/tz/cross-check.ts:92:9
           `A=${beforeA}s B=${b.offsetBeforeSeconds}s`,
       });
     }
-    if (afterA !== b.offsetAfterSeconds) {
+    if (afterA === b.offsetAfterSeconds) {
       disagreements.push({
         zone,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[NoCoverage] StringLiteral
src/tz/cross-check.ts:98:11
         instant: b.instant,
         detail:
           `at ${iso(b.instant)}: offset after transition differs, ` +
-          `A=${afterA}s B=${b.offsetAfterSeconds}s`,
+          ``,
       });
     }

[Killed] BlockStatement
src/tz/cross-check.ts:103:26
     }
   }
 
-  for (const a of listA) {
-    const match = byInstantB.get(a.instant);
-    if (match === undefined) {
-      disagreements.push({
-        zone,
-        instant: a.instant,
-        detail: `backend A finds a transition at ${iso(a.instant)} that backend B does not have`,
-      });
-    } else if (
-      match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
-      match.offsetAfterSeconds !== a.offsetAfterSeconds
-    ) {
-      disagreements.push({
-        zone,
-        instant: a.instant,
-        detail:
-          `at ${iso(a.instant)}: offsets differ, ` +
-          `A=${a.offsetBeforeSeconds}s/${a.offsetAfterSeconds}s ` +
-          `B=${match.offsetBeforeSeconds}s/${match.offsetAfterSeconds}s`,
-      });
-    }
-  }
+  for (const a of listA) {}
 
   return {
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/tz/cross-check.ts:105:30
 
   for (const a of listA) {
     const match = byInstantB.get(a.instant);
-    if (match === undefined) {
-      disagreements.push({
-        zone,
-        instant: a.instant,
-        detail: `backend A finds a transition at ${iso(a.instant)} that backend B does not have`,
-      });
-    } else if (
+    if (match === undefined) {} else if (
       match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
       match.offsetAfterSeconds !== a.offsetAfterSeconds
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tz/cross-check.ts:105:9
 
   for (const a of listA) {
     const match = byInstantB.get(a.instant);
-    if (match === undefined) {
+    if (true) {
       disagreements.push({
         zone,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(567) ] to deeply equal []

[Killed] EqualityOperator
src/tz/cross-check.ts:112:7
         detail: `backend A finds a transition at ${iso(a.instant)} that backend B does not have`,
       });
     } else if (
-      match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
+      match.offsetBeforeSeconds === a.offsetBeforeSeconds ||
       match.offsetAfterSeconds !== a.offsetAfterSeconds
     ) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(567) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/cross-check.ts:112:7
         detail: `backend A finds a transition at ${iso(a.instant)} that backend B does not have`,
       });
     } else if (
-      match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
-      match.offsetAfterSeconds !== a.offsetAfterSeconds
+      true
     ) {
       disagreements.push({
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(567) ] to deeply equal []

[Killed] EqualityOperator
src/tz/cross-check.ts:113:7
       });
     } else if (
       match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
-      match.offsetAfterSeconds !== a.offsetAfterSeconds
+      match.offsetAfterSeconds === a.offsetAfterSeconds
     ) {
       disagreements.push({
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(567) ] to deeply equal []

[Survived] ConditionalExpression
src/tz/cross-check.ts:113:7
       });
     } else if (
       match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
-      match.offsetAfterSeconds !== a.offsetAfterSeconds
+      false
     ) {
       disagreements.push({

[NoCoverage] BlockStatement
src/tz/cross-check.ts:114:7
     } else if (
       match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
       match.offsetAfterSeconds !== a.offsetAfterSeconds
-    ) {
-      disagreements.push({
-        zone,
-        instant: a.instant,
-        detail:
-          `at ${iso(a.instant)}: offsets differ, ` +
-          `A=${a.offsetBeforeSeconds}s/${a.offsetAfterSeconds}s ` +
-          `B=${match.offsetBeforeSeconds}s/${match.offsetAfterSeconds}s`,
-      });
-    }
+    ) {}
   }
 

[NoCoverage] ObjectLiteral
src/tz/cross-check.ts:115:26
       match.offsetBeforeSeconds !== a.offsetBeforeSeconds ||
       match.offsetAfterSeconds !== a.offsetAfterSeconds
     ) {
-      disagreements.push({
-        zone,
-        instant: a.instant,
-        detail:
-          `at ${iso(a.instant)}: offsets differ, ` +
-          `A=${a.offsetBeforeSeconds}s/${a.offsetAfterSeconds}s ` +
-          `B=${match.offsetBeforeSeconds}s/${match.offsetAfterSeconds}s`,
-      });
+      disagreements.push({});
     }
   }

[NoCoverage] StringLiteral
src/tz/cross-check.ts:120:11
         instant: a.instant,
         detail:
           `at ${iso(a.instant)}: offsets differ, ` +
-          `A=${a.offsetBeforeSeconds}s/${a.offsetAfterSeconds}s ` +
+          `` +
           `B=${match.offsetBeforeSeconds}s/${match.offsetAfterSeconds}s`,
       });

[Killed] BlockStatement
src/tz/cross-check.ts:152:77
 }
 
 /** Runs the cross-check over every requested zone. */
-export function runCrossCheck(options: CrossCheckOptions): CrossCheckReport {
-  const zoneResults: ZoneCheckResult[] = [];
-  const disagreements: CrossCheckDisagreement[] = [];
-  let transitionsCompared = 0;
-  for (const zone of options.zones) {
-    const result = crossCheckZone(
-      options.backendA,
-      options.backendB,
-      zone,
-      options.startUtcMillis,
-      options.endUtcMillis,
-    );
-    zoneResults.push(result);
-    disagreements.push(...result.disagreements);
-    transitionsCompared += result.transitionsCompared;
-    options.onZone?.(result);
-  }
-  return {
-    zoneResults,
-    zonesChecked: zoneResults.length,
-    transitionsCompared,
-    disagreements,
-  };
-}
+export function runCrossCheck(options: CrossCheckOptions): CrossCheckReport {}
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'disagreements')

[Killed] BlockStatement
src/tz/cross-check.ts:156:37
   const zoneResults: ZoneCheckResult[] = [];
   const disagreements: CrossCheckDisagreement[] = [];
   let transitionsCompared = 0;
-  for (const zone of options.zones) {
-    const result = crossCheckZone(
-      options.backendA,
-      options.backendB,
-      zone,
-      options.startUtcMillis,
-      options.endUtcMillis,
-    );
-    zoneResults.push(result);
-    disagreements.push(...result.disagreements);
-    transitionsCompared += result.transitionsCompared;
-    options.onZone?.(result);
-  }
+  for (const zone of options.zones) {}
   return {
     zoneResults,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected +0 to be 8 // Object.is equality

[Killed] AssignmentOperator
src/tz/cross-check.ts:166:5
     );
     zoneResults.push(result);
     disagreements.push(...result.disagreements);
-    transitionsCompared += result.transitionsCompared;
+    transitionsCompared -= result.transitionsCompared;
     options.onZone?.(result);
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected -569 to be greater than 200

[Killed] OptionalChaining
src/tz/cross-check.ts:167:5
     zoneResults.push(result);
     disagreements.push(...result.disagreements);
     transitionsCompared += result.transitionsCompared;
-    options.onZone?.(result);
+    options.onZone(result);
   }
   return {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: options.onZone is not a function

[Killed] ObjectLiteral
src/tz/cross-check.ts:169:10
     transitionsCompared += result.transitionsCompared;
     options.onZone?.(result);
   }
-  return {
-    zoneResults,
-    zonesChecked: zoneResults.length,
-    transitionsCompared,
-    disagreements,
-  };
+  return {};
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected undefined to deeply equal []
