[Timeout] ArithmeticOperator
src/tz/intl-backend.ts:18:22
 
 import type { OffsetInfo, TzBackend, ZoneTransition } from './types';
 
-const PROBE_MILLIS = 7 * 86_400_000;
+const PROBE_MILLIS = 7 / 86_400_000;
 const SECOND_MILLIS = 1000;
 

[Killed] BlockStatement
src/tz/intl-backend.ts:25:73
 
 const formatterCache = new Map<string, Intl.DateTimeFormat>();
 
-function formatter(zone: string, style: NameStyle): Intl.DateTimeFormat {
-  const key = `${zone} ${style}`;
-  let cached = formatterCache.get(key);
-  if (cached === undefined) {
-    cached = new Intl.DateTimeFormat('en-US', {
-      timeZone: zone,
-      timeZoneName: style,
-      hour: 'numeric',
-    });
-    formatterCache.set(key, cached);
-  }
-  return cached;
-}
+function formatter(zone: string, style: NameStyle): Intl.DateTimeFormat {}
 
 function zoneNamePart(zone: string, style: NameStyle, millis: number): string {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'formatToParts')

[Killed] ConditionalExpression
src/tz/intl-backend.ts:28:7
 function formatter(zone: string, style: NameStyle): Intl.DateTimeFormat {
   const key = `${zone} ${style}`;
   let cached = formatterCache.get(key);
-  if (cached === undefined) {
+  if (false) {
     cached = new Intl.DateTimeFormat('en-US', {
       timeZone: zone,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'formatToParts')

[Killed] BlockStatement
src/tz/intl-backend.ts:28:29
 function formatter(zone: string, style: NameStyle): Intl.DateTimeFormat {
   const key = `${zone} ${style}`;
   let cached = formatterCache.get(key);
-  if (cached === undefined) {
-    cached = new Intl.DateTimeFormat('en-US', {
-      timeZone: zone,
-      timeZoneName: style,
-      hour: 'numeric',
-    });
-    formatterCache.set(key, cached);
-  }
+  if (cached === undefined) {}
   return cached;
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'formatToParts')

[Killed] BlockStatement
src/tz/intl-backend.ts:39:79
   return cached;
 }
 
-function zoneNamePart(zone: string, style: NameStyle, millis: number): string {
-  const parts = formatter(zone, style).formatToParts(new Date(millis));
-  const part = parts.find((p) => p.type === 'timeZoneName');
-  if (part === undefined) {
-    throw new Error(`Intl returned no timeZoneName part for ${zone}`);
-  }
-  return part.value;
-}
+function zoneNamePart(zone: string, style: NameStyle, millis: number): string {}
 
 const LONG_OFFSET = /^GMT(?:([+-])(\d{1,2}):(\d{2})(?::(\d{2}))?)?$/;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/tz/intl-backend.ts:41:34
 
 function zoneNamePart(zone: string, style: NameStyle, millis: number): string {
   const parts = formatter(zone, style).formatToParts(new Date(millis));
-  const part = parts.find((p) => p.type === 'timeZoneName');
+  const part = parts.find((p) => false);
   if (part === undefined) {
     throw new Error(`Intl returned no timeZoneName part for ${zone}`);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Intl returned no timeZoneName part for America/New_York

[Killed] ConditionalExpression
src/tz/intl-backend.ts:41:34
 
 function zoneNamePart(zone: string, style: NameStyle, millis: number): string {
   const parts = formatter(zone, style).formatToParts(new Date(millis));
-  const part = parts.find((p) => p.type === 'timeZoneName');
+  const part = parts.find((p) => true);
   if (part === undefined) {
     throw new Error(`Intl returned no timeZoneName part for ${zone}`);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: unparseable longOffset value: 6

[Killed] EqualityOperator
src/tz/intl-backend.ts:42:7
 function zoneNamePart(zone: string, style: NameStyle, millis: number): string {
   const parts = formatter(zone, style).formatToParts(new Date(millis));
   const part = parts.find((p) => p.type === 'timeZoneName');
-  if (part === undefined) {
+  if (part !== undefined) {
     throw new Error(`Intl returned no timeZoneName part for ${zone}`);
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Intl returned no timeZoneName part for America/New_York

[Killed] ConditionalExpression
src/tz/intl-backend.ts:42:7
 function zoneNamePart(zone: string, style: NameStyle, millis: number): string {
   const parts = formatter(zone, style).formatToParts(new Date(millis));
   const part = parts.find((p) => p.type === 'timeZoneName');
-  if (part === undefined) {
+  if (true) {
     throw new Error(`Intl returned no timeZoneName part for ${zone}`);
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Intl returned no timeZoneName part for America/New_York

[Killed] Regex
src/tz/intl-backend.ts:48:21
   return part.value;
 }
 
-const LONG_OFFSET = /^GMT(?:([+-])(\d{1,2}):(\d{2})(?::(\d{2}))?)?$/;
+const LONG_OFFSET = /^GMT(?:([+-])(\D{1,2}):(\d{2})(?::(\d{2}))?)?$/;
 
 function parseLongOffsetSeconds(text: string): number {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: unparseable longOffset value: GMT-05:00

[Killed] Regex
src/tz/intl-backend.ts:48:21
   return part.value;
 }
 
-const LONG_OFFSET = /^GMT(?:([+-])(\d{1,2}):(\d{2})(?::(\d{2}))?)?$/;
+const LONG_OFFSET = /^GMT(?:([^+-])(\d{1,2}):(\d{2})(?::(\d{2}))?)?$/;
 
 function parseLongOffsetSeconds(text: string): number {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: unparseable longOffset value: GMT-05:00

[Killed] BlockStatement
src/tz/intl-backend.ts:50:55
 
 const LONG_OFFSET = /^GMT(?:([+-])(\d{1,2}):(\d{2})(?::(\d{2}))?)?$/;
 
-function parseLongOffsetSeconds(text: string): number {
-  const normalized = text.replace('−', '-');
-  const match = LONG_OFFSET.exec(normalized);
-  if (match === null) {
-    throw new Error(`unparseable longOffset value: ${text}`);
-  }
-  if (match[1] === undefined) {
-    return 0;
-  }
-  const magnitude =
-    Number(match[2]) * 3600 + Number(match[3]) * 60 + Number(match[4] ?? 0);
-  return match[1] === '-' ? -magnitude : magnitude;
-}
+function parseLongOffsetSeconds(text: string): number {}
 
 function offsetSecondsAt(millis: number, zone: string): number {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(1138) ] to deeply equal []

[Killed] EqualityOperator
src/tz/intl-backend.ts:53:7
 function parseLongOffsetSeconds(text: string): number {
   const normalized = text.replace('−', '-');
   const match = LONG_OFFSET.exec(normalized);
-  if (match === null) {
+  if (match !== null) {
     throw new Error(`unparseable longOffset value: ${text}`);
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: unparseable longOffset value: GMT-05:00

[Killed] ConditionalExpression
src/tz/intl-backend.ts:53:7
 function parseLongOffsetSeconds(text: string): number {
   const normalized = text.replace('−', '-');
   const match = LONG_OFFSET.exec(normalized);
-  if (match === null) {
+  if (true) {
     throw new Error(`unparseable longOffset value: ${text}`);
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: unparseable longOffset value: GMT-05:00

[NoCoverage] StringLiteral
src/tz/intl-backend.ts:54:21
   const normalized = text.replace('−', '-');
   const match = LONG_OFFSET.exec(normalized);
   if (match === null) {
-    throw new Error(`unparseable longOffset value: ${text}`);
+    throw new Error(``);
   }
   if (match[1] === undefined) {

[Killed] ConditionalExpression
src/tz/intl-backend.ts:56:7
   if (match === null) {
     throw new Error(`unparseable longOffset value: ${text}`);
   }
-  if (match[1] === undefined) {
+  if (true) {
     return 0;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(931) ] to deeply equal []

[Timeout] EqualityOperator
src/tz/intl-backend.ts:56:7
   if (match === null) {
     throw new Error(`unparseable longOffset value: ${text}`);
   }
-  if (match[1] === undefined) {
+  if (match[1] !== undefined) {
     return 0;
   }

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:60:5
     return 0;
   }
   const magnitude =
-    Number(match[2]) * 3600 + Number(match[3]) * 60 + Number(match[4] ?? 0);
+    Number(match[2]) / 3600 + Number(match[3]) * 60 + Number(match[4] ?? 0);
   return match[1] === '-' ? -magnitude : magnitude;
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(1498) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:60:31
     return 0;
   }
   const magnitude =
-    Number(match[2]) * 3600 + Number(match[3]) * 60 + Number(match[4] ?? 0);
+    Number(match[2]) * 3600 + Number(match[3]) / 60 + Number(match[4] ?? 0);
   return match[1] === '-' ? -magnitude : magnitude;
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ Array(445) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/intl-backend.ts:61:10
   }
   const magnitude =
     Number(match[2]) * 3600 + Number(match[3]) * 60 + Number(match[4] ?? 0);
-  return match[1] === '-' ? -magnitude : magnitude;
+  return false ? -magnitude : magnitude;
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(464) ] to deeply equal []

[Killed] EqualityOperator
src/tz/intl-backend.ts:61:10
   }
   const magnitude =
     Number(match[2]) * 3600 + Number(match[3]) * 60 + Number(match[4] ?? 0);
-  return match[1] === '-' ? -magnitude : magnitude;
+  return match[1] !== '-' ? -magnitude : magnitude;
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(1498) ] to deeply equal []

[Killed] BlockStatement
src/tz/intl-backend.ts:64:64
   return match[1] === '-' ? -magnitude : magnitude;
 }
 
-function offsetSecondsAt(millis: number, zone: string): number {
-  return parseLongOffsetSeconds(zoneNamePart(zone, 'longOffset', millis));
-}
+function offsetSecondsAt(millis: number, zone: string): number {}
 
 /**
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(1138) ] to deeply equal []

[Survived] BlockStatement
src/tz/intl-backend.ts:76:57
  * "Irish Standard Time"). Nothing in this codebase consumes isDst
  * for offset math or season logic; the flag is reported data only.
  */
-function isDstAt(millis: number, zone: string): boolean {
-  return /Daylight|Summer/.test(zoneNamePart(zone, 'long', millis));
-}
+function isDstAt(millis: number, zone: string): boolean {}
 
 function floorToSecond(millis: number): number {

[Killed] StringLiteral
src/tz/intl-backend.ts:77:52
  * for offset math or season logic; the flag is reported data only.
  */
 function isDstAt(millis: number, zone: string): boolean {
-  return /Daylight|Summer/.test(zoneNamePart(zone, 'long', millis));
+  return /Daylight|Summer/.test(zoneNamePart(zone, "", millis));
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Value  out of range for Intl.DateTimeFormat options property timeZoneName

[Killed] BlockStatement
src/tz/intl-backend.ts:80:48
   return /Daylight|Summer/.test(zoneNamePart(zone, 'long', millis));
 }
 
-function floorToSecond(millis: number): number {
-  return Math.floor(millis / SECOND_MILLIS) * SECOND_MILLIS;
-}
+function floorToSecond(millis: number): number {}
 
 /**
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:81:10
 }
 
 function floorToSecond(millis: number): number {
-  return Math.floor(millis / SECOND_MILLIS) * SECOND_MILLIS;
+  return Math.floor(millis / SECOND_MILLIS) / SECOND_MILLIS;
 }
 
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:81:21
 }
 
 function floorToSecond(millis: number): number {
-  return Math.floor(millis / SECOND_MILLIS) * SECOND_MILLIS;
+  return Math.floor(millis * SECOND_MILLIS) * SECOND_MILLIS;
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] BlockStatement
src/tz/intl-backend.ts:94:11
   lo: number,
   offsetAtLo: number,
   hi: number,
-): number {
-  let low = lo;
-  let high = hi;
-  while (high - low > SECOND_MILLIS) {
-    let mid = floorToSecond(low + (high - low) / 2);
-    if (mid <= low) {
-      mid = low + SECOND_MILLIS;
-    }
-    if (offsetSecondsAt(mid, zone) === offsetAtLo) {
-      low = mid;
-    } else {
-      high = mid;
-    }
-  }
-  return high;
-}
+): number {}
 
 /** Creates the Intl backend. */
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] EqualityOperator
src/tz/intl-backend.ts:97:10
 ): number {
   let low = lo;
   let high = hi;
-  while (high - low > SECOND_MILLIS) {
+  while (high - low <= SECOND_MILLIS) {
     let mid = floorToSecond(low + (high - low) / 2);
     if (mid <= low) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/intl-backend.ts:97:10
 ): number {
   let low = lo;
   let high = hi;
-  while (high - low > SECOND_MILLIS) {
+  while (false) {
     let mid = floorToSecond(low + (high - low) / 2);
     if (mid <= low) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:98:35
   let low = lo;
   let high = hi;
   while (high - low > SECOND_MILLIS) {
-    let mid = floorToSecond(low + (high - low) / 2);
+    let mid = floorToSecond(low + (high - low) * 2);
     if (mid <= low) {
       mid = low + SECOND_MILLIS;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Timeout] ArithmeticOperator
src/tz/intl-backend.ts:98:36
   let low = lo;
   let high = hi;
   while (high - low > SECOND_MILLIS) {
-    let mid = floorToSecond(low + (high - low) / 2);
+    let mid = floorToSecond(low + (high + low) / 2);
     if (mid <= low) {
       mid = low + SECOND_MILLIS;

[Timeout] EqualityOperator
src/tz/intl-backend.ts:99:9
   let high = hi;
   while (high - low > SECOND_MILLIS) {
     let mid = floorToSecond(low + (high - low) / 2);
-    if (mid <= low) {
+    if (mid > low) {
       mid = low + SECOND_MILLIS;
     }

[Survived] ConditionalExpression
src/tz/intl-backend.ts:99:9
   let high = hi;
   while (high - low > SECOND_MILLIS) {
     let mid = floorToSecond(low + (high - low) / 2);
-    if (mid <= low) {
+    if (false) {
       mid = low + SECOND_MILLIS;
     }

[NoCoverage] ArithmeticOperator
src/tz/intl-backend.ts:100:13
   while (high - low > SECOND_MILLIS) {
     let mid = floorToSecond(low + (high - low) / 2);
     if (mid <= low) {
-      mid = low + SECOND_MILLIS;
+      mid = low - SECOND_MILLIS;
     }
     if (offsetSecondsAt(mid, zone) === offsetAtLo) {

[Killed] ConditionalExpression
src/tz/intl-backend.ts:102:9
     if (mid <= low) {
       mid = low + SECOND_MILLIS;
     }
-    if (offsetSecondsAt(mid, zone) === offsetAtLo) {
+    if (true) {
       low = mid;
     } else {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(569) ] to deeply equal []

[Timeout] EqualityOperator
src/tz/intl-backend.ts:102:9
     if (mid <= low) {
       mid = low + SECOND_MILLIS;
     }
-    if (offsetSecondsAt(mid, zone) === offsetAtLo) {
+    if (offsetSecondsAt(mid, zone) !== offsetAtLo) {
       low = mid;
     } else {

[Timeout] BlockStatement
src/tz/intl-backend.ts:104:12
     }
     if (offsetSecondsAt(mid, zone) === offsetAtLo) {
       low = mid;
-    } else {
-      high = mid;
-    }
+    } else {}
   }
   return high;

[Killed] ArrowFunction
src/tz/intl-backend.ts:113:20
 
 /** Creates the Intl backend. */
 export function createIntlBackend(): TzBackend {
-  const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => ({
-    offsetSeconds: offsetSecondsAt(instantUtcMillis, zone),
-    abbreviation: zoneNamePart(zone, 'short', instantUtcMillis),
-    isDst: isDstAt(instantUtcMillis, zone),
-  });
+  const offsetAt = () => undefined;
 
   const transitionsBetween = (
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'offsetSeconds')

[Killed] ObjectLiteral
src/tz/intl-backend.ts:113:77
 
 /** Creates the Intl backend. */
 export function createIntlBackend(): TzBackend {
-  const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => ({
-    offsetSeconds: offsetSecondsAt(instantUtcMillis, zone),
-    abbreviation: zoneNamePart(zone, 'short', instantUtcMillis),
-    isDst: isDstAt(instantUtcMillis, zone),
-  });
+  const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => ({});
 
   const transitionsBetween = (
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(1138) ] to deeply equal []

[Survived] ArithmeticOperator
src/tz/intl-backend.ts:125:18
     zone: string,
   ): ZoneTransition[] => {
     const out: ZoneTransition[] = [];
-    let cursor = floorToSecond(startUtcMillis) - SECOND_MILLIS;
+    let cursor = floorToSecond(startUtcMillis) + SECOND_MILLIS;
     let cursorOffset = offsetSecondsAt(cursor, zone);
     while (cursor < endUtcMillis) {

[Killed] ConditionalExpression
src/tz/intl-backend.ts:127:12
     const out: ZoneTransition[] = [];
     let cursor = floorToSecond(startUtcMillis) - SECOND_MILLIS;
     let cursorOffset = offsetSecondsAt(cursor, zone);
-    while (cursor < endUtcMillis) {
+    while (false) {
       const probe = Math.min(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
       if (probe <= cursor) {
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/tz/intl-backend.ts:127:12
     const out: ZoneTransition[] = [];
     let cursor = floorToSecond(startUtcMillis) - SECOND_MILLIS;
     let cursorOffset = offsetSecondsAt(cursor, zone);
-    while (cursor < endUtcMillis) {
+    while (cursor >= endUtcMillis) {
       const probe = Math.min(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
       if (probe <= cursor) {
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/tz/intl-backend.ts:128:21
     let cursor = floorToSecond(startUtcMillis) - SECOND_MILLIS;
     let cursorOffset = offsetSecondsAt(cursor, zone);
     while (cursor < endUtcMillis) {
-      const probe = Math.min(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
+      const probe = Math.max(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
       if (probe <= cursor) {
         break;
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:128:30
     let cursor = floorToSecond(startUtcMillis) - SECOND_MILLIS;
     let cursorOffset = offsetSecondsAt(cursor, zone);
     while (cursor < endUtcMillis) {
-      const probe = Math.min(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
+      const probe = Math.min(cursor - PROBE_MILLIS, floorToSecond(endUtcMillis));
       if (probe <= cursor) {
         break;
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tz/intl-backend.ts:129:11
     let cursorOffset = offsetSecondsAt(cursor, zone);
     while (cursor < endUtcMillis) {
       const probe = Math.min(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
-      if (probe <= cursor) {
+      if (true) {
         break;
       }
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/tz/intl-backend.ts:129:11
     let cursorOffset = offsetSecondsAt(cursor, zone);
     while (cursor < endUtcMillis) {
       const probe = Math.min(cursor + PROBE_MILLIS, floorToSecond(endUtcMillis));
-      if (probe <= cursor) {
+      if (probe > cursor) {
         break;
       }
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/tz/intl-backend.ts:133:11
         break;
       }
       const probeOffset = offsetSecondsAt(probe, zone);
-      if (probeOffset === cursorOffset) {
+      if (probeOffset !== cursorOffset) {
         cursor = probe;
         continue;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(13913) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/intl-backend.ts:133:11
         break;
       }
       const probeOffset = offsetSecondsAt(probe, zone);
-      if (probeOffset === cursorOffset) {
+      if (true) {
         cursor = probe;
         continue;
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tz/intl-backend.ts:139:11
       }
       const instant = bisectChange(zone, cursor, cursorOffset, probe);
       const after = offsetSecondsAt(instant, zone);
-      if (instant >= startUtcMillis && instant < endUtcMillis) {
+      if (false) {
         out.push({
           instant,
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/tz/intl-backend.ts:139:64
       }
       const instant = bisectChange(zone, cursor, cursorOffset, probe);
       const after = offsetSecondsAt(instant, zone);
-      if (instant >= startUtcMillis && instant < endUtcMillis) {
-        out.push({
-          instant,
-          offsetBeforeSeconds: cursorOffset,
-          offsetAfterSeconds: after,
-          deltaSeconds: after - cursorOffset,
-        });
-      }
+      if (instant >= startUtcMillis && instant < endUtcMillis) {}
       cursor = instant;
       cursorOffset = after;
killedBy: backend cross-check a transition missing from the TZif list is caught by the scan direction
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/tz/intl-backend.ts:144:25
           instant,
           offsetBeforeSeconds: cursorOffset,
           offsetAfterSeconds: after,
-          deltaSeconds: after - cursorOffset,
+          deltaSeconds: after + cursorOffset,
         });
       }
killedBy: intl backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent
