[Killed] Regex
src/tz/posix-tz.ts:45:14
   dstEnd: PosixRule | null;
 }
 
-const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-]{3,})>)/;
+const NAME = /^(?:([A-Za-z])|<([A-Za-z0-9+-]{3,})>)/;
 const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2}))?)?/;
 const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] Regex
src/tz/posix-tz.ts:45:14
   dstEnd: PosixRule | null;
 }
 
-const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-]{3,})>)/;
+const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-])>)/;
 const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2}))?)?/;
 const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(5) ] to deeply equal []

[Killed] Regex
src/tz/posix-tz.ts:46:16
 }
 
 const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-]{3,})>)/;
-const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2}))?)?/;
+const OFFSET = /^([+-]?)(\d)(?::(\d{1,2})(?::(\d{1,2}))?)?/;
 const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(1) ] to deeply equal []

[Killed] Regex
src/tz/posix-tz.ts:46:16
 }
 
 const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-]{3,})>)/;
-const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2}))?)?/;
+const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2})))?/;
 const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(1) ] to deeply equal []

[Killed] Regex
src/tz/posix-tz.ts:47:18
 
 const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-]{3,})>)/;
 const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2}))?)?/;
-const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
+const RULE_DAY = /^(?:M(\D{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
 
 class Cursor {
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] Regex
src/tz/posix-tz.ts:47:18
 
 const NAME = /^(?:([A-Za-z]{3,})|<([A-Za-z0-9+-]{3,})>)/;
 const OFFSET = /^([+-]?)(\d{1,3})(?::(\d{1,2})(?::(\d{1,2}))?)?/;
-const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d{1,3}))/;
+const RULE_DAY = /^(?:M(\d{1,2})\.(\d)\.(\d)|J(\d{1,3})|(\d))/;
 
 class Cursor {
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: parse failed

[Killed] BlockStatement
src/tz/posix-tz.ts:55:44
     public pos = 0,
   ) {}
 
-  take(re: RegExp): RegExpExecArray | null {
-    const match = re.exec(this.text.slice(this.pos));
-    if (match !== null) {
-      this.pos += match[0].length;
-    }
-    return match;
-  }
+  take(re: RegExp): RegExpExecArray | null {}
 
   done(): boolean {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading '1')

[Killed] MethodExpression
src/tz/posix-tz.ts:56:27
   ) {}
 
   take(re: RegExp): RegExpExecArray | null {
-    const match = re.exec(this.text.slice(this.pos));
+    const match = re.exec(this.text);
     if (match !== null) {
       this.pos += match[0].length;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:57:9
 
   take(re: RegExp): RegExpExecArray | null {
     const match = re.exec(this.text.slice(this.pos));
-    if (match !== null) {
+    if (match === null) {
       this.pos += match[0].length;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of null (reading '0')

[Killed] ConditionalExpression
src/tz/posix-tz.ts:57:9
 
   take(re: RegExp): RegExpExecArray | null {
     const match = re.exec(this.text.slice(this.pos));
-    if (match !== null) {
+    if (false) {
       this.pos += match[0].length;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] AssignmentOperator
src/tz/posix-tz.ts:58:7
   take(re: RegExp): RegExpExecArray | null {
     const match = re.exec(this.text.slice(this.pos));
     if (match !== null) {
-      this.pos += match[0].length;
+      this.pos -= match[0].length;
     }
     return match;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] BlockStatement
src/tz/posix-tz.ts:63:19
     return match;
   }
 
-  done(): boolean {
-    return this.pos >= this.text.length;
-  }
+  done(): boolean {}
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:64:12
   }
 
   done(): boolean {
-    return this.pos >= this.text.length;
+    return false;
   }
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:64:12
   }
 
   done(): boolean {
-    return this.pos >= this.text.length;
+    return this.pos < this.text.length;
   }
 }
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null to be 'EDT' // Object.is equality

[Killed] BlockStatement
src/tz/posix-tz.ts:68:60
   }
 }
 
-function parseOffsetSeconds(cursor: Cursor): number | null {
-  const match = cursor.take(OFFSET);
-  if (match === null) {
-    return null;
-  }
-  const sign = match[1] === '-' ? -1 : 1;
-  const seconds =
-    Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
-  const eastPositive = -sign * seconds;
-  return eastPositive === 0 ? 0 : eastPositive;
-}
+function parseOffsetSeconds(cursor: Cursor): number | null {}
 
 function parseRule(cursor: Cursor): PosixRule | null {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:70:7
 
 function parseOffsetSeconds(cursor: Cursor): number | null {
   const match = cursor.take(OFFSET);
-  if (match === null) {
+  if (match !== null) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:70:7
 
 function parseOffsetSeconds(cursor: Cursor): number | null {
   const match = cursor.take(OFFSET);
-  if (match === null) {
+  if (true) {
     return null;
   }
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null not to be null

[Killed] EqualityOperator
src/tz/posix-tz.ts:73:16
   if (match === null) {
     return null;
   }
-  const sign = match[1] === '-' ? -1 : 1;
+  const sign = match[1] !== '-' ? -1 : 1;
   const seconds =
     Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(41) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:73:16
   if (match === null) {
     return null;
   }
-  const sign = match[1] === '-' ? -1 : 1;
+  const sign = false ? -1 : 1;
   const seconds =
     Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(29) ] to deeply equal []

[Killed] LogicalOperator
src/tz/posix-tz.ts:75:38
   }
   const sign = match[1] === '-' ? -1 : 1;
   const seconds =
-    Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
+    Number(match[2]) * 3600 + Number(match[3] && 0) * 60 + Number(match[4] ?? 0);
   const eastPositive = -sign * seconds;
   return eastPositive === 0 ? 0 : eastPositive;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:75:31
   }
   const sign = match[1] === '-' ? -1 : 1;
   const seconds =
-    Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
+    Number(match[2]) * 3600 + Number(match[3] ?? 0) / 60 + Number(match[4] ?? 0);
   const eastPositive = -sign * seconds;
   return eastPositive === 0 ? 0 : eastPositive;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(5) ] to deeply equal []

[Killed] UnaryOperator
src/tz/posix-tz.ts:76:24
   const sign = match[1] === '-' ? -1 : 1;
   const seconds =
     Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
-  const eastPositive = -sign * seconds;
+  const eastPositive = +sign * seconds;
   return eastPositive === 0 ? 0 : eastPositive;
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(41) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:76:24
   const sign = match[1] === '-' ? -1 : 1;
   const seconds =
     Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
-  const eastPositive = -sign * seconds;
+  const eastPositive = -sign / seconds;
   return eastPositive === 0 ? 0 : eastPositive;
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(42) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:77:10
   const seconds =
     Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
   const eastPositive = -sign * seconds;
-  return eastPositive === 0 ? 0 : eastPositive;
+  return false ? 0 : eastPositive;
 }
 
killedBy: POSIX TZ footer parsing parses angle-bracket names, explicit DST offsets, and rule times (Antarctica/Troll footer)
statusReason: expected -0 to be +0 // Object.is equality

[Killed] EqualityOperator
src/tz/posix-tz.ts:77:10
   const seconds =
     Number(match[2]) * 3600 + Number(match[3] ?? 0) * 60 + Number(match[4] ?? 0);
   const eastPositive = -sign * seconds;
-  return eastPositive === 0 ? 0 : eastPositive;
+  return eastPositive !== 0 ? 0 : eastPositive;
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(24) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:82:7
 
 function parseRule(cursor: Cursor): PosixRule | null {
   const match = cursor.take(RULE_DAY);
-  if (match === null) {
+  if (true) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:82:7
 
 function parseRule(cursor: Cursor): PosixRule | null {
   const match = cursor.take(RULE_DAY);
-  if (match === null) {
+  if (match !== null) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:86:7
     return null;
   }
   let day: PosixDayRule;
-  if (match[1] !== undefined) {
+  if (false) {
     day = {
       form: 'month-week-day',
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] ConditionalExpression
src/tz/posix-tz.ts:86:7
     return null;
   }
   let day: PosixDayRule;
-  if (match[1] !== undefined) {
+  if (true) {
     day = {
       form: 'month-week-day',
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected NaN to be 1709251200000 // Object.is equality

[Killed] StringLiteral
src/tz/posix-tz.ts:88:13
   let day: PosixDayRule;
   if (match[1] !== undefined) {
     day = {
-      form: 'month-week-day',
+      form: "",
       month: Number(match[1]),
       week: Number(match[2]),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] BlockStatement
src/tz/posix-tz.ts:93:38
       week: Number(match[2]),
       weekday: Number(match[3]),
     };
-  } else if (match[4] !== undefined) {
-    day = { form: 'julian-no-leap', day: Number(match[4]) };
-  } else {
+  } else if (match[4] !== undefined) {} else {
     day = { form: 'julian-with-leap', day: Number(match[5]) };
   }
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: Cannot read properties of undefined (reading 'form')

[Killed] EqualityOperator
src/tz/posix-tz.ts:93:14
       week: Number(match[2]),
       weekday: Number(match[3]),
     };
-  } else if (match[4] !== undefined) {
+  } else if (match[4] === undefined) {
     day = { form: 'julian-no-leap', day: Number(match[4]) };
   } else {
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected NaN to be 1709251200000 // Object.is equality

[Killed] BlockStatement
src/tz/posix-tz.ts:95:10
     };
   } else if (match[4] !== undefined) {
     day = { form: 'julian-no-leap', day: Number(match[4]) };
-  } else {
-    day = { form: 'julian-with-leap', day: Number(match[5]) };
-  }
+  } else {}
   let timeSeconds = 7200;
   if (cursor.text[cursor.pos] === '/') {
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: Cannot read properties of undefined (reading 'form')

[Survived] StringLiteral
src/tz/posix-tz.ts:96:19
   } else if (match[4] !== undefined) {
     day = { form: 'julian-no-leap', day: Number(match[4]) };
   } else {
-    day = { form: 'julian-with-leap', day: Number(match[5]) };
+    day = { form: "", day: Number(match[5]) };
   }
   let timeSeconds = 7200;

[Killed] BlockStatement
src/tz/posix-tz.ts:99:40
     day = { form: 'julian-with-leap', day: Number(match[5]) };
   }
   let timeSeconds = 7200;
-  if (cursor.text[cursor.pos] === '/') {
-    cursor.pos += 1;
-    const time = cursor.take(OFFSET);
-    if (time === null) {
-      return null;
-    }
-    const sign = time[1] === '-' ? -1 : 1;
-    const magnitude =
-      Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
-    timeSeconds = magnitude === 0 ? 0 : sign * magnitude;
-  }
+  if (cursor.text[cursor.pos] === '/') {}
   return { day, timeSeconds };
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(8) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:99:7
     day = { form: 'julian-with-leap', day: Number(match[5]) };
   }
   let timeSeconds = 7200;
-  if (cursor.text[cursor.pos] === '/') {
+  if (false) {
     cursor.pos += 1;
     const time = cursor.take(OFFSET);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(8) ] to deeply equal []

[Killed] AssignmentOperator
src/tz/posix-tz.ts:100:5
   }
   let timeSeconds = 7200;
   if (cursor.text[cursor.pos] === '/') {
-    cursor.pos += 1;
+    cursor.pos -= 1;
     const time = cursor.take(OFFSET);
     if (time === null) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(8) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:102:9
   if (cursor.text[cursor.pos] === '/') {
     cursor.pos += 1;
     const time = cursor.take(OFFSET);
-    if (time === null) {
+    if (true) {
       return null;
     }
killedBy: POSIX TZ footer parsing parses angle-bracket names, explicit DST offsets, and rule times (Antarctica/Troll footer)
statusReason: expected undefined to be '+00' // Object.is equality

[Killed] EqualityOperator
src/tz/posix-tz.ts:102:9
   if (cursor.text[cursor.pos] === '/') {
     cursor.pos += 1;
     const time = cursor.take(OFFSET);
-    if (time === null) {
+    if (time !== null) {
       return null;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(8) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:105:18
     if (time === null) {
       return null;
     }
-    const sign = time[1] === '-' ? -1 : 1;
+    const sign = time[1] !== '-' ? -1 : 1;
     const magnitude =
       Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(12) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:105:18
     if (time === null) {
       return null;
     }
-    const sign = time[1] === '-' ? -1 : 1;
+    const sign = true ? -1 : 1;
     const magnitude =
       Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(12) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:107:7
     }
     const sign = time[1] === '-' ? -1 : 1;
     const magnitude =
-      Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
+      Number(time[2]) / 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
     timeSeconds = magnitude === 0 ? 0 : sign * magnitude;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(12) ] to deeply equal []

[Killed] LogicalOperator
src/tz/posix-tz.ts:107:67
     }
     const sign = time[1] === '-' ? -1 : 1;
     const magnitude =
-      Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
+      Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] && 0);
     timeSeconds = magnitude === 0 ? 0 : sign * magnitude;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] EqualityOperator
src/tz/posix-tz.ts:108:19
     const sign = time[1] === '-' ? -1 : 1;
     const magnitude =
       Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
-    timeSeconds = magnitude === 0 ? 0 : sign * magnitude;
+    timeSeconds = magnitude !== 0 ? 0 : sign * magnitude;
   }
   return { day, timeSeconds };
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(12) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:108:41
     const sign = time[1] === '-' ? -1 : 1;
     const magnitude =
       Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
-    timeSeconds = magnitude === 0 ? 0 : sign * magnitude;
+    timeSeconds = magnitude === 0 ? 0 : sign / magnitude;
   }
   return { day, timeSeconds };
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(12) ] to deeply equal []

[Killed] ObjectLiteral
src/tz/posix-tz.ts:110:10
       Number(time[2]) * 3600 + Number(time[3] ?? 0) * 60 + Number(time[4] ?? 0);
     timeSeconds = magnitude === 0 ? 0 : sign * magnitude;
   }
-  return { day, timeSeconds };
+  return {};
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'form')

[Killed] ConditionalExpression
src/tz/posix-tz.ts:121:7
 export function parsePosixTz(text: string): PosixTz | null {
   const cursor = new Cursor(text);
   const stdName = cursor.take(NAME);
-  if (stdName === null) {
+  if (true) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:121:7
 export function parsePosixTz(text: string): PosixTz | null {
   const cursor = new Cursor(text);
   const stdName = cursor.take(NAME);
-  if (stdName === null) {
+  if (stdName !== null) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/posix-tz.ts:125:7
     return null;
   }
   const stdOffsetSeconds = parseOffsetSeconds(cursor);
-  if (stdOffsetSeconds === null) {
+  if (true) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:125:7
     return null;
   }
   const stdOffsetSeconds = parseOffsetSeconds(cursor);
-  if (stdOffsetSeconds === null) {
+  if (stdOffsetSeconds !== null) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] LogicalOperator
src/tz/posix-tz.ts:128:27
   if (stdOffsetSeconds === null) {
     return null;
   }
-  const stdAbbreviation = stdName[1] ?? stdName[2] ?? '';
+  const stdAbbreviation = stdName[1] && stdName[2] ?? '';
   if (cursor.done()) {
     return {
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected '' to be 'EST' // Object.is equality

[Killed] LogicalOperator
src/tz/posix-tz.ts:128:27
   if (stdOffsetSeconds === null) {
     return null;
   }
-  const stdAbbreviation = stdName[1] ?? stdName[2] ?? '';
+  const stdAbbreviation = (stdName[1] ?? stdName[2]) && '';
   if (cursor.done()) {
     return {
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected '' to be 'EST' // Object.is equality

[Killed] BlockStatement
src/tz/posix-tz.ts:129:22
     return null;
   }
   const stdAbbreviation = stdName[1] ?? stdName[2] ?? '';
-  if (cursor.done()) {
-    return {
-      stdAbbreviation,
-      stdOffsetSeconds,
-      dstAbbreviation: null,
-      dstOffsetSeconds: null,
-      dstStart: null,
-      dstEnd: null,
-    };
-  }
+  if (cursor.done()) {}
   const dstName = cursor.take(NAME);
   if (dstName === null) {
killedBy: POSIX TZ footer parsing parses a constant-offset zone with no DST
statusReason: expected undefined to be -10800 // Object.is equality

[Killed] ConditionalExpression
src/tz/posix-tz.ts:129:7
     return null;
   }
   const stdAbbreviation = stdName[1] ?? stdName[2] ?? '';
-  if (cursor.done()) {
+  if (true) {
     return {
       stdAbbreviation,
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/tz/posix-tz.ts:130:12
   }
   const stdAbbreviation = stdName[1] ?? stdName[2] ?? '';
   if (cursor.done()) {
-    return {
-      stdAbbreviation,
-      stdOffsetSeconds,
-      dstAbbreviation: null,
-      dstOffsetSeconds: null,
-      dstStart: null,
-      dstEnd: null,
-    };
+    return {};
   }
   const dstName = cursor.take(NAME);
killedBy: POSIX TZ footer parsing parses a constant-offset zone with no DST
statusReason: expected undefined to be -10800 // Object.is equality

[Killed] ConditionalExpression
src/tz/posix-tz.ts:140:7
     };
   }
   const dstName = cursor.take(NAME);
-  if (dstName === null) {
+  if (true) {
     return null;
   }
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null not to be null

[Killed] EqualityOperator
src/tz/posix-tz.ts:140:7
     };
   }
   const dstName = cursor.take(NAME);
-  if (dstName === null) {
+  if (dstName !== null) {
     return null;
   }
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null not to be null

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:143:26
   if (dstName === null) {
     return null;
   }
-  let dstOffsetSeconds = stdOffsetSeconds + 3600;
+  let dstOffsetSeconds = stdOffsetSeconds - 3600;
   if (cursor.text[cursor.pos] !== ',') {
     const parsed = parseOffsetSeconds(cursor);
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected -21600 to be -14400 // Object.is equality

[Killed] ConditionalExpression
src/tz/posix-tz.ts:144:7
     return null;
   }
   let dstOffsetSeconds = stdOffsetSeconds + 3600;
-  if (cursor.text[cursor.pos] !== ',') {
+  if (true) {
     const parsed = parseOffsetSeconds(cursor);
     if (parsed === null) {
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null not to be null

[Killed] BlockStatement
src/tz/posix-tz.ts:144:40
     return null;
   }
   let dstOffsetSeconds = stdOffsetSeconds + 3600;
-  if (cursor.text[cursor.pos] !== ',') {
-    const parsed = parseOffsetSeconds(cursor);
-    if (parsed === null) {
-      return null;
-    }
-    dstOffsetSeconds = parsed;
-  }
+  if (cursor.text[cursor.pos] !== ',') {}
   if (cursor.text[cursor.pos] !== ',') {
     return null;
killedBy: POSIX TZ footer parsing parses angle-bracket names, explicit DST offsets, and rule times (Antarctica/Troll footer)
statusReason: expected undefined to be '+00' // Object.is equality

[Killed] ConditionalExpression
src/tz/posix-tz.ts:146:9
   let dstOffsetSeconds = stdOffsetSeconds + 3600;
   if (cursor.text[cursor.pos] !== ',') {
     const parsed = parseOffsetSeconds(cursor);
-    if (parsed === null) {
+    if (true) {
       return null;
     }
killedBy: POSIX TZ footer parsing parses angle-bracket names, explicit DST offsets, and rule times (Antarctica/Troll footer)
statusReason: expected undefined to be '+00' // Object.is equality

[Killed] EqualityOperator
src/tz/posix-tz.ts:146:9
   let dstOffsetSeconds = stdOffsetSeconds + 3600;
   if (cursor.text[cursor.pos] !== ',') {
     const parsed = parseOffsetSeconds(cursor);
-    if (parsed === null) {
+    if (parsed !== null) {
       return null;
     }
killedBy: POSIX TZ footer parsing parses angle-bracket names, explicit DST offsets, and rule times (Antarctica/Troll footer)
statusReason: expected undefined to be '+00' // Object.is equality

[Killed] EqualityOperator
src/tz/posix-tz.ts:151:7
     }
     dstOffsetSeconds = parsed;
   }
-  if (cursor.text[cursor.pos] !== ',') {
+  if (cursor.text[cursor.pos] === ',') {
     return null;
   }
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/tz/posix-tz.ts:151:7
     }
     dstOffsetSeconds = parsed;
   }
-  if (cursor.text[cursor.pos] !== ',') {
+  if (true) {
     return null;
   }
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected null not to be null

[Killed] AssignmentOperator
src/tz/posix-tz.ts:154:3
   if (cursor.text[cursor.pos] !== ',') {
     return null;
   }
-  cursor.pos += 1;
+  cursor.pos -= 1;
   const dstStart = parseRule(cursor);
   if (dstStart === null || cursor.text[cursor.pos] !== ',') {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []
