[Killed] ConditionalExpression
src/tz/posix-tz.ts:156:7
   }
   cursor.pos += 1;
   const dstStart = parseRule(cursor);
-  if (dstStart === null || cursor.text[cursor.pos] !== ',') {
+  if (true) {
     return null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/tz/posix-tz.ts:156:7
   }
   cursor.pos += 1;
   const dstStart = parseRule(cursor);
-  if (dstStart === null || cursor.text[cursor.pos] !== ',') {
+  if (dstStart !== null || cursor.text[cursor.pos] !== ',') {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] BooleanLiteral
src/tz/posix-tz.ts:161:26
   }
   cursor.pos += 1;
   const dstEnd = parseRule(cursor);
-  if (dstEnd === null || !cursor.done()) {
+  if (dstEnd === null || cursor.done()) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:161:7
   }
   cursor.pos += 1;
   const dstEnd = parseRule(cursor);
-  if (dstEnd === null || !cursor.done()) {
+  if (dstEnd !== null || !cursor.done()) {
     return null;
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] LogicalOperator
src/tz/posix-tz.ts:167:22
   return {
     stdAbbreviation,
     stdOffsetSeconds,
-    dstAbbreviation: dstName[1] ?? dstName[2] ?? '',
+    dstAbbreviation: (dstName[1] ?? dstName[2]) && '',
     dstOffsetSeconds,
     dstStart,
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected '' to be 'EDT' // Object.is equality

[Killed] LogicalOperator
src/tz/posix-tz.ts:167:22
   return {
     stdAbbreviation,
     stdOffsetSeconds,
-    dstAbbreviation: dstName[1] ?? dstName[2] ?? '',
+    dstAbbreviation: dstName[1] && dstName[2] ?? '',
     dstOffsetSeconds,
     dstStart,
killedBy: POSIX TZ footer parsing parses a US-style rule with east-positive offsets
statusReason: expected '' to be 'EDT' // Object.is equality

[Killed] BlockStatement
src/tz/posix-tz.ts:174:69
   };
 }
 
-function ruleDayFromEpoch(rule: PosixDayRule, year: number): number {
-  if (rule.form === 'month-week-day') {
-    const firstOfMonth = daysFromCivil(year, rule.month, 1);
-    const firstWeekday = weekdayFromDays(firstOfMonth);
-    let day = 1 + ((rule.weekday - firstWeekday + 7) % 7) + (rule.week - 1) * 7;
-    const limit = daysInMonth(year, rule.month);
-    while (day > limit) {
-      day -= 7;
-    }
-    return daysFromCivil(year, rule.month, day);
-  }
-  if (rule.form === 'julian-no-leap') {
-    const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
-    return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
-  }
-  return daysFromCivil(year, 1, 1) + rule.day;
-}
+function ruleDayFromEpoch(rule: PosixDayRule, year: number): number {}
 
 /**
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] ConditionalExpression
src/tz/posix-tz.ts:175:7
 }
 
 function ruleDayFromEpoch(rule: PosixDayRule, year: number): number {
-  if (rule.form === 'month-week-day') {
+  if (false) {
     const firstOfMonth = daysFromCivil(year, rule.month, 1);
     const firstWeekday = weekdayFromDays(firstOfMonth);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] EqualityOperator
src/tz/posix-tz.ts:175:7
 }
 
 function ruleDayFromEpoch(rule: PosixDayRule, year: number): number {
-  if (rule.form === 'month-week-day') {
+  if (rule.form !== 'month-week-day') {
     const firstOfMonth = daysFromCivil(year, rule.month, 1);
     const firstWeekday = weekdayFromDays(firstOfMonth);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:178:21
   if (rule.form === 'month-week-day') {
     const firstOfMonth = daysFromCivil(year, rule.month, 1);
     const firstWeekday = weekdayFromDays(firstOfMonth);
-    let day = 1 + ((rule.weekday - firstWeekday + 7) % 7) + (rule.week - 1) * 7;
+    let day = 1 + ((rule.weekday + firstWeekday + 7) % 7) + (rule.week - 1) * 7;
     const limit = daysInMonth(year, rule.month);
     while (day > limit) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(33) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:178:15
   if (rule.form === 'month-week-day') {
     const firstOfMonth = daysFromCivil(year, rule.month, 1);
     const firstWeekday = weekdayFromDays(firstOfMonth);
-    let day = 1 + ((rule.weekday - firstWeekday + 7) % 7) + (rule.week - 1) * 7;
+    let day = 1 - (rule.weekday - firstWeekday + 7) % 7 + (rule.week - 1) * 7;
     const limit = daysInMonth(year, rule.month);
     while (day > limit) {
killedBy: POSIX TZ footer parsing computes the 2024 US spring-forward instant from the rule
statusReason: expected 1709708400000 to be 1710054000000 // Object.is equality

[Killed] ConditionalExpression
src/tz/posix-tz.ts:180:12
     const firstWeekday = weekdayFromDays(firstOfMonth);
     let day = 1 + ((rule.weekday - firstWeekday + 7) % 7) + (rule.week - 1) * 7;
     const limit = daysInMonth(year, rule.month);
-    while (day > limit) {
+    while (false) {
       day -= 7;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(9) ] to deeply equal []

[Killed] EqualityOperator
src/tz/posix-tz.ts:180:12
     const firstWeekday = weekdayFromDays(firstOfMonth);
     let day = 1 + ((rule.weekday - firstWeekday + 7) % 7) + (rule.week - 1) * 7;
     const limit = daysInMonth(year, rule.month);
-    while (day > limit) {
+    while (day >= limit) {
       day -= 7;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(4) ] to deeply equal []

[Timeout] AssignmentOperator
src/tz/posix-tz.ts:181:7
     let day = 1 + ((rule.weekday - firstWeekday + 7) % 7) + (rule.week - 1) * 7;
     const limit = daysInMonth(year, rule.month);
     while (day > limit) {
-      day -= 7;
+      day += 7;
     }
     return daysFromCivil(year, rule.month, day);

[Killed] EqualityOperator
src/tz/posix-tz.ts:185:7
     }
     return daysFromCivil(year, rule.month, day);
   }
-  if (rule.form === 'julian-no-leap') {
+  if (rule.form !== 'julian-no-leap') {
     const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
     return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1677715200000 to be 1677628800000 // Object.is equality

[Killed] BlockStatement
src/tz/posix-tz.ts:185:39
     }
     return daysFromCivil(year, rule.month, day);
   }
-  if (rule.form === 'julian-no-leap') {
-    const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
-    return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
-  }
+  if (rule.form === 'julian-no-leap') {}
   return daysFromCivil(year, 1, 1) + rule.day;
 }
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1677715200000 to be 1677628800000 // Object.is equality

[Killed] ConditionalExpression
src/tz/posix-tz.ts:186:61
     return daysFromCivil(year, rule.month, day);
   }
   if (rule.form === 'julian-no-leap') {
-    const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
+    const leapAdjust = rule.day >= 60 && rule.day <= 365 && true ? 1 : 0;
     return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
   }
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1677715200000 to be 1677628800000 // Object.is equality

[Killed] EqualityOperator
src/tz/posix-tz.ts:186:61
     return daysFromCivil(year, rule.month, day);
   }
   if (rule.form === 'julian-no-leap') {
-    const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
+    const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) !== 29 ? 1 : 0;
     return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
   }
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1709164800000 to be 1709251200000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:187:12
   }
   if (rule.form === 'julian-no-leap') {
     const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
-    return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
+    return daysFromCivil(year, 1, 1) - rule.day - 1 + leapAdjust;
   }
   return daysFromCivil(year, 1, 1) + rule.day;
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1698883200000 to be 1709251200000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:187:12
   }
   if (rule.form === 'julian-no-leap') {
     const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
-    return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
+    return daysFromCivil(year, 1, 1) + rule.day - 1 - leapAdjust;
   }
   return daysFromCivil(year, 1, 1) + rule.day;
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1709078400000 to be 1709251200000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:189:10
     const leapAdjust = rule.day >= 60 && rule.day <= 365 && daysInMonth(year, 2) === 29 ? 1 : 0;
     return daysFromCivil(year, 1, 1) + rule.day - 1 + leapAdjust;
   }
-  return daysFromCivil(year, 1, 1) + rule.day;
+  return daysFromCivil(year, 1, 1) - rule.day;
 }
 
killedBy: POSIX TZ footer parsing julian day rules skip February 29 while zero-based day rules count it
statusReason: expected 1698883200000 to be 1709251200000 // Object.is equality

[Killed] BlockStatement
src/tz/posix-tz.ts:202:11
   rule: PosixRule,
   year: number,
   offsetBeforeSeconds: number,
-): number {
-  const days = ruleDayFromEpoch(rule.day, year);
-  return (days * 86_400 + rule.timeSeconds - offsetBeforeSeconds) * 1000;
-}
+): number {}
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:204:11
   offsetBeforeSeconds: number,
 ): number {
   const days = ruleDayFromEpoch(rule.day, year);
-  return (days * 86_400 + rule.timeSeconds - offsetBeforeSeconds) * 1000;
+  return (days * 86_400 + rule.timeSeconds + offsetBeforeSeconds) * 1000;
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(25) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/posix-tz.ts:204:11
   offsetBeforeSeconds: number,
 ): number {
   const days = ruleDayFromEpoch(rule.day, year);
-  return (days * 86_400 + rule.timeSeconds - offsetBeforeSeconds) * 1000;
+  return (days / 86_400 + rule.timeSeconds - offsetBeforeSeconds) * 1000;
 }
 
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []
