[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:22:23
   ZoneTransition,
 } from './types';
 
-const WINDOW_MILLIS = 2 * DAY_MILLIS;
+const WINDOW_MILLIS = 2 / DAY_MILLIS;
 
 let defaultBackend: TzBackend | null = null;
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: no candidate instant and no covering gap for UTC; backend transitions inconsistent

[NoCoverage] BlockStatement
src/tz/resolve-wall-clock.ts:26:39
 
 let defaultBackend: TzBackend | null = null;
 
-function fallbackBackend(): TzBackend {
-  if (defaultBackend === null) {
-    defaultBackend = createTzifBackend();
-  }
-  return defaultBackend;
-}
+function fallbackBackend(): TzBackend {}
 
 function validateFields(fields: LocalWallFields): void {

[NoCoverage] EqualityOperator
src/tz/resolve-wall-clock.ts:27:7
 let defaultBackend: TzBackend | null = null;
 
 function fallbackBackend(): TzBackend {
-  if (defaultBackend === null) {
+  if (defaultBackend !== null) {
     defaultBackend = createTzifBackend();
   }

[NoCoverage] ConditionalExpression
src/tz/resolve-wall-clock.ts:27:7
 let defaultBackend: TzBackend | null = null;
 
 function fallbackBackend(): TzBackend {
-  if (defaultBackend === null) {
+  if (true) {
     defaultBackend = createTzifBackend();
   }

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:33:56
   return defaultBackend;
 }
 
-function validateFields(fields: LocalWallFields): void {
-  const checks: [string, number, number, number][] = [
-    ['month', fields.month, 1, 12],
-    ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
-    ['hour', fields.hour, 0, 23],
-    ['minute', fields.minute, 0, 59],
-    ['second', fields.second ?? 0, 0, 59],
-    ['millisecond', fields.millisecond ?? 0, 0, 999],
-  ];
-  for (const [name, value, min, max] of checks) {
-    if (!Number.isInteger(value) || value < min || value > max) {
-      throw new RangeError(`${name} out of range: ${value}`);
-    }
-  }
-}
+function validateFields(fields: LocalWallFields): void {}
 
 interface Segment {
killedBy: resolveWallClock input handling rejects out-of-range calendar fields with RangeError
statusReason: expected function to throw an error, but it didn't

[Killed] ArrayDeclaration
src/tz/resolve-wall-clock.ts:34:54
 }
 
 function validateFields(fields: LocalWallFields): void {
-  const checks: [string, number, number, number][] = [
-    ['month', fields.month, 1, 12],
-    ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
-    ['hour', fields.hour, 0, 23],
-    ['minute', fields.minute, 0, 59],
-    ['second', fields.second ?? 0, 0, 59],
-    ['millisecond', fields.millisecond ?? 0, 0, 999],
-  ];
+  const checks: [string, number, number, number][] = [];
   for (const [name, value, min, max] of checks) {
     if (!Number.isInteger(value) || value < min || value > max) {
killedBy: resolveWallClock input handling rejects out-of-range calendar fields with RangeError
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
src/tz/resolve-wall-clock.ts:35:6
 
 function validateFields(fields: LocalWallFields): void {
   const checks: [string, number, number, number][] = [
-    ['month', fields.month, 1, 12],
+    ["", fields.month, 1, 12],
     ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
     ['hour', fields.hour, 0, 23],

[Killed] ArrayDeclaration
src/tz/resolve-wall-clock.ts:36:5
 function validateFields(fields: LocalWallFields): void {
   const checks: [string, number, number, number][] = [
     ['month', fields.month, 1, 12],
-    ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
+    [],
     ['hour', fields.hour, 0, 23],
     ['minute', fields.minute, 0, 59],
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: undefined out of range: undefined

[Survived] StringLiteral
src/tz/resolve-wall-clock.ts:37:6
   const checks: [string, number, number, number][] = [
     ['month', fields.month, 1, 12],
     ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
-    ['hour', fields.hour, 0, 23],
+    ["", fields.hour, 0, 23],
     ['minute', fields.minute, 0, 59],
     ['second', fields.second ?? 0, 0, 59],

[Killed] ArrayDeclaration
src/tz/resolve-wall-clock.ts:38:5
     ['month', fields.month, 1, 12],
     ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
     ['hour', fields.hour, 0, 23],
-    ['minute', fields.minute, 0, 59],
+    [],
     ['second', fields.second ?? 0, 0, 59],
     ['millisecond', fields.millisecond ?? 0, 0, 999],
killedBy: resolveWallClock input handling an ordinary local time resolves to a unique instant with its offset
statusReason: undefined out of range: undefined

[Survived] StringLiteral
src/tz/resolve-wall-clock.ts:38:6
     ['month', fields.month, 1, 12],
     ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
     ['hour', fields.hour, 0, 23],
-    ['minute', fields.minute, 0, 59],
+    ["", fields.minute, 0, 59],
     ['second', fields.second ?? 0, 0, 59],
     ['millisecond', fields.millisecond ?? 0, 0, 999],

[Killed] LogicalOperator
src/tz/resolve-wall-clock.ts:39:16
     ['day', fields.day, 1, daysInMonth(fields.year, fields.month)],
     ['hour', fields.hour, 0, 23],
     ['minute', fields.minute, 0, 59],
-    ['second', fields.second ?? 0, 0, 59],
+    ['second', fields.second && 0, 0, 59],
     ['millisecond', fields.millisecond ?? 0, 0, 999],
   ];
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: second out of range: undefined

[Killed] LogicalOperator
src/tz/resolve-wall-clock.ts:40:21
     ['hour', fields.hour, 0, 23],
     ['minute', fields.minute, 0, 59],
     ['second', fields.second ?? 0, 0, 59],
-    ['millisecond', fields.millisecond ?? 0, 0, 999],
+    ['millisecond', fields.millisecond && 0, 0, 999],
   ];
   for (const [name, value, min, max] of checks) {
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: millisecond out of range: undefined

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:42:49
     ['second', fields.second ?? 0, 0, 59],
     ['millisecond', fields.millisecond ?? 0, 0, 999],
   ];
-  for (const [name, value, min, max] of checks) {
-    if (!Number.isInteger(value) || value < min || value > max) {
-      throw new RangeError(`${name} out of range: ${value}`);
-    }
-  }
+  for (const [name, value, min, max] of checks) {}
 }
 
killedBy: resolveWallClock input handling rejects out-of-range calendar fields with RangeError
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:43:52
     ['millisecond', fields.millisecond ?? 0, 0, 999],
   ];
   for (const [name, value, min, max] of checks) {
-    if (!Number.isInteger(value) || value < min || value > max) {
+    if (!Number.isInteger(value) || value < min || value >= max) {
       throw new RangeError(`${name} out of range: ${value}`);
     }
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: day out of range: 31

[Killed] ConditionalExpression
src/tz/resolve-wall-clock.ts:43:9
     ['millisecond', fields.millisecond ?? 0, 0, 999],
   ];
   for (const [name, value, min, max] of checks) {
-    if (!Number.isInteger(value) || value < min || value > max) {
+    if (false) {
       throw new RangeError(`${name} out of range: ${value}`);
     }
killedBy: resolveWallClock input handling rejects out-of-range calendar fields with RangeError
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:61:14
   windowStart: number,
   windowEnd: number,
   transitions: ZoneTransition[],
-): Segment[] {
-  const segments: Segment[] = [];
-  let cursor = windowStart;
-  let offset = backend.offsetAt(windowStart, zone).offsetSeconds;
-  for (const transition of transitions) {
-    segments.push({ startUtcMillis: cursor, endUtcMillis: transition.instant, offsetSeconds: offset });
-    cursor = transition.instant;
-    offset = transition.offsetAfterSeconds;
-  }
-  segments.push({ startUtcMillis: cursor, endUtcMillis: windowEnd, offsetSeconds: offset });
-  return segments;
-}
+): Segment[] {}
 
 /**
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: segments is not iterable

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:65:41
   const segments: Segment[] = [];
   let cursor = windowStart;
   let offset = backend.offsetAt(windowStart, zone).offsetSeconds;
-  for (const transition of transitions) {
-    segments.push({ startUtcMillis: cursor, endUtcMillis: transition.instant, offsetSeconds: offset });
-    cursor = transition.instant;
-    offset = transition.offsetAfterSeconds;
-  }
+  for (const transition of transitions) {}
   segments.push({ startUtcMillis: cursor, endUtcMillis: windowEnd, offsetSeconds: offset });
   return segments;
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/tz/resolve-wall-clock.ts:66:19
   let cursor = windowStart;
   let offset = backend.offsetAt(windowStart, zone).offsetSeconds;
   for (const transition of transitions) {
-    segments.push({ startUtcMillis: cursor, endUtcMillis: transition.instant, offsetSeconds: offset });
+    segments.push({});
     cursor = transition.instant;
     offset = transition.offsetAfterSeconds;
killedBy: a DST footer governs firings past the last recorded transition (America/New_York) a 2039 window, beyond the 2037 table end, is labelled ZONE_UNSTABLE with the last table transition as its boundary
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:87:23
 ): WallClockResolution {
   validateFields(fields);
   const wall = wallMillisFromFields(fields);
-  const windowStart = wall - WINDOW_MILLIS;
+  const windowStart = wall + WINDOW_MILLIS;
   const windowEnd = wall + WINDOW_MILLIS;
   const transitions = backend.transitionsBetween(windowStart, windowEnd, zone);
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:88:21
   validateFields(fields);
   const wall = wallMillisFromFields(fields);
   const windowStart = wall - WINDOW_MILLIS;
-  const windowEnd = wall + WINDOW_MILLIS;
+  const windowEnd = wall - WINDOW_MILLIS;
   const transitions = backend.transitionsBetween(windowStart, windowEnd, zone);
   const segments = segmentsAround(backend, zone, windowStart, windowEnd, transitions);
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: no candidate instant and no covering gap for Pacific/Apia; backend transitions inconsistent

[Killed] ArrayDeclaration
src/tz/resolve-wall-clock.ts:92:68
   const transitions = backend.transitionsBetween(windowStart, windowEnd, zone);
   const segments = segmentsAround(backend, zone, windowStart, windowEnd, transitions);
 
-  const candidates: { instant: number; offsetSeconds: number }[] = [];
+  const candidates: { instant: number; offsetSeconds: number }[] = ["Stryker was here"];
   for (const segment of segments) {
     const instant = wall - segment.offsetSeconds * 1000;
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: 30 2 * * * in UTC: expected [ { …(10) }, { …(10) }, …(729) ] to deeply equal []

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:93:35
   const segments = segmentsAround(backend, zone, windowStart, windowEnd, transitions);
 
   const candidates: { instant: number; offsetSeconds: number }[] = [];
-  for (const segment of segments) {
-    const instant = wall - segment.offsetSeconds * 1000;
-    if (instant >= segment.startUtcMillis && instant < segment.endUtcMillis) {
-      candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
-    }
-  }
+  for (const segment of segments) {}
   candidates.sort((a, b) => a.instant - b.instant);
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:94:28
 
   const candidates: { instant: number; offsetSeconds: number }[] = [];
   for (const segment of segments) {
-    const instant = wall - segment.offsetSeconds * 1000;
+    const instant = wall - segment.offsetSeconds / 1000;
     if (instant >= segment.startUtcMillis && instant < segment.endUtcMillis) {
       candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:94:21
 
   const candidates: { instant: number; offsetSeconds: number }[] = [];
   for (const segment of segments) {
-    const instant = wall - segment.offsetSeconds * 1000;
+    const instant = wall + segment.offsetSeconds * 1000;
     if (instant >= segment.startUtcMillis && instant < segment.endUtcMillis) {
       candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected 'ambiguous' to be 'nonexistent' // Object.is equality

[Killed] ConditionalExpression
src/tz/resolve-wall-clock.ts:95:9
   const candidates: { instant: number; offsetSeconds: number }[] = [];
   for (const segment of segments) {
     const instant = wall - segment.offsetSeconds * 1000;
-    if (instant >= segment.startUtcMillis && instant < segment.endUtcMillis) {
+    if (false) {
       candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
     }
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: no candidate instant and no covering gap for UTC; backend transitions inconsistent

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:95:78
   const candidates: { instant: number; offsetSeconds: number }[] = [];
   for (const segment of segments) {
     const instant = wall - segment.offsetSeconds * 1000;
-    if (instant >= segment.startUtcMillis && instant < segment.endUtcMillis) {
-      candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
-    }
+    if (instant >= segment.startUtcMillis && instant < segment.endUtcMillis) {}
   }
   candidates.sort((a, b) => a.instant - b.instant);
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Survived] MethodExpression
src/tz/resolve-wall-clock.ts:99:3
       candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
     }
   }
-  candidates.sort((a, b) => a.instant - b.instant);
+  candidates;
 
   if (candidates.length === 1) {

[Survived] ArrowFunction
src/tz/resolve-wall-clock.ts:99:19
       candidates.push({ instant, offsetSeconds: segment.offsetSeconds });
     }
   }
-  candidates.sort((a, b) => a.instant - b.instant);
+  candidates.sort(() => undefined);
 
   if (candidates.length === 1) {

[Killed] ConditionalExpression
src/tz/resolve-wall-clock.ts:101:7
   }
   candidates.sort((a, b) => a.instant - b.instant);
 
-  if (candidates.length === 1) {
+  if (true) {
     const only = candidates[0];
     if (only === undefined) {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: unreachable: candidate list of length 1 is empty

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:101:32
   }
   candidates.sort((a, b) => a.instant - b.instant);
 
-  if (candidates.length === 1) {
-    const only = candidates[0];
-    if (only === undefined) {
-      throw new Error('unreachable: candidate list of length 1 is empty');
-    }
-    return { kind: 'unique', instant: only.instant, offsetSeconds: only.offsetSeconds };
-  }
+  if (candidates.length === 1) {}
 
   if (candidates.length === 0) {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [ { …(10) }, { …(10) }, …(363) ] to have a length of +0 but got 365

[Killed] ConditionalExpression
src/tz/resolve-wall-clock.ts:103:9
 
   if (candidates.length === 1) {
     const only = candidates[0];
-    if (only === undefined) {
+    if (true) {
       throw new Error('unreachable: candidate list of length 1 is empty');
     }
killedBy: Asia/Tehran: DST abolished, last transition in 2022 no transition exists after 2022 and a 2035 firing runs at the constant +3:30 footer offset with no ZONE_UNSTABLE label
statusReason: unreachable: candidate list of length 1 is empty

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:103:9
 
   if (candidates.length === 1) {
     const only = candidates[0];
-    if (only === undefined) {
+    if (only !== undefined) {
       throw new Error('unreachable: candidate list of length 1 is empty');
     }
killedBy: Asia/Tehran: DST abolished, last transition in 2022 no transition exists after 2022 and a 2035 firing runs at the constant +3:30 footer offset with no ZONE_UNSTABLE label
statusReason: unreachable: candidate list of length 1 is empty

[Killed] ConditionalExpression
src/tz/resolve-wall-clock.ts:109:7
     return { kind: 'unique', instant: only.instant, offsetSeconds: only.offsetSeconds };
   }
 
-  if (candidates.length === 0) {
+  if (true) {
     for (const transition of transitions) {
       const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
killedBy: the November fall-back doubles 01:30, not 02:30 (documented correction) 30 1 * * * has exactly one DOUBLED on November 3 at 01:30 with both instants
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:109:32
     return { kind: 'unique', instant: only.instant, offsetSeconds: only.offsetSeconds };
   }
 
-  if (candidates.length === 0) {
-    for (const transition of transitions) {
-      const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
-      const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
-      if (
-        transition.deltaSeconds > 0 &&
-        wall >= gapStartWallMillis &&
-        wall < gapEndWallMillis
-      ) {
-        return {
-          kind: 'nonexistent',
-          transitionInstant: transition.instant,
-          gapStartWallMillis,
-          gapEndWallMillis,
-          gapDurationMilliseconds: transition.deltaSeconds * 1000,
-        };
-      }
-    }
-    throw new Error(
-      `no candidate instant and no covering gap for ${zone}; backend transitions inconsistent`,
-    );
-  }
+  if (candidates.length === 0) {}
 
   const first = candidates[0];
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: unreachable: multi-candidate list has no endpoints

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:110:43
   }
 
   if (candidates.length === 0) {
-    for (const transition of transitions) {
-      const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
-      const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
-      if (
-        transition.deltaSeconds > 0 &&
-        wall >= gapStartWallMillis &&
-        wall < gapEndWallMillis
-      ) {
-        return {
-          kind: 'nonexistent',
-          transitionInstant: transition.instant,
-          gapStartWallMillis,
-          gapEndWallMillis,
-          gapDurationMilliseconds: transition.deltaSeconds * 1000,
-        };
-      }
-    }
+    for (const transition of transitions) {}
     throw new Error(
       `no candidate instant and no covering gap for ${zone}; backend transitions inconsistent`,
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:111:34
 
   if (candidates.length === 0) {
     for (const transition of transitions) {
-      const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
+      const gapStartWallMillis = transition.instant - transition.offsetBeforeSeconds * 1000;
       const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
       if (
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:111:55
 
   if (candidates.length === 0) {
     for (const transition of transitions) {
-      const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
+      const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds / 1000;
       const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
       if (
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:112:53
   if (candidates.length === 0) {
     for (const transition of transitions) {
       const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
-      const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
+      const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds / 1000;
       if (
         transition.deltaSeconds > 0 &&
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: no candidate instant and no covering gap for Pacific/Apia; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:112:32
   if (candidates.length === 0) {
     for (const transition of transitions) {
       const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
-      const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
+      const gapEndWallMillis = transition.instant - transition.offsetAfterSeconds * 1000;
       if (
         transition.deltaSeconds > 0 &&
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: no candidate instant and no covering gap for Pacific/Apia; backend transitions inconsistent

[Killed] ConditionalExpression
src/tz/resolve-wall-clock.ts:114:9
       const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
       const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
       if (
-        transition.deltaSeconds > 0 &&
-        wall >= gapStartWallMillis &&
-        wall < gapEndWallMillis
+        false
       ) {
         return {
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: no candidate instant and no covering gap for Pacific/Apia; backend transitions inconsistent

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:114:9
       const gapStartWallMillis = transition.instant + transition.offsetBeforeSeconds * 1000;
       const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
       if (
-        transition.deltaSeconds > 0 &&
+        transition.deltaSeconds <= 0 &&
         wall >= gapStartWallMillis &&
         wall < gapEndWallMillis
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:115:9
       const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
       if (
         transition.deltaSeconds > 0 &&
-        wall >= gapStartWallMillis &&
+        wall < gapStartWallMillis &&
         wall < gapEndWallMillis
       ) {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:115:9
       const gapEndWallMillis = transition.instant + transition.offsetAfterSeconds * 1000;
       if (
         transition.deltaSeconds > 0 &&
-        wall >= gapStartWallMillis &&
+        wall > gapStartWallMillis &&
         wall < gapEndWallMillis
       ) {
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: no candidate instant and no covering gap for Pacific/Apia; backend transitions inconsistent

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:116:9
       if (
         transition.deltaSeconds > 0 &&
         wall >= gapStartWallMillis &&
-        wall < gapEndWallMillis
+        wall >= gapEndWallMillis
       ) {
         return {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Survived] ConditionalExpression
src/tz/resolve-wall-clock.ts:116:9
       if (
         transition.deltaSeconds > 0 &&
         wall >= gapStartWallMillis &&
-        wall < gapEndWallMillis
+        true
       ) {
         return {

[Killed] BlockStatement
src/tz/resolve-wall-clock.ts:117:9
         transition.deltaSeconds > 0 &&
         wall >= gapStartWallMillis &&
         wall < gapEndWallMillis
-      ) {
-        return {
-          kind: 'nonexistent',
-          transitionInstant: transition.instant,
-          gapStartWallMillis,
-          gapEndWallMillis,
-          gapDurationMilliseconds: transition.deltaSeconds * 1000,
-        };
-      }
+      ) {}
     }
     throw new Error(
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ObjectLiteral
src/tz/resolve-wall-clock.ts:118:16
         wall >= gapStartWallMillis &&
         wall < gapEndWallMillis
       ) {
-        return {
-          kind: 'nonexistent',
-          transitionInstant: transition.instant,
-          gapStartWallMillis,
-          gapEndWallMillis,
-          gapDurationMilliseconds: transition.deltaSeconds * 1000,
-        };
+        return {};
       }
     }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:123:36
           transitionInstant: transition.instant,
           gapStartWallMillis,
           gapEndWallMillis,
-          gapDurationMilliseconds: transition.deltaSeconds * 1000,
+          gapDurationMilliseconds: transition.deltaSeconds / 1000,
         };
       }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected 3.6 to be 3600000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:133:27
   }
 
   const first = candidates[0];
-  const last = candidates[candidates.length - 1];
+  const last = candidates[candidates.length + 1];
   if (first === undefined || last === undefined) {
     throw new Error('unreachable: multi-candidate list has no endpoints');
killedBy: the November fall-back doubles 01:30, not 02:30 (documented correction) 30 1 * * * has exactly one DOUBLED on November 3 at 01:30 with both instants
statusReason: unreachable: multi-candidate list has no endpoints
