[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:134:7
 
   const first = candidates[0];
   const last = candidates[candidates.length - 1];
-  if (first === undefined || last === undefined) {
+  if (first !== undefined || last === undefined) {
     throw new Error('unreachable: multi-candidate list has no endpoints');
   }
killedBy: the November fall-back doubles 01:30, not 02:30 (documented correction) 30 1 * * * has exactly one DOUBLED on November 3 at 01:30 with both instants
statusReason: unreachable: multi-candidate list has no endpoints

[Killed] EqualityOperator
src/tz/resolve-wall-clock.ts:134:30
 
   const first = candidates[0];
   const last = candidates[candidates.length - 1];
-  if (first === undefined || last === undefined) {
+  if (first === undefined || last !== undefined) {
     throw new Error('unreachable: multi-candidate list has no endpoints');
   }
killedBy: severity model the idempotence flag flips a real doubled hazard from critical to low without changing anything else
statusReason: unreachable: multi-candidate list has no endpoints

[Killed] ArrowFunction
src/tz/resolve-wall-clock.ts:139:39
   }
   return {
     kind: 'ambiguous',
-    candidateInstants: candidates.map((c) => c.instant),
+    candidateInstants: candidates.map(() => undefined),
     earlierInstant: first.instant,
     laterInstant: last.instant,
killedBy: tzif backend 2024-11-03T01:30 America/New_York is ambiguous with a one-hour fold
statusReason: expected [ undefined, undefined ] to deeply equal [ 1730611800000, 1730615400000 ]

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:142:31
     candidateInstants: candidates.map((c) => c.instant),
     earlierInstant: first.instant,
     laterInstant: last.instant,
-    foldDurationMilliseconds: (first.offsetSeconds - last.offsetSeconds) * 1000,
+    foldDurationMilliseconds: (first.offsetSeconds - last.offsetSeconds) / 1000,
   };
 }
killedBy: the November fall-back doubles 01:30, not 02:30 (documented correction) 30 1 * * * has exactly one DOUBLED on November 3 at 01:30 with both instants
statusReason: expected 3.6 to be 3600000 // Object.is equality

[Killed] ArithmeticOperator
src/tz/resolve-wall-clock.ts:142:32
     candidateInstants: candidates.map((c) => c.instant),
     earlierInstant: first.instant,
     laterInstant: last.instant,
-    foldDurationMilliseconds: (first.offsetSeconds - last.offsetSeconds) * 1000,
+    foldDurationMilliseconds: (first.offsetSeconds + last.offsetSeconds) * 1000,
   };
 }
killedBy: the November fall-back doubles 01:30, not 02:30 (documented correction) 30 1 * * * has exactly one DOUBLED on November 3 at 01:30 with both instants
statusReason: expected -32400000 to be 3600000 // Object.is equality
