[Killed] BlockStatement
src/tz/tzif-backend.ts:39:47
   toDst: boolean;
 }
 
-function typeInfo(type: TzifType): OffsetInfo {
-  return {
-    offsetSeconds: type.offsetSeconds,
-    abbreviation: type.abbreviation,
-    isDst: type.isDst,
-  };
-}
+function typeInfo(type: TzifType): OffsetInfo {}
 
 /** Index of the last transition at or before t, or -1. */
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a constant-offset zone past its last transition is not labeled unstable (extrapolation is exact)
statusReason: Cannot read properties of undefined (reading 'offsetSeconds')

[Killed] BlockStatement
src/tz/tzif-backend.ts:48:72
 }
 
 /** Index of the last transition at or before t, or -1. */
-function lastTransitionIndex(transitions: number[], t: number): number {
-  let lo = 0;
-  let hi = transitions.length - 1;
-  let found = -1;
-  while (lo <= hi) {
-    const mid = (lo + hi) >> 1;
-    if ((transitions[mid] ?? Infinity) <= t) {
-      found = mid;
-      lo = mid + 1;
-    } else {
-      hi = mid - 1;
-    }
-  }
-  return found;
-}
+function lastTransitionIndex(transitions: number[], t: number): number {}
 
 function utcYearOf(millis: number): number {
killedBy: severity model the idempotence flag flips a real doubled hazard from critical to low without changing anything else
statusReason: expected undefined to be 'critical' // Object.is equality

[Survived] ArithmeticOperator
src/tz/tzif-backend.ts:50:12
 /** Index of the last transition at or before t, or -1. */
 function lastTransitionIndex(transitions: number[], t: number): number {
   let lo = 0;
-  let hi = transitions.length - 1;
+  let hi = transitions.length + 1;
   let found = -1;
   while (lo <= hi) {

[Survived] UnaryOperator
src/tz/tzif-backend.ts:51:15
 function lastTransitionIndex(transitions: number[], t: number): number {
   let lo = 0;
   let hi = transitions.length - 1;
-  let found = -1;
+  let found = +1;
   while (lo <= hi) {
     const mid = (lo + hi) >> 1;

[Killed] EqualityOperator
src/tz/tzif-backend.ts:52:10
   let lo = 0;
   let hi = transitions.length - 1;
   let found = -1;
-  while (lo <= hi) {
+  while (lo > hi) {
     const mid = (lo + hi) >> 1;
     if ((transitions[mid] ?? Infinity) <= t) {
killedBy: tzif backend 2024-11-03T01:30 America/New_York is ambiguous with a one-hour fold
statusReason: expected 'unique' to be 'ambiguous' // Object.is equality

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:52:10
   let lo = 0;
   let hi = transitions.length - 1;
   let found = -1;
-  while (lo <= hi) {
+  while (false) {
     const mid = (lo + hi) >> 1;
     if ((transitions[mid] ?? Infinity) <= t) {
killedBy: tzif backend 2024-11-03T01:30 America/New_York is ambiguous with a one-hour fold
statusReason: expected 'unique' to be 'ambiguous' // Object.is equality

[Killed] ArithmeticOperator
src/tz/tzif-backend.ts:53:18
   let hi = transitions.length - 1;
   let found = -1;
   while (lo <= hi) {
-    const mid = (lo + hi) >> 1;
+    const mid = (lo - hi) >> 1;
     if ((transitions[mid] ?? Infinity) <= t) {
       found = mid;
killedBy: tzif backend 2024-11-03T01:30 America/New_York is ambiguous with a one-hour fold
statusReason: expected 'unique' to be 'ambiguous' // Object.is equality

[Killed] EqualityOperator
src/tz/tzif-backend.ts:54:9
   let found = -1;
   while (lo <= hi) {
     const mid = (lo + hi) >> 1;
-    if ((transitions[mid] ?? Infinity) <= t) {
+    if ((transitions[mid] ?? Infinity) > t) {
       found = mid;
       lo = mid + 1;
killedBy: severity model the idempotence flag flips a real doubled hazard from critical to low without changing anything else
statusReason: expected undefined to be 'critical' // Object.is equality

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:54:9
   let found = -1;
   while (lo <= hi) {
     const mid = (lo + hi) >> 1;
-    if ((transitions[mid] ?? Infinity) <= t) {
+    if (true) {
       found = mid;
       lo = mid + 1;
killedBy: tzif backend 2024-11-03T01:30 America/New_York is ambiguous with a one-hour fold
statusReason: expected 'unique' to be 'ambiguous' // Object.is equality

[Timeout] ArithmeticOperator
src/tz/tzif-backend.ts:56:12
     const mid = (lo + hi) >> 1;
     if ((transitions[mid] ?? Infinity) <= t) {
       found = mid;
-      lo = mid + 1;
+      lo = mid - 1;
     } else {
       hi = mid - 1;

[Timeout] BlockStatement
src/tz/tzif-backend.ts:57:12
     if ((transitions[mid] ?? Infinity) <= t) {
       found = mid;
       lo = mid + 1;
-    } else {
-      hi = mid - 1;
-    }
+    } else {}
   }
   return found;

[Timeout] ArithmeticOperator
src/tz/tzif-backend.ts:58:12
       found = mid;
       lo = mid + 1;
     } else {
-      hi = mid - 1;
+      hi = mid + 1;
     }
   }

[Killed] BlockStatement
src/tz/tzif-backend.ts:64:44
   return found;
 }
 
-function utcYearOf(millis: number): number {
-  return civilFromDays(Math.floor(millis / DAY_MILLIS)).year;
-}
+function utcYearOf(millis: number): number {}
 
 /**
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Timeout] ArithmeticOperator
src/tz/tzif-backend.ts:65:35
 }
 
 function utcYearOf(millis: number): number {
-  return civilFromDays(Math.floor(millis / DAY_MILLIS)).year;
+  return civilFromDays(Math.floor(millis * DAY_MILLIS)).year;
 }
 

[Killed] BlockStatement
src/tz/tzif-backend.ts:72:88
  * DST start and end instants derived from the footer for the years
  * [fromYear, toYear], sorted ascending.
  */
-function footerEvents(posix: PosixTz, fromYear: number, toYear: number): FooterEvent[] {
-  if (
-    posix.dstStart === null ||
-    posix.dstEnd === null ||
-    posix.dstOffsetSeconds === null
-  ) {
-    return [];
-  }
-  const events: FooterEvent[] = [];
-  for (let year = fromYear; year <= toYear; year += 1) {
-    events.push({
-      instant: ruleInstantUtcMillis(posix.dstStart, year, posix.stdOffsetSeconds),
-      toDst: true,
-    });
-    events.push({
-      instant: ruleInstantUtcMillis(posix.dstEnd, year, posix.dstOffsetSeconds),
-      toDst: false,
-    });
-  }
-  return events.sort((a, b) => a.instant - b.instant);
-}
+function footerEvents(posix: PosixTz, fromYear: number, toYear: number): FooterEvent[] {}
 
 function footerOffsetInfo(posix: PosixTz, t: number): OffsetInfo {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: footerEvents is not a function or its return value is not iterable

[Killed] EqualityOperator
src/tz/tzif-backend.ts:74:5
  */
 function footerEvents(posix: PosixTz, fromYear: number, toYear: number): FooterEvent[] {
   if (
-    posix.dstStart === null ||
+    posix.dstStart !== null ||
     posix.dstEnd === null ||
     posix.dstOffsetSeconds === null
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:74:5
  */
 function footerEvents(posix: PosixTz, fromYear: number, toYear: number): FooterEvent[] {
   if (
-    posix.dstStart === null ||
-    posix.dstEnd === null ||
-    posix.dstOffsetSeconds === null
+    false
   ) {
     return [];
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of null (reading 'day')

[Killed] EqualityOperator
src/tz/tzif-backend.ts:75:5
 function footerEvents(posix: PosixTz, fromYear: number, toYear: number): FooterEvent[] {
   if (
     posix.dstStart === null ||
-    posix.dstEnd === null ||
+    posix.dstEnd !== null ||
     posix.dstOffsetSeconds === null
   ) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Survived] ConditionalExpression
src/tz/tzif-backend.ts:75:5
 function footerEvents(posix: PosixTz, fromYear: number, toYear: number): FooterEvent[] {
   if (
     posix.dstStart === null ||
-    posix.dstEnd === null ||
+    false ||
     posix.dstOffsetSeconds === null
   ) {

[Killed] EqualityOperator
src/tz/tzif-backend.ts:76:5
   if (
     posix.dstStart === null ||
     posix.dstEnd === null ||
-    posix.dstOffsetSeconds === null
+    posix.dstOffsetSeconds !== null
   ) {
     return [];
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Survived] ConditionalExpression
src/tz/tzif-backend.ts:76:5
   if (
     posix.dstStart === null ||
     posix.dstEnd === null ||
-    posix.dstOffsetSeconds === null
+    false
   ) {
     return [];

[Killed] BlockStatement
src/tz/tzif-backend.ts:77:5
     posix.dstStart === null ||
     posix.dstEnd === null ||
     posix.dstOffsetSeconds === null
-  ) {
-    return [];
-  }
+  ) {}
   const events: FooterEvent[] = [];
   for (let year = fromYear; year <= toYear; year += 1) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of null (reading 'day')

[Survived] ArrayDeclaration
src/tz/tzif-backend.ts:78:12
     posix.dstEnd === null ||
     posix.dstOffsetSeconds === null
   ) {
-    return [];
+    return ["Stryker was here"];
   }
   const events: FooterEvent[] = [];

[Killed] BlockStatement
src/tz/tzif-backend.ts:81:56
     return [];
   }
   const events: FooterEvent[] = [];
-  for (let year = fromYear; year <= toYear; year += 1) {
-    events.push({
-      instant: ruleInstantUtcMillis(posix.dstStart, year, posix.stdOffsetSeconds),
-      toDst: true,
-    });
-    events.push({
-      instant: ruleInstantUtcMillis(posix.dstEnd, year, posix.dstOffsetSeconds),
-      toDst: false,
-    });
-  }
+  for (let year = fromYear; year <= toYear; year += 1) {}
   return events.sort((a, b) => a.instant - b.instant);
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/tzif-backend.ts:81:29
     return [];
   }
   const events: FooterEvent[] = [];
-  for (let year = fromYear; year <= toYear; year += 1) {
+  for (let year = fromYear; year > toYear; year += 1) {
     events.push({
       instant: ruleInstantUtcMillis(posix.dstStart, year, posix.stdOffsetSeconds),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ObjectLiteral
src/tz/tzif-backend.ts:82:17
   }
   const events: FooterEvent[] = [];
   for (let year = fromYear; year <= toYear; year += 1) {
-    events.push({
-      instant: ruleInstantUtcMillis(posix.dstStart, year, posix.stdOffsetSeconds),
-      toDst: true,
-    });
+    events.push({});
     events.push({
       instant: ruleInstantUtcMillis(posix.dstEnd, year, posix.dstOffsetSeconds),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Invalid time value

[Killed] BooleanLiteral
src/tz/tzif-backend.ts:84:14
   for (let year = fromYear; year <= toYear; year += 1) {
     events.push({
       instant: ruleInstantUtcMillis(posix.dstStart, year, posix.stdOffsetSeconds),
-      toDst: true,
+      toDst: false,
     });
     events.push({
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(24) ] to deeply equal []

[Killed] BooleanLiteral
src/tz/tzif-backend.ts:88:14
     });
     events.push({
       instant: ruleInstantUtcMillis(posix.dstEnd, year, posix.dstOffsetSeconds),
-      toDst: false,
+      toDst: true,
     });
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(24) ] to deeply equal []

[Survived] ArrowFunction
src/tz/tzif-backend.ts:91:22
       toDst: false,
     });
   }
-  return events.sort((a, b) => a.instant - b.instant);
+  return events.sort(() => undefined);
 }
 

[Survived] ArithmeticOperator
src/tz/tzif-backend.ts:91:32
       toDst: false,
     });
   }
-  return events.sort((a, b) => a.instant - b.instant);
+  return events.sort((a, b) => a.instant + b.instant);
 }
 

[Killed] ObjectLiteral
src/tz/tzif-backend.ts:95:27
 }
 
 function footerOffsetInfo(posix: PosixTz, t: number): OffsetInfo {
-  const std: OffsetInfo = {
-    offsetSeconds: posix.stdOffsetSeconds,
-    abbreviation: posix.stdAbbreviation,
-    isDst: false,
-  };
+  const std: OffsetInfo = {};
   if (posix.dstAbbreviation === null || posix.dstOffsetSeconds === null) {
     return std;
killedBy: Asia/Kolkata: a half-hour offset, no DST, its last transition deep in the past the offset is a constant +5:30 with zero transitions in the modern era, so the POSIX footer governs every current firing
statusReason: expected undefined to be 19800 // Object.is equality

[Survived] BooleanLiteral
src/tz/tzif-backend.ts:98:12
   const std: OffsetInfo = {
     offsetSeconds: posix.stdOffsetSeconds,
     abbreviation: posix.stdAbbreviation,
-    isDst: false,
+    isDst: true,
   };
   if (posix.dstAbbreviation === null || posix.dstOffsetSeconds === null) {

[Survived] EqualityOperator
src/tz/tzif-backend.ts:100:7
     abbreviation: posix.stdAbbreviation,
     isDst: false,
   };
-  if (posix.dstAbbreviation === null || posix.dstOffsetSeconds === null) {
+  if (posix.dstAbbreviation !== null || posix.dstOffsetSeconds === null) {
     return std;
   }

[Survived] BlockStatement
src/tz/tzif-backend.ts:100:74
     abbreviation: posix.stdAbbreviation,
     isDst: false,
   };
-  if (posix.dstAbbreviation === null || posix.dstOffsetSeconds === null) {
-    return std;
-  }
+  if (posix.dstAbbreviation === null || posix.dstOffsetSeconds === null) {}
   const dst: OffsetInfo = {
     offsetSeconds: posix.dstOffsetSeconds,

[Survived] BooleanLiteral
src/tz/tzif-backend.ts:106:12
   const dst: OffsetInfo = {
     offsetSeconds: posix.dstOffsetSeconds,
     abbreviation: posix.dstAbbreviation,
-    isDst: true,
+    isDst: false,
   };
   const year = utcYearOf(t);

[Survived] ArithmeticOperator
src/tz/tzif-backend.ts:109:38
     isDst: true,
   };
   const year = utcYearOf(t);
-  const events = footerEvents(posix, year - 1, year + 1);
+  const events = footerEvents(posix, year + 1, year + 1);
   let inDst: boolean | null = null;
   for (const event of events) {

[Survived] ArithmeticOperator
src/tz/tzif-backend.ts:109:48
     isDst: true,
   };
   const year = utcYearOf(t);
-  const events = footerEvents(posix, year - 1, year + 1);
+  const events = footerEvents(posix, year - 1, year - 1);
   let inDst: boolean | null = null;
   for (const event of events) {

[Survived] BlockStatement
src/tz/tzif-backend.ts:111:31
   const year = utcYearOf(t);
   const events = footerEvents(posix, year - 1, year + 1);
   let inDst: boolean | null = null;
-  for (const event of events) {
-    if (event.instant <= t) {
-      inDst = event.toDst;
-    }
-  }
+  for (const event of events) {}
   if (inDst === null) {
     const first = events[0];

[Survived] EqualityOperator
src/tz/tzif-backend.ts:112:9
   const events = footerEvents(posix, year - 1, year + 1);
   let inDst: boolean | null = null;
   for (const event of events) {
-    if (event.instant <= t) {
+    if (event.instant < t) {
       inDst = event.toDst;
     }

[Survived] BlockStatement
src/tz/tzif-backend.ts:112:29
   const events = footerEvents(posix, year - 1, year + 1);
   let inDst: boolean | null = null;
   for (const event of events) {
-    if (event.instant <= t) {
-      inDst = event.toDst;
-    }
+    if (event.instant <= t) {}
   }
   if (inDst === null) {

[Survived] ConditionalExpression
src/tz/tzif-backend.ts:116:7
       inDst = event.toDst;
     }
   }
-  if (inDst === null) {
+  if (true) {
     const first = events[0];
     inDst = first === undefined ? false : !first.toDst;

[Survived] ConditionalExpression
src/tz/tzif-backend.ts:116:7
       inDst = event.toDst;
     }
   }
-  if (inDst === null) {
+  if (false) {
     const first = events[0];
     inDst = first === undefined ? false : !first.toDst;

[NoCoverage] BooleanLiteral
src/tz/tzif-backend.ts:118:35
   }
   if (inDst === null) {
     const first = events[0];
-    inDst = first === undefined ? false : !first.toDst;
+    inDst = first === undefined ? true : !first.toDst;
   }
   return inDst ? dst : std;

[NoCoverage] BooleanLiteral
src/tz/tzif-backend.ts:118:43
   }
   if (inDst === null) {
     const first = events[0];
-    inDst = first === undefined ? false : !first.toDst;
+    inDst = first === undefined ? false : first.toDst;
   }
   return inDst ? dst : std;

[Killed] BlockStatement
src/tz/tzif-backend.ts:131:46
   const root = resolveZoneinfoRoot(options.zoneinfoRoot);
   const cache = new Map<string, ZoneRecord>();
 
-  const load = (zone: string): ZoneRecord => {
-    const cached = cache.get(zone);
-    if (cached !== undefined) {
-      return cached;
-    }
-    const data = parseTzif(readZoneFile(root, zone));
-    const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
-    const record: ZoneRecord = { data, posix };
-    cache.set(zone, record);
-    return record;
-  };
+  const load = (zone: string): ZoneRecord => {};
 
   const typeAtIndex = (data: TzifData, transitionIndex: number): TzifType => {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: Cannot destructure property 'data' of 'load(...)' as it is undefined.

[Killed] EqualityOperator
src/tz/tzif-backend.ts:133:9
 
   const load = (zone: string): ZoneRecord => {
     const cached = cache.get(zone);
-    if (cached !== undefined) {
+    if (cached === undefined) {
       return cached;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot destructure property 'data' of 'load(...)' as it is undefined.

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:133:9
 
   const load = (zone: string): ZoneRecord => {
     const cached = cache.get(zone);
-    if (cached !== undefined) {
+    if (true) {
       return cached;
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot destructure property 'data' of 'load(...)' as it is undefined.

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:137:19
       return cached;
     }
     const data = parseTzif(readZoneFile(root, zone));
-    const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
+    const posix = true ? null : parsePosixTz(data.posixTzString);
     const record: ZoneRecord = { data, posix };
     cache.set(zone, record);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/tzif-backend.ts:137:19
       return cached;
     }
     const data = parseTzif(readZoneFile(root, zone));
-    const posix = data.posixTzString === null ? null : parsePosixTz(data.posixTzString);
+    const posix = data.posixTzString !== null ? null : parsePosixTz(data.posixTzString);
     const record: ZoneRecord = { data, posix };
     cache.set(zone, record);
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] BlockStatement
src/tz/tzif-backend.ts:143:78
     return record;
   };
 
-  const typeAtIndex = (data: TzifData, transitionIndex: number): TzifType => {
-    const typeIndex =
-      transitionIndex === -1
-        ? data.firstTypeIndex
-        : (data.transitionTypes[transitionIndex] ?? data.firstTypeIndex);
-    const type = data.types[typeIndex];
-    if (type === undefined) {
-      throw new Error(`TZif type index ${typeIndex} out of range`);
-    }
-    return type;
-  };
+  const typeAtIndex = (data: TzifData, transitionIndex: number): TzifType => {};
 
   const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'offsetSeconds')

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:145:7
 
   const typeAtIndex = (data: TzifData, transitionIndex: number): TzifType => {
     const typeIndex =
-      transitionIndex === -1
+      true
         ? data.firstTypeIndex
         : (data.transitionTypes[transitionIndex] ?? data.firstTypeIndex);
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] UnaryOperator
src/tz/tzif-backend.ts:145:27
 
   const typeAtIndex = (data: TzifData, transitionIndex: number): TzifType => {
     const typeIndex =
-      transitionIndex === -1
+      transitionIndex === +1
         ? data.firstTypeIndex
         : (data.transitionTypes[transitionIndex] ?? data.firstTypeIndex);
killedBy: Pacific/Kiritimati: the 1994 date-line move from UTC-10 to UTC+14 a single 24-hour forward transition on 1994-12-31 erases that calendar day
statusReason: expected -37760 to be -36000 // Object.is equality

[Killed] LogicalOperator
src/tz/tzif-backend.ts:147:12
     const typeIndex =
       transitionIndex === -1
         ? data.firstTypeIndex
-        : (data.transitionTypes[transitionIndex] ?? data.firstTypeIndex);
+        : (data.transitionTypes[transitionIndex] && data.firstTypeIndex);
     const type = data.types[typeIndex];
     if (type === undefined) {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:149:9
         ? data.firstTypeIndex
         : (data.transitionTypes[transitionIndex] ?? data.firstTypeIndex);
     const type = data.types[typeIndex];
-    if (type === undefined) {
+    if (true) {
       throw new Error(`TZif type index ${typeIndex} out of range`);
     }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: TZif type index 2 out of range

[Killed] EqualityOperator
src/tz/tzif-backend.ts:149:9
         ? data.firstTypeIndex
         : (data.transitionTypes[transitionIndex] ?? data.firstTypeIndex);
     const type = data.types[typeIndex];
-    if (type === undefined) {
+    if (type !== undefined) {
       throw new Error(`TZif type index ${typeIndex} out of range`);
     }
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: TZif type index 0 out of range

[Killed] BlockStatement
src/tz/tzif-backend.ts:155:76
     return type;
   };
 
-  const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => {
-    const { data, posix } = load(zone);
-    const last = data.transitionMillis[data.transitionMillis.length - 1];
-    const pastTable = last === undefined || instantUtcMillis >= last;
-    if (pastTable && posix !== null) {
-      return footerOffsetInfo(posix, instantUtcMillis);
-    }
-    const index = lastTransitionIndex(data.transitionMillis, instantUtcMillis);
-    return typeInfo(typeAtIndex(data, index));
-  };
+  const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => {};
 
   const transitionsBetween = (
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: Cannot read properties of undefined (reading 'offsetSeconds')

[Killed] ArithmeticOperator
src/tz/tzif-backend.ts:157:40
 
   const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => {
     const { data, posix } = load(zone);
-    const last = data.transitionMillis[data.transitionMillis.length - 1];
+    const last = data.transitionMillis[data.transitionMillis.length + 1];
     const pastTable = last === undefined || instantUtcMillis >= last;
     if (pastTable && posix !== null) {
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected 'unique' to be 'nonexistent' // Object.is equality

[Killed] EqualityOperator
src/tz/tzif-backend.ts:158:23
   const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => {
     const { data, posix } = load(zone);
     const last = data.transitionMillis[data.transitionMillis.length - 1];
-    const pastTable = last === undefined || instantUtcMillis >= last;
+    const pastTable = last !== undefined || instantUtcMillis >= last;
     if (pastTable && posix !== null) {
       return footerOffsetInfo(posix, instantUtcMillis);
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:158:23
   const offsetAt = (instantUtcMillis: number, zone: string): OffsetInfo => {
     const { data, posix } = load(zone);
     const last = data.transitionMillis[data.transitionMillis.length - 1];
-    const pastTable = last === undefined || instantUtcMillis >= last;
+    const pastTable = true;
     if (pastTable && posix !== null) {
       return footerOffsetInfo(posix, instantUtcMillis);
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected 'unique' to be 'nonexistent' // Object.is equality

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:159:9
     const { data, posix } = load(zone);
     const last = data.transitionMillis[data.transitionMillis.length - 1];
     const pastTable = last === undefined || instantUtcMillis >= last;
-    if (pastTable && posix !== null) {
+    if (true) {
       return footerOffsetInfo(posix, instantUtcMillis);
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/tz/tzif-backend.ts:159:9
     const { data, posix } = load(zone);
     const last = data.transitionMillis[data.transitionMillis.length - 1];
     const pastTable = last === undefined || instantUtcMillis >= last;
-    if (pastTable && posix !== null) {
+    if (pastTable || posix !== null) {
       return footerOffsetInfo(posix, instantUtcMillis);
     }
killedBy: 0 0 * * * Pacific/Apia over 2011 COUNT_ANOMALY for December 30, the calendar day that does not exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tz/tzif-backend.ts:173:63
   ): ZoneTransition[] => {
     const { data, posix } = load(zone);
     const out: ZoneTransition[] = [];
-    for (let i = 0; i < data.transitionMillis.length; i += 1) {
-      const instant = data.transitionMillis[i];
-      if (instant === undefined || instant < startUtcMillis) {
-        continue;
-      }
-      if (instant >= endUtcMillis) {
-        break;
-      }
-      const before = typeAtIndex(data, i - 1).offsetSeconds;
-      const after = typeAtIndex(data, i).offsetSeconds;
-      if (before !== after) {
-        out.push({
-          instant,
-          offsetBeforeSeconds: before,
-          offsetAfterSeconds: after,
-          deltaSeconds: after - before,
-        });
-      }
-    }
+    for (let i = 0; i < data.transitionMillis.length; i += 1) {}
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
     if (posix !== null && endUtcMillis > last) {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/tz/tzif-backend.ts:173:21
   ): ZoneTransition[] => {
     const { data, posix } = load(zone);
     const out: ZoneTransition[] = [];
-    for (let i = 0; i < data.transitionMillis.length; i += 1) {
+    for (let i = 0; i >= data.transitionMillis.length; i += 1) {
       const instant = data.transitionMillis[i];
       if (instant === undefined || instant < startUtcMillis) {
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0
