[Killed] EqualityOperator
src/tz/tzif-backend.ts:175:36
     const out: ZoneTransition[] = [];
     for (let i = 0; i < data.transitionMillis.length; i += 1) {
       const instant = data.transitionMillis[i];
-      if (instant === undefined || instant < startUtcMillis) {
+      if (instant === undefined || instant <= startUtcMillis) {
         continue;
       }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected undefined to be 1710054000000 // Object.is equality

[Killed] EqualityOperator
src/tz/tzif-backend.ts:175:36
     const out: ZoneTransition[] = [];
     for (let i = 0; i < data.transitionMillis.length; i += 1) {
       const instant = data.transitionMillis[i];
-      if (instant === undefined || instant < startUtcMillis) {
+      if (instant === undefined || instant >= startUtcMillis) {
         continue;
       }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/tz/tzif-backend.ts:178:11
       if (instant === undefined || instant < startUtcMillis) {
         continue;
       }
-      if (instant >= endUtcMillis) {
+      if (instant < endUtcMillis) {
         break;
       }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:178:11
       if (instant === undefined || instant < startUtcMillis) {
         continue;
       }
-      if (instant >= endUtcMillis) {
+      if (true) {
         break;
       }
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/tzif-backend.ts:181:40
       if (instant >= endUtcMillis) {
         break;
       }
-      const before = typeAtIndex(data, i - 1).offsetSeconds;
+      const before = typeAtIndex(data, i + 1).offsetSeconds;
       const after = typeAtIndex(data, i).offsetSeconds;
       if (before !== after) {
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected [ 184 ] to deeply equal [ -86400 ]

[Killed] EqualityOperator
src/tz/tzif-backend.ts:183:11
       }
       const before = typeAtIndex(data, i - 1).offsetSeconds;
       const after = typeAtIndex(data, i).offsetSeconds;
-      if (before !== after) {
+      if (before === after) {
         out.push({
           instant,
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected [] to deeply equal [ -86400 ]

[Killed] BlockStatement
src/tz/tzif-backend.ts:183:29
       }
       const before = typeAtIndex(data, i - 1).offsetSeconds;
       const after = typeAtIndex(data, i).offsetSeconds;
-      if (before !== after) {
-        out.push({
-          instant,
-          offsetBeforeSeconds: before,
-          offsetAfterSeconds: after,
-          deltaSeconds: after - before,
-        });
-      }
+      if (before !== after) {}
     }
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected [] to deeply equal [ -86400 ]

[Killed] ArithmeticOperator
src/tz/tzif-backend.ts:188:25
           instant,
           offsetBeforeSeconds: before,
           offsetAfterSeconds: after,
-          deltaSeconds: after - before,
+          deltaSeconds: after + before,
         });
       }
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: expected [ 3968 ] to deeply equal [ -86400 ]

[Killed] LogicalOperator
src/tz/tzif-backend.ts:192:18
         });
       }
     }
-    const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
+    const last = data.transitionMillis[data.transitionMillis.length - 1] && -Infinity;
     if (posix !== null && endUtcMillis > last) {
       const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
killedBy: America/Santiago: southern hemisphere, so DST spans the new year January is daylight time at -3h and July is standard time at -4h, with transitions in autumn and spring
statusReason: expected [ 4, 9, 4, 9 ] to deeply equal [ 4, 9 ]

[Killed] ArithmeticOperator
src/tz/tzif-backend.ts:192:40
         });
       }
     }
-    const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
+    const last = data.transitionMillis[data.transitionMillis.length + 1] ?? -Infinity;
     if (posix !== null && endUtcMillis > last) {
       const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
killedBy: */15 * * * * America/New_York over 2024 zero SKIPPED, zero DOUBLED, exactly two INTERVAL_DRIFT
statusReason: expected [ { …(10) }, { …(10) }, …(2) ] to have a length of 2 but got 4

[Killed] EqualityOperator
src/tz/tzif-backend.ts:193:9
       }
     }
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
-    if (posix !== null && endUtcMillis > last) {
+    if (posix === null && endUtcMillis > last) {
       const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
       const toYear = utcYearOf(endUtcMillis) + 1;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] BlockStatement
src/tz/tzif-backend.ts:193:48
       }
     }
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
-    if (posix !== null && endUtcMillis > last) {
-      const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
-      const toYear = utcYearOf(endUtcMillis) + 1;
-      const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
-      for (const event of footerEvents(posix, fromYear, toYear)) {
-        if (
-          event.instant <= last ||
-          event.instant < startUtcMillis ||
-          event.instant >= endUtcMillis
-        ) {
-          continue;
-        }
-        const before = event.toDst ? posix.stdOffsetSeconds : dstOffset;
-        const after = event.toDst ? dstOffset : posix.stdOffsetSeconds;
-        if (before !== after) {
-          out.push({
-            instant: event.instant,
-            offsetBeforeSeconds: before,
-            offsetAfterSeconds: after,
-            deltaSeconds: after - before,
-          });
-        }
-      }
-    }
+    if (posix !== null && endUtcMillis > last) {}
     return out;
   };
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ArithmeticOperator
src/tz/tzif-backend.ts:194:24
     }
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
     if (posix !== null && endUtcMillis > last) {
-      const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
+      const fromYear = utcYearOf(Math.max(startUtcMillis, last)) + 1;
       const toYear = utcYearOf(endUtcMillis) + 1;
       const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(1) ] to deeply equal []

[Survived] MethodExpression
src/tz/tzif-backend.ts:194:34
     }
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
     if (posix !== null && endUtcMillis > last) {
-      const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
+      const fromYear = utcYearOf(Math.min(startUtcMillis, last)) - 1;
       const toYear = utcYearOf(endUtcMillis) + 1;
       const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;

[Survived] ArithmeticOperator
src/tz/tzif-backend.ts:195:22
     const last = data.transitionMillis[data.transitionMillis.length - 1] ?? -Infinity;
     if (posix !== null && endUtcMillis > last) {
       const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
-      const toYear = utcYearOf(endUtcMillis) + 1;
+      const toYear = utcYearOf(endUtcMillis) - 1;
       const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
       for (const event of footerEvents(posix, fromYear, toYear)) {

[Killed] LogicalOperator
src/tz/tzif-backend.ts:196:25
     if (posix !== null && endUtcMillis > last) {
       const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
       const toYear = utcYearOf(endUtcMillis) + 1;
-      const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
+      const dstOffset = posix.dstOffsetSeconds && posix.stdOffsetSeconds;
       for (const event of footerEvents(posix, fromYear, toYear)) {
         if (
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(12) ] to deeply equal []

[Killed] BlockStatement
src/tz/tzif-backend.ts:197:66
       const fromYear = utcYearOf(Math.max(startUtcMillis, last)) - 1;
       const toYear = utcYearOf(endUtcMillis) + 1;
       const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
-      for (const event of footerEvents(posix, fromYear, toYear)) {
-        if (
-          event.instant <= last ||
-          event.instant < startUtcMillis ||
-          event.instant >= endUtcMillis
-        ) {
-          continue;
-        }
-        const before = event.toDst ? posix.stdOffsetSeconds : dstOffset;
-        const after = event.toDst ? dstOffset : posix.stdOffsetSeconds;
-        if (before !== after) {
-          out.push({
-            instant: event.instant,
-            offsetBeforeSeconds: before,
-            offsetAfterSeconds: after,
-            deltaSeconds: after - before,
-          });
-        }
-      }
+      for (const event of footerEvents(posix, fromYear, toYear)) {}
     }
     return out;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] ConditionalExpression
src/tz/tzif-backend.ts:199:11
       const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
       for (const event of footerEvents(posix, fromYear, toYear)) {
         if (
-          event.instant <= last ||
-          event.instant < startUtcMillis ||
-          event.instant >= endUtcMillis
+          true
         ) {
           continue;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/tzif-backend.ts:199:11
       const dstOffset = posix.dstOffsetSeconds ?? posix.stdOffsetSeconds;
       for (const event of footerEvents(posix, fromYear, toYear)) {
         if (
-          event.instant <= last ||
+          event.instant > last ||
           event.instant < startUtcMillis ||
           event.instant >= endUtcMillis
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/tzif-backend.ts:200:11
       for (const event of footerEvents(posix, fromYear, toYear)) {
         if (
           event.instant <= last ||
-          event.instant < startUtcMillis ||
+          event.instant >= startUtcMillis ||
           event.instant >= endUtcMillis
         ) {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Survived] ConditionalExpression
src/tz/tzif-backend.ts:200:11
       for (const event of footerEvents(posix, fromYear, toYear)) {
         if (
           event.instant <= last ||
-          event.instant < startUtcMillis ||
+          false ||
           event.instant >= endUtcMillis
         ) {

[Killed] EqualityOperator
src/tz/tzif-backend.ts:201:11
         if (
           event.instant <= last ||
           event.instant < startUtcMillis ||
-          event.instant >= endUtcMillis
+          event.instant < endUtcMillis
         ) {
           continue;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Survived] ConditionalExpression
src/tz/tzif-backend.ts:201:11
         if (
           event.instant <= last ||
           event.instant < startUtcMillis ||
-          event.instant >= endUtcMillis
+          false
         ) {
           continue;

[Survived] BlockStatement
src/tz/tzif-backend.ts:202:11
           event.instant <= last ||
           event.instant < startUtcMillis ||
           event.instant >= endUtcMillis
-        ) {
-          continue;
-        }
+        ) {}
         const before = event.toDst ? posix.stdOffsetSeconds : dstOffset;
         const after = event.toDst ? dstOffset : posix.stdOffsetSeconds;

[Killed] BlockStatement
src/tz/tzif-backend.ts:207:31
         }
         const before = event.toDst ? posix.stdOffsetSeconds : dstOffset;
         const after = event.toDst ? dstOffset : posix.stdOffsetSeconds;
-        if (before !== after) {
-          out.push({
-            instant: event.instant,
-            offsetBeforeSeconds: before,
-            offsetAfterSeconds: after,
-            deltaSeconds: after - before,
-          });
-        }
+        if (before !== after) {}
       }
     }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Killed] EqualityOperator
src/tz/tzif-backend.ts:207:13
         }
         const before = event.toDst ? posix.stdOffsetSeconds : dstOffset;
         const after = event.toDst ? dstOffset : posix.stdOffsetSeconds;
-        if (before !== after) {
+        if (before === after) {
           out.push({
             instant: event.instant,
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: expected [ …(16) ] to deeply equal []

[Survived] StringLiteral
src/tz/tzif-backend.ts:221:11
   };
 
   return {
-    name: 'tzif',
+    name: "",
     zoneinfoRoot: root,
     offsetAt,
