[Killed] BlockStatement
src/tz/tzif-parse.ts:46:57
   charcnt: number;
 }
 
-function readHeader(view: DataView, at: number): Header {
-  const magic = String.fromCharCode(
-    view.getUint8(at),
-    view.getUint8(at + 1),
-    view.getUint8(at + 2),
-    view.getUint8(at + 3),
-  );
-  if (magic !== 'TZif') {
-    throw new Error('not a TZif file: bad magic');
-  }
-  const versionByte = view.getUint8(at + 4);
-  return {
-    version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
-    isutcnt: view.getUint32(at + 20),
-    isstdcnt: view.getUint32(at + 24),
-    leapcnt: view.getUint32(at + 28),
-    timecnt: view.getUint32(at + 32),
-    typecnt: view.getUint32(at + 36),
-    charcnt: view.getUint32(at + 40),
-  };
-}
+function readHeader(view: DataView, at: number): Header {}
 
 const HEADER_BYTES = 44;
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Cannot read properties of undefined (reading 'version')

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:49:19
 function readHeader(view: DataView, at: number): Header {
   const magic = String.fromCharCode(
     view.getUint8(at),
-    view.getUint8(at + 1),
+    view.getUint8(at - 1),
     view.getUint8(at + 2),
     view.getUint8(at + 3),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:50:19
   const magic = String.fromCharCode(
     view.getUint8(at),
     view.getUint8(at + 1),
-    view.getUint8(at + 2),
+    view.getUint8(at - 2),
     view.getUint8(at + 3),
   );
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:51:19
     view.getUint8(at),
     view.getUint8(at + 1),
     view.getUint8(at + 2),
-    view.getUint8(at + 3),
+    view.getUint8(at - 3),
   );
   if (magic !== 'TZif') {
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] BlockStatement
src/tz/tzif-parse.ts:53:25
     view.getUint8(at + 2),
     view.getUint8(at + 3),
   );
-  if (magic !== 'TZif') {
-    throw new Error('not a TZif file: bad magic');
-  }
+  if (magic !== 'TZif') {}
   const versionByte = view.getUint8(at + 4);
   return {
killedBy: TZif binary parsing rejects input that is not TZif
statusReason: expected [Function] to throw error matching /magic/ but got 'Offset is outside the bounds of the D…'

[Killed] EqualityOperator
src/tz/tzif-parse.ts:53:7
     view.getUint8(at + 2),
     view.getUint8(at + 3),
   );
-  if (magic !== 'TZif') {
+  if (magic === 'TZif') {
     throw new Error('not a TZif file: bad magic');
   }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: not a TZif file: bad magic

[Killed] StringLiteral
src/tz/tzif-parse.ts:54:21
     view.getUint8(at + 3),
   );
   if (magic !== 'TZif') {
-    throw new Error('not a TZif file: bad magic');
+    throw new Error("");
   }
   const versionByte = view.getUint8(at + 4);
killedBy: TZif binary parsing rejects input that is not TZif
statusReason: expected [Function] to throw error matching /magic/ but got ''

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:56:37
   if (magic !== 'TZif') {
     throw new Error('not a TZif file: bad magic');
   }
-  const versionByte = view.getUint8(at + 4);
+  const versionByte = view.getUint8(at - 4);
   return {
     version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:58:14
   }
   const versionByte = view.getUint8(at + 4);
   return {
-    version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
+    version: true ? '1' : String.fromCharCode(versionByte),
     isutcnt: view.getUint32(at + 20),
     isstdcnt: view.getUint32(at + 24),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: TZif version 1 file has no 64-bit data block

[Killed] EqualityOperator
src/tz/tzif-parse.ts:58:14
   }
   const versionByte = view.getUint8(at + 4);
   return {
-    version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
+    version: versionByte !== 0 ? '1' : String.fromCharCode(versionByte),
     isutcnt: view.getUint32(at + 20),
     isstdcnt: view.getUint32(at + 24),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: TZif version 1 file has no 64-bit data block

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:59:29
   const versionByte = view.getUint8(at + 4);
   return {
     version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
-    isutcnt: view.getUint32(at + 20),
+    isutcnt: view.getUint32(at - 20),
     isstdcnt: view.getUint32(at + 24),
     leapcnt: view.getUint32(at + 28),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:60:30
   return {
     version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
     isutcnt: view.getUint32(at + 20),
-    isstdcnt: view.getUint32(at + 24),
+    isstdcnt: view.getUint32(at - 24),
     leapcnt: view.getUint32(at + 28),
     timecnt: view.getUint32(at + 32),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:61:29
     version: versionByte === 0 ? '1' : String.fromCharCode(versionByte),
     isutcnt: view.getUint32(at + 20),
     isstdcnt: view.getUint32(at + 24),
-    leapcnt: view.getUint32(at + 28),
+    leapcnt: view.getUint32(at - 28),
     timecnt: view.getUint32(at + 32),
     typecnt: view.getUint32(at + 36),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:62:29
     isutcnt: view.getUint32(at + 20),
     isstdcnt: view.getUint32(at + 24),
     leapcnt: view.getUint32(at + 28),
-    timecnt: view.getUint32(at + 32),
+    timecnt: view.getUint32(at - 32),
     typecnt: view.getUint32(at + 36),
     charcnt: view.getUint32(at + 40),
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:63:29
     isstdcnt: view.getUint32(at + 24),
     leapcnt: view.getUint32(at + 28),
     timecnt: view.getUint32(at + 32),
-    typecnt: view.getUint32(at + 36),
+    typecnt: view.getUint32(at - 36),
     charcnt: view.getUint32(at + 40),
   };
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:64:29
     leapcnt: view.getUint32(at + 28),
     timecnt: view.getUint32(at + 32),
     typecnt: view.getUint32(at + 36),
-    charcnt: view.getUint32(at + 40),
+    charcnt: view.getUint32(at - 40),
   };
 }
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: Offset is outside the bounds of the DataView

[Killed] BlockStatement
src/tz/tzif-parse.ts:70:68
 
 const HEADER_BYTES = 44;
 
-function dataBlockBytes(header: Header, timeBytes: number): number {
-  return (
-    header.timecnt * timeBytes +
-    header.timecnt +
-    header.typecnt * 6 +
-    header.charcnt +
-    header.leapcnt * (timeBytes + 4) +
-    header.isstdcnt +
-    header.isutcnt
-  );
-}
+function dataBlockBytes(header: Header, timeBytes: number): number {}
 
 function decodeAscii(bytes: Uint8Array): string {
killedBy: TZif binary parsing reads the 64-bit transition table and footer of America/New_York
statusReason: not a TZif file: bad magic

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:72:5
 
 function dataBlockBytes(header: Header, timeBytes: number): number {
   return (
-    header.timecnt * timeBytes +
-    header.timecnt +
-    header.typecnt * 6 +
-    header.charcnt +
+    header.timecnt * timeBytes + header.timecnt + header.typecnt * 6 - header.charcnt +
     header.leapcnt * (timeBytes + 4) +
     header.isstdcnt +
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: not a TZif file: bad magic

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:72:5
 
 function dataBlockBytes(header: Header, timeBytes: number): number {
   return (
-    header.timecnt * timeBytes +
-    header.timecnt +
-    header.typecnt * 6 +
-    header.charcnt +
-    header.leapcnt * (timeBytes + 4) +
-    header.isstdcnt +
-    header.isutcnt
+    header.timecnt * timeBytes + header.timecnt + header.typecnt * 6 + header.charcnt + header.leapcnt * (timeBytes + 4) + header.isstdcnt - header.isutcnt
   );
 }
killedBy: TZif binary parsing reads the 64-bit transition table and footer of America/New_York
statusReason: not a TZif file: bad magic

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:74:5
   return (
     header.timecnt * timeBytes +
     header.timecnt +
-    header.typecnt * 6 +
+    header.typecnt / 6 +
     header.charcnt +
     header.leapcnt * (timeBytes + 4) +
killedBy: backend cross-check both backends agree on every transition instant and offset for hazard-heavy zones, 1970 to 2040
statusReason: not a TZif file: bad magic

[Survived] ArithmeticOperator
src/tz/tzif-parse.ts:76:5
     header.timecnt +
     header.typecnt * 6 +
     header.charcnt +
-    header.leapcnt * (timeBytes + 4) +
+    header.leapcnt / (timeBytes + 4) +
     header.isstdcnt +
     header.isutcnt

[Survived] ArithmeticOperator
src/tz/tzif-parse.ts:76:23
     header.timecnt +
     header.typecnt * 6 +
     header.charcnt +
-    header.leapcnt * (timeBytes + 4) +
+    header.leapcnt * (timeBytes - 4) +
     header.isstdcnt +
     header.isutcnt

[Killed] BlockStatement
src/tz/tzif-parse.ts:82:49
   );
 }
 
-function decodeAscii(bytes: Uint8Array): string {
-  return Array.from(bytes, (b) => String.fromCharCode(b)).join('');
-}
+function decodeAscii(bytes: Uint8Array): string {}
 
 function abbreviationAt(chars: string, index: number): string {
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] ArrowFunction
src/tz/tzif-parse.ts:83:28
 }
 
 function decodeAscii(bytes: Uint8Array): string {
-  return Array.from(bytes, (b) => String.fromCharCode(b)).join('');
+  return Array.from(bytes, () => undefined).join('');
 }
 
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tz/tzif-parse.ts:86:63
   return Array.from(bytes, (b) => String.fromCharCode(b)).join('');
 }
 
-function abbreviationAt(chars: string, index: number): string {
-  const end = chars.indexOf('\0', index);
-  return end === -1 ? chars.slice(index) : chars.slice(index, end);
-}
+function abbreviationAt(chars: string, index: number): string {}
 
 /**
killedBy: America/Santiago: southern hemisphere, so DST spans the new year January is daylight time at -3h and July is standard time at -4h, with transitions in autumn and spring
statusReason: expected { offsetSeconds: -10800, …(2) } to deeply equal { offsetSeconds: -10800, …(2) }

[Killed] MethodExpression
src/tz/tzif-parse.ts:88:44
 
 function abbreviationAt(chars: string, index: number): string {
   const end = chars.indexOf('\0', index);
-  return end === -1 ? chars.slice(index) : chars.slice(index, end);
+  return end === -1 ? chars.slice(index) : chars;
 }
 
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] EqualityOperator
src/tz/tzif-parse.ts:88:10
 
 function abbreviationAt(chars: string, index: number): string {
   const end = chars.indexOf('\0', index);
-  return end === -1 ? chars.slice(index) : chars.slice(index, end);
+  return end !== -1 ? chars.slice(index) : chars.slice(index, end);
 }
 
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] EqualityOperator
src/tz/tzif-parse.ts:98:7
 export function parseTzif(buffer: Uint8Array): TzifData {
   const view = new DataView(buffer.buffer, buffer.byteOffset, buffer.byteLength);
   const v1Header = readHeader(view, 0);
-  if (v1Header.version === '1') {
+  if (v1Header.version !== '1') {
     throw new Error('TZif version 1 file has no 64-bit data block');
   }
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: TZif version 1 file has no 64-bit data block

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:98:7
 export function parseTzif(buffer: Uint8Array): TzifData {
   const view = new DataView(buffer.buffer, buffer.byteOffset, buffer.byteLength);
   const v1Header = readHeader(view, 0);
-  if (v1Header.version === '1') {
+  if (true) {
     throw new Error('TZif version 1 file has no 64-bit data block');
   }
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: TZif version 1 file has no 64-bit data block

[NoCoverage] StringLiteral
src/tz/tzif-parse.ts:99:21
   const view = new DataView(buffer.buffer, buffer.byteOffset, buffer.byteLength);
   const v1Header = readHeader(view, 0);
   if (v1Header.version === '1') {
-    throw new Error('TZif version 1 file has no 64-bit data block');
+    throw new Error("");
   }
   const v2Start = HEADER_BYTES + dataBlockBytes(v1Header, 4);

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:101:19
   if (v1Header.version === '1') {
     throw new Error('TZif version 1 file has no 64-bit data block');
   }
-  const v2Start = HEADER_BYTES + dataBlockBytes(v1Header, 4);
+  const v2Start = HEADER_BYTES - dataBlockBytes(v1Header, 4);
   const header = readHeader(view, v2Start);
   let at = v2Start + HEADER_BYTES;
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: Offset is outside the bounds of the DataView

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:103:12
   }
   const v2Start = HEADER_BYTES + dataBlockBytes(v1Header, 4);
   const header = readHeader(view, v2Start);
-  let at = v2Start + HEADER_BYTES;
+  let at = v2Start - HEADER_BYTES;
 
   const transitionMillis: number[] = [];
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] EqualityOperator
src/tz/tzif-parse.ts:106:19
   let at = v2Start + HEADER_BYTES;
 
   const transitionMillis: number[] = [];
-  for (let i = 0; i < header.timecnt; i += 1) {
+  for (let i = 0; i <= header.timecnt; i += 1) {
     transitionMillis.push(Number(view.getBigInt64(at)) * 1000);
     at += 8;
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:106:19
   let at = v2Start + HEADER_BYTES;
 
   const transitionMillis: number[] = [];
-  for (let i = 0; i < header.timecnt; i += 1) {
+  for (let i = 0; false; i += 1) {
     transitionMillis.push(Number(view.getBigInt64(at)) * 1000);
     at += 8;
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:107:27
 
   const transitionMillis: number[] = [];
   for (let i = 0; i < header.timecnt; i += 1) {
-    transitionMillis.push(Number(view.getBigInt64(at)) * 1000);
+    transitionMillis.push(Number(view.getBigInt64(at)) / 1000);
     at += 8;
   }
killedBy: tzif backend Pacific/Apia 2011-12-30 is a fully nonexistent calendar day
statusReason: expected 'unique' to be 'nonexistent' // Object.is equality

[Killed] AssignmentOperator
src/tz/tzif-parse.ts:108:5
   const transitionMillis: number[] = [];
   for (let i = 0; i < header.timecnt; i += 1) {
     transitionMillis.push(Number(view.getBigInt64(at)) * 1000);
-    at += 8;
+    at -= 8;
   }
   const transitionTypes: number[] = [];
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: Offset is outside the bounds of the DataView

[Killed] ArrayDeclaration
src/tz/tzif-parse.ts:110:37
     transitionMillis.push(Number(view.getBigInt64(at)) * 1000);
     at += 8;
   }
-  const transitionTypes: number[] = [];
+  const transitionTypes: number[] = ["Stryker was here"];
   for (let i = 0; i < header.timecnt; i += 1) {
     transitionTypes.push(view.getUint8(at));
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: expected 'ambiguous' to be 'nonexistent' // Object.is equality

[Killed] EqualityOperator
src/tz/tzif-parse.ts:111:19
     at += 8;
   }
   const transitionTypes: number[] = [];
-  for (let i = 0; i < header.timecnt; i += 1) {
+  for (let i = 0; i >= header.timecnt; i += 1) {
     transitionTypes.push(view.getUint8(at));
     at += 1;
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:111:19
     at += 8;
   }
   const transitionTypes: number[] = [];
-  for (let i = 0; i < header.timecnt; i += 1) {
+  for (let i = 0; false; i += 1) {
     transitionTypes.push(view.getUint8(at));
     at += 1;
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] AssignmentOperator
src/tz/tzif-parse.ts:113:5
   const transitionTypes: number[] = [];
   for (let i = 0; i < header.timecnt; i += 1) {
     transitionTypes.push(view.getUint8(at));
-    at += 1;
+    at -= 1;
   }
   const rawTypes: { offsetSeconds: number; isDst: boolean; desigIndex: number }[] = [];
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: TZif type index 13 out of range

[Killed] ArrayDeclaration
src/tz/tzif-parse.ts:115:85
     transitionTypes.push(view.getUint8(at));
     at += 1;
   }
-  const rawTypes: { offsetSeconds: number; isDst: boolean; desigIndex: number }[] = [];
+  const rawTypes: { offsetSeconds: number; isDst: boolean; desigIndex: number }[] = ["Stryker was here"];
   for (let i = 0; i < header.typecnt; i += 1) {
     rawTypes.push({
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: expected 'ambiguous' to be 'nonexistent' // Object.is equality

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:116:19
     at += 1;
   }
   const rawTypes: { offsetSeconds: number; isDst: boolean; desigIndex: number }[] = [];
-  for (let i = 0; i < header.typecnt; i += 1) {
+  for (let i = 0; false; i += 1) {
     rawTypes.push({
       offsetSeconds: view.getInt32(at),
killedBy: null test: UTC schedules produce zero hazards 30 2 * * * in vixie dialect yields no hazards in any UTC zone
statusReason: TZif type index 0 out of range

[Killed] EqualityOperator
src/tz/tzif-parse.ts:116:19
     at += 1;
   }
   const rawTypes: { offsetSeconds: number; isDst: boolean; desigIndex: number }[] = [];
-  for (let i = 0; i < header.typecnt; i += 1) {
+  for (let i = 0; i >= header.typecnt; i += 1) {
     rawTypes.push({
       offsetSeconds: view.getInt32(at),
killedBy: tzif backend 2024-03-10T02:30 America/New_York is nonexistent with a one-hour gap
statusReason: TZif type index 2 out of range

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:119:14
   for (let i = 0; i < header.typecnt; i += 1) {
     rawTypes.push({
       offsetSeconds: view.getInt32(at),
-      isDst: view.getUint8(at + 4) !== 0,
+      isDst: true,
       desigIndex: view.getUint8(at + 5),
     });
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: 3600, …(2) } to deeply equal { offsetSeconds: 3600, …(2) }

[Killed] EqualityOperator
src/tz/tzif-parse.ts:119:14
   for (let i = 0; i < header.typecnt; i += 1) {
     rawTypes.push({
       offsetSeconds: view.getInt32(at),
-      isDst: view.getUint8(at + 4) !== 0,
+      isDst: view.getUint8(at + 4) === 0,
       desigIndex: view.getUint8(at + 5),
     });
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:120:33
     rawTypes.push({
       offsetSeconds: view.getInt32(at),
       isDst: view.getUint8(at + 4) !== 0,
-      desigIndex: view.getUint8(at + 5),
+      desigIndex: view.getUint8(at - 5),
     });
     at += 6;
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] AssignmentOperator
src/tz/tzif-parse.ts:122:5
       isDst: view.getUint8(at + 4) !== 0,
       desigIndex: view.getUint8(at + 5),
     });
-    at += 6;
+    at -= 6;
   }
   const chars = decodeAscii(buffer.subarray(at, at + header.charcnt));
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: no candidate instant and no covering gap for America/New_York; backend transitions inconsistent

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:124:49
     });
     at += 6;
   }
-  const chars = decodeAscii(buffer.subarray(at, at + header.charcnt));
+  const chars = decodeAscii(buffer.subarray(at, at - header.charcnt));
   at += header.charcnt;
   at += header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] AssignmentOperator
src/tz/tzif-parse.ts:125:3
     at += 6;
   }
   const chars = decodeAscii(buffer.subarray(at, at + header.charcnt));
-  at += header.charcnt;
+  at -= header.charcnt;
   at += header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
 
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] AssignmentOperator
src/tz/tzif-parse.ts:126:3
   }
   const chars = decodeAscii(buffer.subarray(at, at + header.charcnt));
   at += header.charcnt;
-  at += header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
+  at -= header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
 
   const types: TzifType[] = rawTypes.map((raw) => ({
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:126:9
   }
   const chars = decodeAscii(buffer.subarray(at, at + header.charcnt));
   at += header.charcnt;
-  at += header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
+  at += header.leapcnt * 12 - header.isstdcnt + header.isutcnt;
 
   const types: TzifType[] = rawTypes.map((raw) => ({
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/tz/tzif-parse.ts:128:42
   at += header.charcnt;
   at += header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
 
-  const types: TzifType[] = rawTypes.map((raw) => ({
-    offsetSeconds: raw.offsetSeconds,
-    isDst: raw.isDst,
-    abbreviation: abbreviationAt(chars, raw.desigIndex),
-  }));
+  const types: TzifType[] = rawTypes.map(() => undefined);
 
   let posixTzString: string | null = null;
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a constant-offset zone past its last transition is not labeled unstable (extrapolation is exact)
statusReason: TZif type index 3 out of range

[Killed] ObjectLiteral
src/tz/tzif-parse.ts:128:52
   at += header.charcnt;
   at += header.leapcnt * 12 + header.isstdcnt + header.isutcnt;
 
-  const types: TzifType[] = rawTypes.map((raw) => ({
-    offsetSeconds: raw.offsetSeconds,
-    isDst: raw.isDst,
-    abbreviation: abbreviationAt(chars, raw.desigIndex),
-  }));
+  const types: TzifType[] = rawTypes.map((raw) => ({}));
 
   let posixTzString: string | null = null;
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a constant-offset zone past its last transition is not labeled unstable (extrapolation is exact)
statusReason: no candidate instant and no covering gap for Asia/Tehran; backend transitions inconsistent

[Killed] BlockStatement
src/tz/tzif-parse.ts:135:61
   }));
 
   let posixTzString: string | null = null;
-  if (at < buffer.byteLength && view.getUint8(at) === 0x0a) {
-    const rest = buffer.subarray(at + 1);
-    const newline = rest.indexOf(0x0a);
-    const footer = decodeAscii(newline === -1 ? rest : rest.subarray(0, newline));
-    posixTzString = footer.length > 0 ? footer : null;
-  }
+  if (at < buffer.byteLength && view.getUint8(at) === 0x0a) {}
 
   /*
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:135:7
   }));
 
   let posixTzString: string | null = null;
-  if (at < buffer.byteLength && view.getUint8(at) === 0x0a) {
+  if (false) {
     const rest = buffer.subarray(at + 1);
     const newline = rest.indexOf(0x0a);
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/tz/tzif-parse.ts:136:34
 
   let posixTzString: string | null = null;
   if (at < buffer.byteLength && view.getUint8(at) === 0x0a) {
-    const rest = buffer.subarray(at + 1);
+    const rest = buffer.subarray(at - 1);
     const newline = rest.indexOf(0x0a);
     const footer = decodeAscii(newline === -1 ? rest : rest.subarray(0, newline));
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0
