[Killed] EqualityOperator
src/tz/tzif-parse.ts:138:32
   if (at < buffer.byteLength && view.getUint8(at) === 0x0a) {
     const rest = buffer.subarray(at + 1);
     const newline = rest.indexOf(0x0a);
-    const footer = decodeAscii(newline === -1 ? rest : rest.subarray(0, newline));
+    const footer = decodeAscii(newline !== -1 ? rest : rest.subarray(0, newline));
     posixTzString = footer.length > 0 ? footer : null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:138:32
   if (at < buffer.byteLength && view.getUint8(at) === 0x0a) {
     const rest = buffer.subarray(at + 1);
     const newline = rest.indexOf(0x0a);
-    const footer = decodeAscii(newline === -1 ? rest : rest.subarray(0, newline));
+    const footer = decodeAscii(true ? rest : rest.subarray(0, newline));
     posixTzString = footer.length > 0 ? footer : null;
   }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tz/tzif-parse.ts:139:21
     const rest = buffer.subarray(at + 1);
     const newline = rest.indexOf(0x0a);
     const footer = decodeAscii(newline === -1 ? rest : rest.subarray(0, newline));
-    posixTzString = footer.length > 0 ? footer : null;
+    posixTzString = false ? footer : null;
   }
 
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/tz/tzif-parse.ts:139:21
     const rest = buffer.subarray(at + 1);
     const newline = rest.indexOf(0x0a);
     const footer = decodeAscii(newline === -1 ? rest : rest.subarray(0, newline));
-    posixTzString = footer.length > 0 ? footer : null;
+    posixTzString = footer.length <= 0 ? footer : null;
   }
 
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0
