[Killed] BlockStatement
src/tz/versions.ts:26:67
  * process.versions.tz; the zoneinfo side from the root's +VERSION
  * file or tzdata.zi header.
  */
-export function tzdbVersions(zoneinfoRoot?: string): TzdbVersions {
-  const root = resolveZoneinfoRoot(zoneinfoRoot);
-  return {
-    intlTzdbVersion: process.versions.tz ?? null,
-    zoneinfoTzdbVersion: readZoneinfoVersion(root),
-    zoneinfoRoot: root,
-  };
-}
+export function tzdbVersions(zoneinfoRoot?: string): TzdbVersions {}
 
 /**
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: Cannot read properties of undefined (reading 'intlTzdbVersion')

[Killed] LogicalOperator
src/tz/versions.ts:29:22
 export function tzdbVersions(zoneinfoRoot?: string): TzdbVersions {
   const root = resolveZoneinfoRoot(zoneinfoRoot);
   return {
-    intlTzdbVersion: process.versions.tz ?? null,
+    intlTzdbVersion: process.versions.tz && null,
     zoneinfoTzdbVersion: readZoneinfoVersion(root),
     zoneinfoRoot: root,
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: expected null to be '2025b' // Object.is equality

[Killed] BlockStatement
src/tz/versions.ts:39:75
  * Returns a loud multi-line warning when the two tzdb versions
  * disagree or either is unknown, or null when they match.
  */
-export function tzdbVersionWarning(versions: TzdbVersions): string | null {
-  const { intlTzdbVersion, zoneinfoTzdbVersion } = versions;
-  if (intlTzdbVersion === null || zoneinfoTzdbVersion === null) {
-    return [
-      'WARNING: a tzdb version could not be determined.',
-      `  Intl (ICU) tzdb: ${intlTzdbVersion ?? 'unknown'}`,
-      `  zoneinfo tzdb:   ${zoneinfoTzdbVersion ?? 'unknown'} (${versions.zoneinfoRoot})`,
-      '  Results cannot be tied to a known tzdb release.',
-    ].join('\n');
-  }
-  if (intlTzdbVersion === zoneinfoTzdbVersion) {
-    return null;
-  }
-  return [
-    '################################################################',
-    'WARNING: tzdb VERSION MISMATCH between the two data sources.',
-    `  Intl (ICU) tzdb: ${intlTzdbVersion}`,
-    `  zoneinfo tzdb:   ${zoneinfoTzdbVersion} (${versions.zoneinfoRoot})`,
-    '  One of these databases is stale. Offsets and transitions that',
-    '  changed between the releases WILL differ between backends, and',
-    '  any verdict computed against the stale side is worth nothing.',
-    '################################################################',
-  ].join('\n');
-}
+export function tzdbVersionWarning(versions: TzdbVersions): string | null {}
 
killedBy: tzdb version reporting stays silent when both sources carry the same release
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/tz/versions.ts:41:7
  */
 export function tzdbVersionWarning(versions: TzdbVersions): string | null {
   const { intlTzdbVersion, zoneinfoTzdbVersion } = versions;
-  if (intlTzdbVersion === null || zoneinfoTzdbVersion === null) {
+  if (intlTzdbVersion === null && zoneinfoTzdbVersion === null) {
     return [
       'WARNING: a tzdb version could not be determined.',
killedBy: tzdb version reporting warns when a version cannot be determined at all
statusReason: expected '#####################################…' to contain 'could not be determined'

[Killed] EqualityOperator
src/tz/versions.ts:41:7
  */
 export function tzdbVersionWarning(versions: TzdbVersions): string | null {
   const { intlTzdbVersion, zoneinfoTzdbVersion } = versions;
-  if (intlTzdbVersion === null || zoneinfoTzdbVersion === null) {
+  if (intlTzdbVersion !== null || zoneinfoTzdbVersion === null) {
     return [
       'WARNING: a tzdb version could not be determined.',
killedBy: tzdb version reporting stays silent when both sources carry the same release
statusReason: expected 'WARNING: a tzdb version could not be …' to be null

[Survived] LogicalOperator
src/tz/versions.ts:44:29
   if (intlTzdbVersion === null || zoneinfoTzdbVersion === null) {
     return [
       'WARNING: a tzdb version could not be determined.',
-      `  Intl (ICU) tzdb: ${intlTzdbVersion ?? 'unknown'}`,
+      `  Intl (ICU) tzdb: ${intlTzdbVersion && 'unknown'}`,
       `  zoneinfo tzdb:   ${zoneinfoTzdbVersion ?? 'unknown'} (${versions.zoneinfoRoot})`,
       '  Results cannot be tied to a known tzdb release.',

[Survived] StringLiteral
src/tz/versions.ts:44:48
   if (intlTzdbVersion === null || zoneinfoTzdbVersion === null) {
     return [
       'WARNING: a tzdb version could not be determined.',
-      `  Intl (ICU) tzdb: ${intlTzdbVersion ?? 'unknown'}`,
+      `  Intl (ICU) tzdb: ${intlTzdbVersion ?? ""}`,
       `  zoneinfo tzdb:   ${zoneinfoTzdbVersion ?? 'unknown'} (${versions.zoneinfoRoot})`,
       '  Results cannot be tied to a known tzdb release.',

[Survived] LogicalOperator
src/tz/versions.ts:45:29
     return [
       'WARNING: a tzdb version could not be determined.',
       `  Intl (ICU) tzdb: ${intlTzdbVersion ?? 'unknown'}`,
-      `  zoneinfo tzdb:   ${zoneinfoTzdbVersion ?? 'unknown'} (${versions.zoneinfoRoot})`,
+      `  zoneinfo tzdb:   ${zoneinfoTzdbVersion && 'unknown'} (${versions.zoneinfoRoot})`,
       '  Results cannot be tied to a known tzdb release.',
     ].join('\n');

[Killed] BlockStatement
src/tz/versions.ts:49:48
       '  Results cannot be tied to a known tzdb release.',
     ].join('\n');
   }
-  if (intlTzdbVersion === zoneinfoTzdbVersion) {
-    return null;
-  }
+  if (intlTzdbVersion === zoneinfoTzdbVersion) {}
   return [
     '################################################################',
killedBy: tzdb version reporting stays silent when both sources carry the same release
statusReason: expected '#####################################…' to be null

[Killed] ConditionalExpression
src/tz/versions.ts:49:7
       '  Results cannot be tied to a known tzdb release.',
     ].join('\n');
   }
-  if (intlTzdbVersion === zoneinfoTzdbVersion) {
+  if (true) {
     return null;
   }
killedBy: tzdb version reporting warns loudly when the releases disagree, naming both versions
statusReason: expected null not to be null

[Survived] StringLiteral
src/tz/versions.ts:53:5
     return null;
   }
   return [
-    '################################################################',
+    "",
     'WARNING: tzdb VERSION MISMATCH between the two data sources.',
     `  Intl (ICU) tzdb: ${intlTzdbVersion}`,

[Killed] StringLiteral
src/tz/versions.ts:56:5
     '################################################################',
     'WARNING: tzdb VERSION MISMATCH between the two data sources.',
     `  Intl (ICU) tzdb: ${intlTzdbVersion}`,
-    `  zoneinfo tzdb:   ${zoneinfoTzdbVersion} (${versions.zoneinfoRoot})`,
+    ``,
     '  One of these databases is stale. Offsets and transitions that',
     '  changed between the releases WILL differ between backends, and',
killedBy: tzdb version reporting warns loudly when the releases disagree, naming both versions
statusReason: expected '#####################################…' to contain '2026b'

[Survived] StringLiteral
src/tz/versions.ts:59:5
     `  zoneinfo tzdb:   ${zoneinfoTzdbVersion} (${versions.zoneinfoRoot})`,
     '  One of these databases is stale. Offsets and transitions that',
     '  changed between the releases WILL differ between backends, and',
-    '  any verdict computed against the stale side is worth nothing.',
+    "",
     '################################################################',
   ].join('\n');

[Survived] StringLiteral
src/tz/versions.ts:61:10
     '  changed between the releases WILL differ between backends, and',
     '  any verdict computed against the stale side is worth nothing.',
     '################################################################',
-  ].join('\n');
+  ].join("");
 }
 
