[Survived] StringLiteral
src/tz/zoneinfo-source.ts:14:37
 import { fileURLToPath } from 'node:url';
 
 /** The conventional system zoneinfo directory. */
-export const SYSTEM_ZONEINFO_ROOT = '/usr/share/zoneinfo';
+export const SYSTEM_ZONEINFO_ROOT = "";
 
 /**

[Survived] StringLiteral
src/tz/zoneinfo-source.ts:21:41
  * ordinary zones: "right" holds leap-second-adjusted variants and
  * "posix" duplicates the default set.
  */
-const EXCLUDED_DIRS = new Set(['right', 'posix']);
+const EXCLUDED_DIRS = new Set(['right', ""]);
 
 /**

[Survived] ArrayDeclaration
src/tz/zoneinfo-source.ts:21:31
  * ordinary zones: "right" holds leap-second-adjusted variants and
  * "posix" duplicates the default set.
  */
-const EXCLUDED_DIRS = new Set(['right', 'posix']);
+const EXCLUDED_DIRS = new Set([]);
 
 /**

[Killed] BlockStatement
src/tz/zoneinfo-source.ts:29:55
  * by walking upward from this module, which works from both src/
  * (tsx) and dist/ (built) layouts.
  */
-export function vendoredZoneinfoRoot(): string | null {
-  let dir = path.dirname(fileURLToPath(import.meta.url));
-  for (let depth = 0; depth < 6; depth += 1) {
-    const candidate = path.join(dir, 'vendor', 'zoneinfo');
-    if (existsSync(candidate)) {
-      return candidate;
-    }
-    const parent = path.dirname(dir);
-    if (parent === dir) {
-      break;
-    }
-    dir = parent;
-  }
-  return null;
-}
+export function vendoredZoneinfoRoot(): string | null {}
 
 /**
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/tz/zoneinfo-source.ts:31:23
  */
 export function vendoredZoneinfoRoot(): string | null {
   let dir = path.dirname(fileURLToPath(import.meta.url));
-  for (let depth = 0; depth < 6; depth += 1) {
+  for (let depth = 0; false; depth += 1) {
     const candidate = path.join(dir, 'vendor', 'zoneinfo');
     if (existsSync(candidate)) {

[Survived] EqualityOperator
src/tz/zoneinfo-source.ts:31:23
  */
 export function vendoredZoneinfoRoot(): string | null {
   let dir = path.dirname(fileURLToPath(import.meta.url));
-  for (let depth = 0; depth < 6; depth += 1) {
+  for (let depth = 0; depth >= 6; depth += 1) {
     const candidate = path.join(dir, 'vendor', 'zoneinfo');
     if (existsSync(candidate)) {

[Survived] StringLiteral
src/tz/zoneinfo-source.ts:32:38
 export function vendoredZoneinfoRoot(): string | null {
   let dir = path.dirname(fileURLToPath(import.meta.url));
   for (let depth = 0; depth < 6; depth += 1) {
-    const candidate = path.join(dir, 'vendor', 'zoneinfo');
+    const candidate = path.join(dir, "", 'zoneinfo');
     if (existsSync(candidate)) {
       return candidate;

[Killed] ConditionalExpression
src/tz/zoneinfo-source.ts:33:9
   let dir = path.dirname(fileURLToPath(import.meta.url));
   for (let depth = 0; depth < 6; depth += 1) {
     const candidate = path.join(dir, 'vendor', 'zoneinfo');
-    if (existsSync(candidate)) {
+    if (true) {
       return candidate;
     }
killedBy: TZif binary parsing reads the 64-bit transition table and footer of America/New_York
statusReason: ENOENT: no such file or directory, open '/home/brad/projects/cronproof/.stryker-tmp/sandbox-1fqmxM/src/tz/vendor/zoneinfo/America/New_York'

[Survived] ConditionalExpression
src/tz/zoneinfo-source.ts:33:9
   let dir = path.dirname(fileURLToPath(import.meta.url));
   for (let depth = 0; depth < 6; depth += 1) {
     const candidate = path.join(dir, 'vendor', 'zoneinfo');
-    if (existsSync(candidate)) {
+    if (false) {
       return candidate;
     }

[Survived] EqualityOperator
src/tz/zoneinfo-source.ts:37:9
       return candidate;
     }
     const parent = path.dirname(dir);
-    if (parent === dir) {
+    if (parent !== dir) {
       break;
     }

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:37:25
       return candidate;
     }
     const parent = path.dirname(dir);
-    if (parent === dir) {
-      break;
-    }
+    if (parent === dir) {}
     dir = parent;
   }

[Killed] BlockStatement
src/tz/zoneinfo-source.ts:50:68
  * given, else the system path when present, else the vendored copy.
  * Throws when no root can be found.
  */
-export function resolveZoneinfoRoot(explicitRoot?: string): string {
-  if (explicitRoot !== undefined) {
-    if (!existsSync(explicitRoot)) {
-      throw new Error(`zoneinfo root does not exist: ${explicitRoot}`);
-    }
-    return explicitRoot;
-  }
-  if (existsSync(SYSTEM_ZONEINFO_ROOT)) {
-    return SYSTEM_ZONEINFO_ROOT;
-  }
-  const vendored = vendoredZoneinfoRoot();
-  if (vendored !== null) {
-    return vendored;
-  }
-  throw new Error(
-    `no zoneinfo root: ${SYSTEM_ZONEINFO_ROOT} is absent and no vendored copy was found`,
-  );
-}
+export function resolveZoneinfoRoot(explicitRoot?: string): string {}
 
 /**
killedBy: Pacific/Apia: two date-line moves, a repeated day in 1892 and a missing day in 2011 the 1892 move steps the offset back a full day and the 2011 move steps it forward a full day, erasing 2011-12-30
statusReason: The "path" argument must be of type string. Received undefined

[Killed] EqualityOperator
src/tz/zoneinfo-source.ts:51:7
  * Throws when no root can be found.
  */
 export function resolveZoneinfoRoot(explicitRoot?: string): string {
-  if (explicitRoot !== undefined) {
+  if (explicitRoot === undefined) {
     if (!existsSync(explicitRoot)) {
       throw new Error(`zoneinfo root does not exist: ${explicitRoot}`);
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] BlockStatement
src/tz/zoneinfo-source.ts:51:35
  * Throws when no root can be found.
  */
 export function resolveZoneinfoRoot(explicitRoot?: string): string {
-  if (explicitRoot !== undefined) {
-    if (!existsSync(explicitRoot)) {
-      throw new Error(`zoneinfo root does not exist: ${explicitRoot}`);
-    }
-    return explicitRoot;
-  }
+  if (explicitRoot !== undefined) {}
   if (existsSync(SYSTEM_ZONEINFO_ROOT)) {
     return SYSTEM_ZONEINFO_ROOT;
killedBy: negative DST data is reported raw, never as a season proxy vendored TZif reports Europe/Dublin winter as the DST variant at offset 0 and summer as standard time at +1h
statusReason: expected { offsetSeconds: +0, …(2) } to deeply equal { offsetSeconds: +0, …(2) }

[Killed] BooleanLiteral
src/tz/zoneinfo-source.ts:52:9
  */
 export function resolveZoneinfoRoot(explicitRoot?: string): string {
   if (explicitRoot !== undefined) {
-    if (!existsSync(explicitRoot)) {
+    if (existsSync(explicitRoot)) {
       throw new Error(`zoneinfo root does not exist: ${explicitRoot}`);
     }
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: zoneinfo root does not exist: /home/brad/projects/cronproof/.stryker-tmp/sandbox-1fqmxM/vendor/zoneinfo

[Killed] ConditionalExpression
src/tz/zoneinfo-source.ts:52:9
  */
 export function resolveZoneinfoRoot(explicitRoot?: string): string {
   if (explicitRoot !== undefined) {
-    if (!existsSync(explicitRoot)) {
+    if (true) {
       throw new Error(`zoneinfo root does not exist: ${explicitRoot}`);
     }
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: zoneinfo root does not exist: /home/brad/projects/cronproof/.stryker-tmp/sandbox-1fqmxM/vendor/zoneinfo

[NoCoverage] StringLiteral
src/tz/zoneinfo-source.ts:53:23
 export function resolveZoneinfoRoot(explicitRoot?: string): string {
   if (explicitRoot !== undefined) {
     if (!existsSync(explicitRoot)) {
-      throw new Error(`zoneinfo root does not exist: ${explicitRoot}`);
+      throw new Error(``);
     }
     return explicitRoot;

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:57:41
     }
     return explicitRoot;
   }
-  if (existsSync(SYSTEM_ZONEINFO_ROOT)) {
-    return SYSTEM_ZONEINFO_ROOT;
-  }
+  if (existsSync(SYSTEM_ZONEINFO_ROOT)) {}
   const vendored = vendoredZoneinfoRoot();
   if (vendored !== null) {

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:57:7
     }
     return explicitRoot;
   }
-  if (existsSync(SYSTEM_ZONEINFO_ROOT)) {
+  if (true) {
     return SYSTEM_ZONEINFO_ROOT;
   }

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:61:7
     return SYSTEM_ZONEINFO_ROOT;
   }
   const vendored = vendoredZoneinfoRoot();
-  if (vendored !== null) {
+  if (true) {
     return vendored;
   }

[NoCoverage] EqualityOperator
src/tz/zoneinfo-source.ts:61:7
     return SYSTEM_ZONEINFO_ROOT;
   }
   const vendored = vendoredZoneinfoRoot();
-  if (vendored !== null) {
+  if (vendored === null) {
     return vendored;
   }

[NoCoverage] StringLiteral
src/tz/zoneinfo-source.ts:65:5
     return vendored;
   }
   throw new Error(
-    `no zoneinfo root: ${SYSTEM_ZONEINFO_ROOT} is absent and no vendored copy was found`,
+    ``,
   );
 }

[Killed] BlockStatement
src/tz/zoneinfo-source.ts:73:70
  * Reads one zone's TZif file from the root. Rejects zone names that
  * would escape the root. Throws when the file does not exist.
  */
-export function readZoneFile(root: string, zone: string): Uint8Array {
-  if (zone.includes('..') || path.isAbsolute(zone)) {
-    throw new Error(`invalid zone name: ${zone}`);
-  }
-  return readFileSync(path.join(root, zone));
-}
+export function readZoneFile(root: string, zone: string): Uint8Array {}
 
 function isTzifFile(filePath: string): boolean {
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: Cannot read properties of undefined (reading 'buffer')

[Killed] ConditionalExpression
src/tz/zoneinfo-source.ts:74:7
  * would escape the root. Throws when the file does not exist.
  */
 export function readZoneFile(root: string, zone: string): Uint8Array {
-  if (zone.includes('..') || path.isAbsolute(zone)) {
+  if (true) {
     throw new Error(`invalid zone name: ${zone}`);
   }
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: invalid zone name: UTC

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:74:53
  * would escape the root. Throws when the file does not exist.
  */
 export function readZoneFile(root: string, zone: string): Uint8Array {
-  if (zone.includes('..') || path.isAbsolute(zone)) {
-    throw new Error(`invalid zone name: ${zone}`);
-  }
+  if (zone.includes('..') || path.isAbsolute(zone)) {}
   return readFileSync(path.join(root, zone));
 }

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:80:48
   return readFileSync(path.join(root, zone));
 }
 
-function isTzifFile(filePath: string): boolean {
-  try {
-    const fd = readFileSync(filePath);
-    return (
-      fd.length >= 4 &&
-      fd[0] === 0x54 &&
-      fd[1] === 0x5a &&
-      fd[2] === 0x69 &&
-      fd[3] === 0x66
-    );
-  } catch {
-    return false;
-  }
-}
+function isTzifFile(filePath: string): boolean {}
 
 /**

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:81:7
 }
 
 function isTzifFile(filePath: string): boolean {
-  try {
-    const fd = readFileSync(filePath);
-    return (
-      fd.length >= 4 &&
-      fd[0] === 0x54 &&
-      fd[1] === 0x5a &&
-      fd[2] === 0x69 &&
-      fd[3] === 0x66
-    );
-  } catch {
+  try {} catch {
     return false;
   }

[NoCoverage] LogicalOperator
src/tz/zoneinfo-source.ts:84:7
   try {
     const fd = readFileSync(filePath);
     return (
-      fd.length >= 4 &&
-      fd[0] === 0x54 &&
-      fd[1] === 0x5a &&
-      fd[2] === 0x69 &&
+      fd.length >= 4 && fd[0] === 0x54 && fd[1] === 0x5a || fd[2] === 0x69 &&
       fd[3] === 0x66
     );

[NoCoverage] EqualityOperator
src/tz/zoneinfo-source.ts:84:7
   try {
     const fd = readFileSync(filePath);
     return (
-      fd.length >= 4 &&
+      fd.length > 4 &&
       fd[0] === 0x54 &&
       fd[1] === 0x5a &&

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:85:7
     const fd = readFileSync(filePath);
     return (
       fd.length >= 4 &&
-      fd[0] === 0x54 &&
+      true &&
       fd[1] === 0x5a &&
       fd[2] === 0x69 &&

[NoCoverage] EqualityOperator
src/tz/zoneinfo-source.ts:85:7
     const fd = readFileSync(filePath);
     return (
       fd.length >= 4 &&
-      fd[0] === 0x54 &&
+      fd[0] !== 0x54 &&
       fd[1] === 0x5a &&
       fd[2] === 0x69 &&

[NoCoverage] EqualityOperator
src/tz/zoneinfo-source.ts:86:7
     return (
       fd.length >= 4 &&
       fd[0] === 0x54 &&
-      fd[1] === 0x5a &&
+      fd[1] !== 0x5a &&
       fd[2] === 0x69 &&
       fd[3] === 0x66

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:86:7
     return (
       fd.length >= 4 &&
       fd[0] === 0x54 &&
-      fd[1] === 0x5a &&
+      true &&
       fd[2] === 0x69 &&
       fd[3] === 0x66

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:87:7
       fd.length >= 4 &&
       fd[0] === 0x54 &&
       fd[1] === 0x5a &&
-      fd[2] === 0x69 &&
+      true &&
       fd[3] === 0x66
     );

[NoCoverage] EqualityOperator
src/tz/zoneinfo-source.ts:87:7
       fd.length >= 4 &&
       fd[0] === 0x54 &&
       fd[1] === 0x5a &&
-      fd[2] === 0x69 &&
+      fd[2] !== 0x69 &&
       fd[3] === 0x66
     );

[NoCoverage] EqualityOperator
src/tz/zoneinfo-source.ts:88:7
       fd[0] === 0x54 &&
       fd[1] === 0x5a &&
       fd[2] === 0x69 &&
-      fd[3] === 0x66
+      fd[3] !== 0x66
     );
   } catch {

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:88:7
       fd[0] === 0x54 &&
       fd[1] === 0x5a &&
       fd[2] === 0x69 &&
-      fd[3] === 0x66
+      true
     );
   } catch {

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:90:11
       fd[2] === 0x69 &&
       fd[3] === 0x66
     );
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:100:51
  * magic, as slash-separated names sorted ascending. Leap-second and
  * duplicate directories are excluded.
  */
-export function listZones(root: string): string[] {
-  const zones: string[] = [];
-  const walk = (relative: string): void => {
-    const absolute = path.join(root, relative);
-    for (const entry of readdirSync(absolute)) {
-      const relPath = relative === '' ? entry : `${relative}/${entry}`;
-      if (relative === '' && EXCLUDED_DIRS.has(entry)) {
-        continue;
-      }
-      const absPath = path.join(root, relPath);
-      const stat = statSync(absPath);
-      if (stat.isDirectory()) {
-        walk(relPath);
-      } else if (stat.isFile() && isTzifFile(absPath)) {
-        zones.push(relPath);
-      }
-    }
-  };
-  walk('');
-  return zones.sort();
-}
+export function listZones(root: string): string[] {}
 
 /**

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:102:44
  */
 export function listZones(root: string): string[] {
   const zones: string[] = [];
-  const walk = (relative: string): void => {
-    const absolute = path.join(root, relative);
-    for (const entry of readdirSync(absolute)) {
-      const relPath = relative === '' ? entry : `${relative}/${entry}`;
-      if (relative === '' && EXCLUDED_DIRS.has(entry)) {
-        continue;
-      }
-      const absPath = path.join(root, relPath);
-      const stat = statSync(absPath);
-      if (stat.isDirectory()) {
-        walk(relPath);
-      } else if (stat.isFile() && isTzifFile(absPath)) {
-        zones.push(relPath);
-      }
-    }
-  };
+  const walk = (relative: string): void => {};
   walk('');
   return zones.sort();

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:104:48
   const zones: string[] = [];
   const walk = (relative: string): void => {
     const absolute = path.join(root, relative);
-    for (const entry of readdirSync(absolute)) {
-      const relPath = relative === '' ? entry : `${relative}/${entry}`;
-      if (relative === '' && EXCLUDED_DIRS.has(entry)) {
-        continue;
-      }
-      const absPath = path.join(root, relPath);
-      const stat = statSync(absPath);
-      if (stat.isDirectory()) {
-        walk(relPath);
-      } else if (stat.isFile() && isTzifFile(absPath)) {
-        zones.push(relPath);
-      }
-    }
+    for (const entry of readdirSync(absolute)) {}
   };
   walk('');

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:105:23
   const walk = (relative: string): void => {
     const absolute = path.join(root, relative);
     for (const entry of readdirSync(absolute)) {
-      const relPath = relative === '' ? entry : `${relative}/${entry}`;
+      const relPath = true ? entry : `${relative}/${entry}`;
       if (relative === '' && EXCLUDED_DIRS.has(entry)) {
         continue;

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:105:23
   const walk = (relative: string): void => {
     const absolute = path.join(root, relative);
     for (const entry of readdirSync(absolute)) {
-      const relPath = relative === '' ? entry : `${relative}/${entry}`;
+      const relPath = false ? entry : `${relative}/${entry}`;
       if (relative === '' && EXCLUDED_DIRS.has(entry)) {
         continue;

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:106:11
     const absolute = path.join(root, relative);
     for (const entry of readdirSync(absolute)) {
       const relPath = relative === '' ? entry : `${relative}/${entry}`;
-      if (relative === '' && EXCLUDED_DIRS.has(entry)) {
+      if (false) {
         continue;
       }

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:106:56
     const absolute = path.join(root, relative);
     for (const entry of readdirSync(absolute)) {
       const relPath = relative === '' ? entry : `${relative}/${entry}`;
-      if (relative === '' && EXCLUDED_DIRS.has(entry)) {
-        continue;
-      }
+      if (relative === '' && EXCLUDED_DIRS.has(entry)) {}
       const absPath = path.join(root, relPath);
       const stat = statSync(absPath);

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:111:31
       }
       const absPath = path.join(root, relPath);
       const stat = statSync(absPath);
-      if (stat.isDirectory()) {
-        walk(relPath);
-      } else if (stat.isFile() && isTzifFile(absPath)) {
+      if (stat.isDirectory()) {} else if (stat.isFile() && isTzifFile(absPath)) {
         zones.push(relPath);
       }

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:111:11
       }
       const absPath = path.join(root, relPath);
       const stat = statSync(absPath);
-      if (stat.isDirectory()) {
+      if (true) {
         walk(relPath);
       } else if (stat.isFile() && isTzifFile(absPath)) {

[NoCoverage] ConditionalExpression
src/tz/zoneinfo-source.ts:113:18
       const stat = statSync(absPath);
       if (stat.isDirectory()) {
         walk(relPath);
-      } else if (stat.isFile() && isTzifFile(absPath)) {
+      } else if (false) {
         zones.push(relPath);
       }

[NoCoverage] LogicalOperator
src/tz/zoneinfo-source.ts:113:18
       const stat = statSync(absPath);
       if (stat.isDirectory()) {
         walk(relPath);
-      } else if (stat.isFile() && isTzifFile(absPath)) {
+      } else if (stat.isFile() || isTzifFile(absPath)) {
         zones.push(relPath);
       }

[NoCoverage] MethodExpression
src/tz/zoneinfo-source.ts:119:10
     }
   };
   walk('');
-  return zones.sort();
+  return zones;
 }
 

[Killed] BlockStatement
src/tz/zoneinfo-source.ts:127:66
  * or from the first line of tzdata.zi. Returns null when neither
  * source is present.
  */
-export function readZoneinfoVersion(root: string): string | null {
-  try {
-    return readFileSync(path.join(root, '+VERSION'), 'utf8').trim();
-  } catch {
-    // fall through to tzdata.zi
-  }
-  try {
-    const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
-    const match = /^#\s*version\s+(\S+)/.exec(firstLine);
-    return match?.[1] ?? null;
-  } catch {
-    return null;
-  }
-}
+export function readZoneinfoVersion(root: string): string | null {}
 
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: expected undefined to be '2025b' // Object.is equality

[Killed] BlockStatement
src/tz/zoneinfo-source.ts:128:7
  * source is present.
  */
 export function readZoneinfoVersion(root: string): string | null {
-  try {
-    return readFileSync(path.join(root, '+VERSION'), 'utf8').trim();
-  } catch {
+  try {} catch {
     // fall through to tzdata.zi
   }
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: expected null to be '2025b' // Object.is equality

[Killed] MethodExpression
src/tz/zoneinfo-source.ts:129:12
  */
 export function readZoneinfoVersion(root: string): string | null {
   try {
-    return readFileSync(path.join(root, '+VERSION'), 'utf8').trim();
+    return readFileSync(path.join(root, '+VERSION'), 'utf8');
   } catch {
     // fall through to tzdata.zi
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: expected '2025b\n' to be '2025b' // Object.is equality

[Killed] StringLiteral
src/tz/zoneinfo-source.ts:129:54
  */
 export function readZoneinfoVersion(root: string): string | null {
   try {
-    return readFileSync(path.join(root, '+VERSION'), 'utf8').trim();
+    return readFileSync(path.join(root, '+VERSION'), "").trim();
   } catch {
     // fall through to tzdata.zi
killedBy: tzdb version reporting reports the Intl tzdb version and the zoneinfo tzdb version separately
statusReason: expected null to be '2025b' // Object.is equality

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:133:7
   } catch {
     // fall through to tzdata.zi
   }
-  try {
-    const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
-    const match = /^#\s*version\s+(\S+)/.exec(firstLine);
-    return match?.[1] ?? null;
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] LogicalOperator
src/tz/zoneinfo-source.ts:134:23
     // fall through to tzdata.zi
   }
   try {
-    const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
+    const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] && '';
     const match = /^#\s*version\s+(\S+)/.exec(firstLine);
     return match?.[1] ?? null;

[NoCoverage] StringLiteral
src/tz/zoneinfo-source.ts:134:66
     // fall through to tzdata.zi
   }
   try {
-    const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
+    const firstLine = readFileSync(path.join(root, 'tzdata.zi'), "").split('\n', 1)[0] ?? '';
     const match = /^#\s*version\s+(\S+)/.exec(firstLine);
     return match?.[1] ?? null;

[NoCoverage] Regex
src/tz/zoneinfo-source.ts:135:19
   }
   try {
     const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
-    const match = /^#\s*version\s+(\S+)/.exec(firstLine);
+    const match = /#\s*version\s+(\S+)/.exec(firstLine);
     return match?.[1] ?? null;
   } catch {

[NoCoverage] LogicalOperator
src/tz/zoneinfo-source.ts:136:12
   try {
     const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
     const match = /^#\s*version\s+(\S+)/.exec(firstLine);
-    return match?.[1] ?? null;
+    return match?.[1] && null;
   } catch {
     return null;

[NoCoverage] OptionalChaining
src/tz/zoneinfo-source.ts:136:12
   try {
     const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
     const match = /^#\s*version\s+(\S+)/.exec(firstLine);
-    return match?.[1] ?? null;
+    return match[1] ?? null;
   } catch {
     return null;

[NoCoverage] BlockStatement
src/tz/zoneinfo-source.ts:137:11
     const firstLine = readFileSync(path.join(root, 'tzdata.zi'), 'utf8').split('\n', 1)[0] ?? '';
     const match = /^#\s*version\s+(\S+)/.exec(firstLine);
     return match?.[1] ?? null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
