[Killed] BlockStatement
src/hazard/build-hazard.ts:37:56
 }
 
 /** Builds a hazard, computing its stable id and severity. */
-export function makeHazard(draft: HazardDraft): Hazard {
-  return {
-    id: hazardId({
-      expression: draft.expression,
-      dialect: draft.dialect,
-      zone: draft.zone,
-      intendedLocal: draft.intendedLocal,
-      kind: draft.kind,
-    }),
-    kind: draft.kind,
-    severity: severityFor(draft.kind, draft.idempotent),
-    expression: draft.expression,
-    dialect: draft.dialect,
-    zone: draft.zone,
-    intendedLocal: draft.intendedLocal,
-    instants: draft.instants,
-    causingTransition: draft.causingTransition,
-    detail: draft.detail,
-  };
-}
+export function makeHazard(draft: HazardDraft): Hazard {}
 
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: Cannot read properties of undefined (reading 'kind')
