[Killed] BlockStatement
src/hazard/hazard-id.ts:16:57
 import type { HazardKind } from './types';
 
 /** Formats a local firing as a fixed-width, zone-free timestamp. */
-export function formatLocal(local: LocalFiring): string {
-  const p = (n: number, width = 2): string => String(n).padStart(width, '0');
-  return (
-    `${p(local.year, 4)}-${p(local.month)}-${p(local.day)}` +
-    `T${p(local.hour)}:${p(local.minute)}:${p(local.second)}`
-  );
-}
+export function formatLocal(local: LocalFiring): string {}
 
 /** The identity tuple hashed into a hazard id. */
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected 'hz_f3887246b40fd7b9' to be 'hz_feef0ab468b6e246' // Object.is equality

[Killed] ArrowFunction
src/hazard/hazard-id.ts:17:13
 
 /** Formats a local firing as a fixed-width, zone-free timestamp. */
 export function formatLocal(local: LocalFiring): string {
-  const p = (n: number, width = 2): string => String(n).padStart(width, '0');
+  const p = () => undefined;
   return (
     `${p(local.year, 4)}-${p(local.month)}-${p(local.day)}` +
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected 'hz_85c1d095bc43e6c1' to be 'hz_feef0ab468b6e246' // Object.is equality

[Killed] StringLiteral
src/hazard/hazard-id.ts:17:73
 
 /** Formats a local firing as a fixed-width, zone-free timestamp. */
 export function formatLocal(local: LocalFiring): string {
-  const p = (n: number, width = 2): string => String(n).padStart(width, '0');
+  const p = (n: number, width = 2): string => String(n).padStart(width, "");
   return (
     `${p(local.year, 4)}-${p(local.month)}-${p(local.day)}` +
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected 'hz_61dcf16cfd600d9f' to be 'hz_feef0ab468b6e246' // Object.is equality

[Killed] StringLiteral
src/hazard/hazard-id.ts:19:5
 export function formatLocal(local: LocalFiring): string {
   const p = (n: number, width = 2): string => String(n).padStart(width, '0');
   return (
-    `${p(local.year, 4)}-${p(local.month)}-${p(local.day)}` +
+    `` +
     `T${p(local.hour)}:${p(local.minute)}:${p(local.second)}`
   );
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected 'hz_74d2608a9a4e051b' to be 'hz_feef0ab468b6e246' // Object.is equality

[Killed] BlockStatement
src/hazard/hazard-id.ts:45:60
  * timestamp, kind) is space-free, so the space join is unambiguous.
  * Prefixed with "hz_" so it reads as an id in output and baselines.
  */
-export function hazardId(identity: HazardIdentity): string {
-  const canonical = [
-    identity.expression,
-    identity.dialect,
-    identity.zone,
-    formatLocal(identity.intendedLocal),
-    identity.kind,
-  ].join(' ');
-  const digest = createHash('sha256').update(canonical, 'utf8').digest('hex');
-  return `hz_${digest.slice(0, 16)}`;
-}
+export function hazardId(identity: HazardIdentity): string {}
 
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected undefined to be 'hz_feef0ab468b6e246' // Object.is equality

[Killed] StringLiteral
src/hazard/hazard-id.ts:53:29
     formatLocal(identity.intendedLocal),
     identity.kind,
   ].join(' ');
-  const digest = createHash('sha256').update(canonical, 'utf8').digest('hex');
+  const digest = createHash("").update(canonical, 'utf8').digest('hex');
   return `hz_${digest.slice(0, 16)}`;
 }
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: Digest method not supported

[Killed] MethodExpression
src/hazard/hazard-id.ts:54:16
     identity.kind,
   ].join(' ');
   const digest = createHash('sha256').update(canonical, 'utf8').digest('hex');
-  return `hz_${digest.slice(0, 16)}`;
+  return `hz_${digest}`;
 }
 
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected 'hz_feef0ab468b6e246ee0a7fbee30ab9b1be…' to be 'hz_feef0ab468b6e246' // Object.is equality

[Killed] StringLiteral
src/hazard/hazard-id.ts:54:10
     identity.kind,
   ].join(' ');
   const digest = createHash('sha256').update(canonical, 'utf8').digest('hex');
-  return `hz_${digest.slice(0, 16)}`;
+  return ``;
 }
 
killedBy: hazard id stability the id of a known hazard equals a pinned literal
statusReason: expected '' to be 'hz_feef0ab468b6e246' // Object.is equality
