[Killed] ConditionalExpression
src/hazard/per-firing.ts:26:9
   const hazards: Hazard[] = [];
   for (const firing of resolved) {
     const resolution = firing.resolution;
-    if (resolution.kind === 'nonexistent') {
+    if (true) {
       hazards.push(
         makeHazard({
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [ { …(10) }, { …(10) }, …(364) ] to have a length of 1 but got 366

[Killed] BlockStatement
src/hazard/per-firing.ts:26:44
   const hazards: Hazard[] = [];
   for (const firing of resolved) {
     const resolution = firing.resolution;
-    if (resolution.kind === 'nonexistent') {
-      hazards.push(
-        makeHazard({
-          kind: 'SKIPPED',
-          expression,
-          dialect,
-          zone,
-          intendedLocal: firing.local,
-          instants: [],
-          causingTransition: transitionAtInstant(backend, zone, resolution.transitionInstant),
-          idempotent,
-          detail: {
-            kind: 'SKIPPED',
-            skipped: {
-              gapStartWallMillis: resolution.gapStartWallMillis,
-              gapEndWallMillis: resolution.gapEndWallMillis,
-              gapDurationMillis: resolution.gapDurationMilliseconds,
-            },
-          },
-        }),
-      );
-    } else if (resolution.kind === 'ambiguous') {
+    if (resolution.kind === 'nonexistent') {} else if (resolution.kind === 'ambiguous') {
       hazards.push(
         makeHazard({
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/hazard/per-firing.ts:34:21
           dialect,
           zone,
           intendedLocal: firing.local,
-          instants: [],
+          instants: ["Stryker was here"],
           causingTransition: transitionAtInstant(backend, zone, resolution.transitionInstant),
           idempotent,
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ObjectLiteral
src/hazard/per-firing.ts:37:19
           instants: [],
           causingTransition: transitionAtInstant(backend, zone, resolution.transitionInstant),
           idempotent,
-          detail: {
-            kind: 'SKIPPED',
-            skipped: {
-              gapStartWallMillis: resolution.gapStartWallMillis,
-              gapEndWallMillis: resolution.gapEndWallMillis,
-              gapDurationMillis: resolution.gapDurationMilliseconds,
-            },
-          },
+          detail: {},
         }),
       );
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected false to be 3600000 // Object.is equality

[Killed] StringLiteral
src/hazard/per-firing.ts:38:19
           causingTransition: transitionAtInstant(backend, zone, resolution.transitionInstant),
           idempotent,
           detail: {
-            kind: 'SKIPPED',
+            kind: "",
             skipped: {
               gapStartWallMillis: resolution.gapStartWallMillis,
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected false to be 3600000 // Object.is equality

[Killed] ConditionalExpression
src/hazard/per-firing.ts:47:16
           },
         }),
       );
-    } else if (resolution.kind === 'ambiguous') {
+    } else if (true) {
       hazards.push(
         makeHazard({
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected [ { …(10) }, { …(10) }, …(363) ] to have a length of +0 but got 365

[Killed] BlockStatement
src/hazard/per-firing.ts:47:49
           },
         }),
       );
-    } else if (resolution.kind === 'ambiguous') {
-      hazards.push(
-        makeHazard({
-          kind: 'DOUBLED',
-          expression,
-          dialect,
-          zone,
-          intendedLocal: firing.local,
-          instants: [resolution.earlierInstant, resolution.laterInstant],
-          causingTransition: foldTransition(
-            backend,
-            zone,
-            resolution.earlierInstant,
-            resolution.laterInstant,
-          ),
-          idempotent,
-          detail: {
-            kind: 'DOUBLED',
-            doubled: { foldDurationMillis: resolution.foldDurationMilliseconds },
-          },
-        }),
-      );
-    }
+    } else if (resolution.kind === 'ambiguous') {}
   }
   return hazards;
killedBy: the November fall-back doubles 01:30, not 02:30 (documented correction) 30 1 * * * has exactly one DOUBLED on November 3 at 01:30 with both instants
statusReason: expected [] to have a length of 1 but got +0
