[Killed] BlockStatement
src/hazard/resolve-firings.ts:32:18
   zone: string,
   from: LocalFiring,
   to: LocalFiring,
-): LocalFiring[] {
-  return enumerate(ast, { zone, from, to });
-}
+): LocalFiring[] {}
 
 /** Resolves each intended firing through the timezone engine. */
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
src/hazard/resolve-firings.ts:33:25
   from: LocalFiring,
   to: LocalFiring,
 ): LocalFiring[] {
-  return enumerate(ast, { zone, from, to });
+  return enumerate(ast, {});
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: Cannot read properties of undefined (reading 'year')

[Killed] BlockStatement
src/hazard/resolve-firings.ts:41:21
   firings: LocalFiring[],
   zone: string,
   backend: TzBackend,
-): ResolvedFiring[] {
-  return firings.map((local) => ({
-    local,
-    wallMillis: wallMillisFromFields(local),
-    resolution: resolveWallClock(local, zone, backend),
-  }));
-}
+): ResolvedFiring[] {}
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: resolved is not iterable

[Killed] ArrowFunction
src/hazard/resolve-firings.ts:42:22
   zone: string,
   backend: TzBackend,
 ): ResolvedFiring[] {
-  return firings.map((local) => ({
-    local,
-    wallMillis: wallMillisFromFields(local),
-    resolution: resolveWallClock(local, zone, backend),
-  }));
+  return firings.map(() => undefined);
 }
 
killedBy: hazard id stability the classifier assigns that same id to the hazard it produces
statusReason: Cannot read properties of undefined (reading 'resolution')
