[Killed] ObjectLiteral
src/hazard/severity.ts:12:40
 
 import type { HazardKind, Severity } from './types';
 
-const RANK: Record<Severity, number> = {
-  info: 0,
-  low: 1,
-  medium: 2,
-  high: 3,
-  critical: 4,
-};
+const RANK: Record<Severity, number> = {};
 
 /** Numeric rank of a severity, higher being more severe. */
killedBy: severity model a double of non-idempotent work outranks a skip
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/hazard/severity.ts:21:58
 };
 
 /** Numeric rank of a severity, higher being more severe. */
-export function severityRank(severity: Severity): number {
-  return RANK[severity];
-}
+export function severityRank(severity: Severity): number {}
 
 /**
killedBy: severity model a double of non-idempotent work outranks a skip
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/hazard/severity.ts:40:78
  * - ZONE_UNSTABLE: info. Not a fault, a label: the region is a
  *   prediction from POSIX extrapolation, not a recorded fact.
  */
-export function severityFor(kind: HazardKind, idempotent: boolean): Severity {
-  switch (kind) {
-    case 'DOUBLED':
-      return idempotent ? 'low' : 'critical';
-    case 'SKIPPED':
-      return 'high';
-    case 'COUNT_ANOMALY':
-      return 'high';
-    case 'INTERVAL_DRIFT':
-      return 'medium';
-    case 'ZONE_UNSTABLE':
-      return 'info';
-  }
-}
+export function severityFor(kind: HazardKind, idempotent: boolean): Severity {}
 
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected undefined to be 'info' // Object.is equality

[Killed] ConditionalExpression
src/hazard/severity.ts:42:5
  */
 export function severityFor(kind: HazardKind, idempotent: boolean): Severity {
   switch (kind) {
-    case 'DOUBLED':
-      return idempotent ? 'low' : 'critical';
+    case 'DOUBLED':
     case 'SKIPPED':
       return 'high';
killedBy: severity model a double of non-idempotent work outranks a skip
statusReason: expected 3 to be greater than 3

[Survived] ConditionalExpression
src/hazard/severity.ts:44:5
   switch (kind) {
     case 'DOUBLED':
       return idempotent ? 'low' : 'critical';
-    case 'SKIPPED':
-      return 'high';
+    case 'SKIPPED':
     case 'COUNT_ANOMALY':
       return 'high';

[Survived] ConditionalExpression
src/hazard/severity.ts:46:5
       return idempotent ? 'low' : 'critical';
     case 'SKIPPED':
       return 'high';
-    case 'COUNT_ANOMALY':
-      return 'high';
+    case 'COUNT_ANOMALY':
     case 'INTERVAL_DRIFT':
       return 'medium';

[Survived] StringLiteral
src/hazard/severity.ts:47:14
     case 'SKIPPED':
       return 'high';
     case 'COUNT_ANOMALY':
-      return 'high';
+      return "";
     case 'INTERVAL_DRIFT':
       return 'medium';

[Survived] ConditionalExpression
src/hazard/severity.ts:48:5
       return 'high';
     case 'COUNT_ANOMALY':
       return 'high';
-    case 'INTERVAL_DRIFT':
-      return 'medium';
+    case 'INTERVAL_DRIFT':
     case 'ZONE_UNSTABLE':
       return 'info';

[Killed] ConditionalExpression
src/hazard/severity.ts:50:5
       return 'high';
     case 'INTERVAL_DRIFT':
       return 'medium';
-    case 'ZONE_UNSTABLE':
-      return 'info';
+    case 'ZONE_UNSTABLE':
   }
 }
killedBy: severity model non-idempotent double is critical and skip is high by default
statusReason: expected undefined to be 'info' // Object.is equality

[Killed] StringLiteral
src/hazard/severity.ts:51:14
     case 'INTERVAL_DRIFT':
       return 'medium';
     case 'ZONE_UNSTABLE':
-      return 'info';
+      return "";
   }
 }
killedBy: ZONE_UNSTABLE labels predicted regions past the last recorded transition a daily job the year after New York's last table transition is labeled footer-extrapolation
statusReason: expected '' to be 'info' // Object.is equality
