[Killed] BlockStatement
src/hazard/transitions.ts:12:67
 
 const DAY_MILLIS = 86_400_000;
 
-function toCausing(transition: ZoneTransition): CausingTransition {
-  return {
-    instant: transition.instant,
-    offsetBeforeSeconds: transition.offsetBeforeSeconds,
-    offsetAfterSeconds: transition.offsetAfterSeconds,
-    deltaSeconds: transition.deltaSeconds,
-  };
-}
+function toCausing(transition: ZoneTransition): CausingTransition {}
 
 /**
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected undefined to be 1710054000000 // Object.is equality

[Killed] BlockStatement
src/hazard/transitions.ts:30:29
   backend: TzBackend,
   zone: string,
   instant: number,
-): CausingTransition | null {
-  const found = backend.transitionsBetween(instant, instant + 1, zone);
-  const first = found[0];
-  return first === undefined ? null : toCausing(first);
-}
+): CausingTransition | null {}
 
 /**
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected undefined to be 1710054000000 // Object.is equality

[Killed] ArithmeticOperator
src/hazard/transitions.ts:31:53
   zone: string,
   instant: number,
 ): CausingTransition | null {
-  const found = backend.transitionsBetween(instant, instant + 1, zone);
+  const found = backend.transitionsBetween(instant, instant - 1, zone);
   const first = found[0];
   return first === undefined ? null : toCausing(first);
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected undefined to be 1710054000000 // Object.is equality

[Killed] EqualityOperator
src/hazard/transitions.ts:33:10
 ): CausingTransition | null {
   const found = backend.transitionsBetween(instant, instant + 1, zone);
   const first = found[0];
-  return first === undefined ? null : toCausing(first);
+  return first !== undefined ? null : toCausing(first);
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected undefined to be 1710054000000 // Object.is equality

[Killed] ConditionalExpression
src/hazard/transitions.ts:33:10
 ): CausingTransition | null {
   const found = backend.transitionsBetween(instant, instant + 1, zone);
   const first = found[0];
-  return first === undefined ? null : toCausing(first);
+  return true ? null : toCausing(first);
 }
 
killedBy: 30 2 * * * America/New_York over 2024 exactly one SKIPPED on March 10, at 02:30, caused by the spring-forward transition
statusReason: expected undefined to be 1710054000000 // Object.is equality

[Survived] BlockStatement
src/hazard/transitions.ts:45:29
   zone: string,
   earlierInstant: number,
   laterInstant: number,
-): CausingTransition | null {
-  const found = backend.transitionsBetween(earlierInstant, laterInstant + 1, zone);
-  for (const transition of found) {
-    if (transition.deltaSeconds < 0) {
-      return toCausing(transition);
-    }
-  }
-  return null;
-}
+): CausingTransition | null {}
 
 /**

[Survived] ArithmeticOperator
src/hazard/transitions.ts:46:60
   earlierInstant: number,
   laterInstant: number,
 ): CausingTransition | null {
-  const found = backend.transitionsBetween(earlierInstant, laterInstant + 1, zone);
+  const found = backend.transitionsBetween(earlierInstant, laterInstant - 1, zone);
   for (const transition of found) {
     if (transition.deltaSeconds < 0) {

[Survived] BlockStatement
src/hazard/transitions.ts:47:35
   laterInstant: number,
 ): CausingTransition | null {
   const found = backend.transitionsBetween(earlierInstant, laterInstant + 1, zone);
-  for (const transition of found) {
-    if (transition.deltaSeconds < 0) {
-      return toCausing(transition);
-    }
-  }
+  for (const transition of found) {}
   return null;
 }

[Survived] ConditionalExpression
src/hazard/transitions.ts:48:9
 ): CausingTransition | null {
   const found = backend.transitionsBetween(earlierInstant, laterInstant + 1, zone);
   for (const transition of found) {
-    if (transition.deltaSeconds < 0) {
+    if (true) {
       return toCausing(transition);
     }

[Survived] BlockStatement
src/hazard/transitions.ts:48:38
 ): CausingTransition | null {
   const found = backend.transitionsBetween(earlierInstant, laterInstant + 1, zone);
   for (const transition of found) {
-    if (transition.deltaSeconds < 0) {
-      return toCausing(transition);
-    }
+    if (transition.deltaSeconds < 0) {}
   }
   return null;

[Killed] BlockStatement
src/hazard/transitions.ts:66:21
   zone: string,
   from: LocalFiring,
   to: LocalFiring,
-): ZoneTransition[] {
-  const start = wallMillisFromFields(from) - 2 * DAY_MILLIS;
-  const end = wallMillisFromFields(to) + 2 * DAY_MILLIS;
-  return backend.transitionsBetween(start, end, zone);
-}
+): ZoneTransition[] {}
 
killedBy: null test: UTC schedules produce zero hazards */15 * * * * in vixie dialect yields no hazards in any UTC zone
statusReason: windowTransitions is not a function or its return value is not iterable

[Survived] ArithmeticOperator
src/hazard/transitions.ts:67:17
   from: LocalFiring,
   to: LocalFiring,
 ): ZoneTransition[] {
-  const start = wallMillisFromFields(from) - 2 * DAY_MILLIS;
+  const start = wallMillisFromFields(from) + 2 * DAY_MILLIS;
   const end = wallMillisFromFields(to) + 2 * DAY_MILLIS;
   return backend.transitionsBetween(start, end, zone);

[Survived] ArithmeticOperator
src/hazard/transitions.ts:67:46
   from: LocalFiring,
   to: LocalFiring,
 ): ZoneTransition[] {
-  const start = wallMillisFromFields(from) - 2 * DAY_MILLIS;
+  const start = wallMillisFromFields(from) - 2 / DAY_MILLIS;
   const end = wallMillisFromFields(to) + 2 * DAY_MILLIS;
   return backend.transitionsBetween(start, end, zone);

[Survived] ArithmeticOperator
src/hazard/transitions.ts:68:42
   to: LocalFiring,
 ): ZoneTransition[] {
   const start = wallMillisFromFields(from) - 2 * DAY_MILLIS;
-  const end = wallMillisFromFields(to) + 2 * DAY_MILLIS;
+  const end = wallMillisFromFields(to) + 2 / DAY_MILLIS;
   return backend.transitionsBetween(start, end, zone);
 }

[Survived] ArithmeticOperator
src/hazard/transitions.ts:68:15
   to: LocalFiring,
 ): ZoneTransition[] {
   const start = wallMillisFromFields(from) - 2 * DAY_MILLIS;
-  const end = wallMillisFromFields(to) + 2 * DAY_MILLIS;
+  const end = wallMillisFromFields(to) - 2 * DAY_MILLIS;
   return backend.transitionsBetween(start, end, zone);
 }
